[
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Initialize()] [Authorization Bypass] Can an attacker call Initialize() multiple times by front-running the first initialization to set their own privileged proposer and gain permanent control over the default organization? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Initialize()] [State Manipulation] If Initialize() is called with a null PrivilegedProposer, does the empty ProposerWhiteList combined with ProposerAuthorityRequired=true create a permanent DOS where no one can create proposals for the default organization? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Initialize()] [Logic Error] Can Initialize() be called with ProposerAuthorityRequired=true and ParliamentMemberProposingAllowed=false to create an unusable default organization if no PrivilegedProposer is provided? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Initialize()] [Validation Bypass] Does Initialize() validate that the default organization thresholds (MinimalApprovalThreshold=6667, MinimalVoteThreshold=7500, etc.) are compatible with the actual parliament size, or can initialization succeed with mathematically impossible thresholds? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Initialize()] [Reentrancy] Can an attacker exploit reentrancy during CreateNewOrganization() within Initialize() to manipulate the DefaultOrganizationAddress before State.Initialized is set to true? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganizationBySystemContract()] [Authorization Bypass] Can a malicious contract register itself as a system contract in the mapping to bypass the system contract check and create organizations with arbitrary parameters? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganizationBySystemContract()] [Reentrancy Attack] Can the inline call at line 45 (SendInline) be exploited for reentrancy to call CreateOrganizationBySystemContract again before the function completes, creating duplicate organizations? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganizationBySystemContract()] [DOS Attack] Can an attacker spam CreateOrganizationBySystemContract() calls with invalid OrganizationAddressFeedbackMethod to cause excessive gas consumption in the calling system contract? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganizationBySystemContract()] [Logic Error] If OrganizationAddressFeedbackMethod is an empty string, does SendInline() fail silently or revert, and can this be exploited to create organizations without proper feedback? (Low)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganizationBySystemContract()] [State Inconsistency] Can the system contract that creates an organization be removed from the system contract mapping after creation, breaking the invariant that only system contracts create system-level organizations? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganization()] [Authorization Bypass] Can an attacker exploit the OR condition in the authorization check (line 52-54) to create organizations by satisfying only one condition when multiple should be required? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganization()] [Logic Error] Does the check 'State.DefaultOrganizationAddress.Value == Context.Sender' allow the default organization to create unlimited child organizations without whitelist restrictions, enabling organization spam? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganization()] [Race Condition] Can two parliament members simultaneously call CreateOrganization() with identical CreateOrganizationInput parameters, causing organization address collisions or duplicate registrations? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganization()] [Validation Bypass] If ValidateAddressInWhiteList() is checked before the ProposerWhiteList state is initialized, can an attacker create organizations during the initialization window? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateOrganization()] [DOS Vector] Can an attacker create thousands of organizations with minimal thresholds to bloat state storage and make organization enumeration prohibitively expensive? (Low)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateProposal()] [Authorization Bypass] Can an attacker bypass AssertIsAuthorizedProposer() by exploiting race conditions in the parliament member list update from the consensus contract? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateProposal()] [State Manipulation] Can an attacker create a proposal with OrganizationAddress pointing to a non-existent organization that will be created later, bypassing authorization checks? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateProposal()] [Collision Attack] Can an attacker predict or brute-force proposal IDs generated by GenerateProposalId() to create proposal ID collisions with legitimate proposals? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateProposal()] [DOS Attack] Can an attacker spam CreateProposal() calls with proposals that expire immediately to bloat the Proposals state mapping? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateProposal()] [Front-Running] Can a malicious proposer front-run a legitimate proposal by copying its parameters and submitting it first with the same Token, stealing the proposal ID? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateProposalBySystemContract()] [Authorization Bypass] Can a system contract create proposals on behalf of any OriginProposer without verifying that the OriginProposer actually authorized the proposal creation? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateProposalBySystemContract()] [Logic Error] Does the function verify that OriginProposer matches Context.Origin, or can a system contract forge proposals for arbitrary addresses? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateProposalBySystemContract()] [Replay Attack] Can a malicious system contract replay the same CreateProposalBySystemContractInput multiple times to create duplicate proposals? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: CreateProposalBySystemContract()] [State Inconsistency] If a system contract is removed from the mapping after creating a proposal, does the proposal remain valid or should it be invalidated? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Approve()] [Vote Manipulation] Can a parliament member who controls multiple managed pubkeys through the Election contract vote multiple times on the same proposal by switching between addresses? (Critical)"
]