[
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForTitle] [Design Flaw] Could the 255-character limit for proposal titles be insufficient for complex governance proposals requiring detailed naming, leading to ambiguous or misleading truncated titles that mask malicious intent? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForDescription] [Design Flaw] Could the 10,200-character limit for proposal descriptions be insufficient for complex technical proposals requiring detailed specification, forcing proposers to use external URLs that could contain malicious or misleading information not subject to on-chain validation? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Design Flaw] Could the 255-character limit for description URLs be insufficient for legitimate long URLs with query parameters or deep paths, forcing proposers to use URL shorteners that could mask malicious redirect chains? (Low)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForTitle] [Resource Exhaustion] Could an attacker create thousands of proposals with exactly 255-character titles to maximize storage costs and bloat the blockchain state, causing economic DOS against the network? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForDescription] [Resource Exhaustion] Could an attacker spam proposals with 10,200-character descriptions to rapidly consume blockchain storage, especially if proposal creation has low economic barriers, leading to state bloat and increased node synchronization time? (High)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constants: All] [Encoding Attack] Are these byte-length or character-length limits, and could multi-byte UTF-8 characters allow an attacker to exceed intended storage limits by using characters that take 3-4 bytes each while staying under the character count? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForDescription] [Phishing Attack] Could the large 10,200-character description limit enable attackers to craft sophisticated phishing content with fake transaction details, misleading voters into approving malicious proposals disguised as legitimate governance actions? (High)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Validation Bypass] Does the URL length validation prevent attackers from using data URIs (data:text/html,<script>...) that could contain malicious content within the 255-character limit? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constants: All] [Consistency Issue] Are these limits consistent with Parliament and Association governance contracts, and could inconsistency enable attacks where malicious proposals are created in one governance system but cannot be properly displayed or validated in cross-contract scenarios? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForTitle] [Information Disclosure] Could the 255-character title limit be exploited to create proposals with identical prefixes but different suffixes, causing UI truncation that hides the actual proposal intent from voters in list views? (Low)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForDescription] [Injection Attack] Could the description field accept special characters or control characters that, when combined with the 10,200-character limit, enable injection attacks in downstream systems that display or process proposal content? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Redirect Attack] Could an attacker use the maximum 255-character URL to point to a legitimate domain initially, then change the redirect target post-proposal-creation to mask malicious intent from voters who reviewed the original URL? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constants: All] [Gas Limit Issue] Could proposals with maximum-length fields (255 + 10200 + 255 = 10,710 characters) exceed block gas limits during proposal creation, release, or query operations, causing DOS for legitimate large proposals? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForDescription] [Content Injection] Could attackers use the 10,200-character description to embed formatted content that appears as legitimate system messages or warnings when displayed in governance UIs, manipulating voter perception? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForTitle] [Collision Attack] Could the 255-character limit combined with truncation in display layers enable attackers to create multiple proposals with intentionally similar titles to cause voter confusion about which proposal they're approving? (Low)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constants: All] [Validation Timing] Are these length checks performed before or after UTF-8 encoding normalization, and could attackers use Unicode normalization attacks to bypass the limits through equivalent but differently-encoded strings? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Protocol Manipulation] Could the 255-character URL limit allow attackers to use exotic URI schemes (file://, javascript:, etc.) that bypass the http/https validation while fitting within the length constraint? (High)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForDescription] [Storage DOS] If proposal descriptions are stored directly in contract state rather than being hashed, could the 10,200-character limit enable attackers to fill contract storage with malicious content that cannot be easily pruned? (High)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constants: All] [Event Log Bloat] When proposals are created and ProposalCreated events are fired with full title and description fields, could maximum-length inputs cause event log bloat affecting indexing services and block explorers? (Low)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForTitle] [Homograph Attack] Could attackers use Unicode homoglyphs within the 255-character title limit to create visually identical but functionally different proposal titles that deceive voters? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForDescription] [Markdown Injection] If descriptions support markdown or rich text formatting, could the 10,200-character limit enable complex injection attacks through nested formatting that bypasses sanitization? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [SSRF Attack] Could the description URL field be exploited to trigger server-side request forgery attacks in systems that automatically fetch and cache proposal metadata from the provided URLs? (High)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constants: All] [Upgrade Path] If these constants need to be changed in the future for legitimate reasons, is there an upgrade mechanism, or would changing them require breaking changes that could invalidate existing proposals? (Low)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForDescription] [Censorship Risk] Could the 10,200-character description be filled with controversial content that causes infrastructure providers to refuse hosting nodes, creating centralization risks? (Low)",
  "[File: contract/AElf.Contracts.Referendum/ReferendumConstants.cs] [Constant: MaxLengthForTitle] [Display Truncation] Could different client implementations truncate the 255-character title at different points, leading to inconsistent proposal display across wallets and potentially hiding malicious intent from some users? (Medium)"
]