[
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalApprovalThreshold=6667] [Off-by-One Error] Does the >= comparison in approval checks (approvedMemberCount * AbstractVoteTotal >= MinimalApprovalThreshold * parliamentMembers.Count) allow proposals to pass with exactly 66.67% approval, and can attackers exploit the boundary between 6666 and 6667 to bypass governance? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MaximalAbstentionThreshold=2000] [Threshold Exceeding] Does the > comparison in abstention checks (abstentionMemberCount * AbstractVoteTotal > MaximalAbstentionThreshold * parliamentMembers.Count) correctly reject proposals with exactly 20.00% abstentions, or can 20.01% abstentions be exploited to DOS governance? (Low)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MaximalRejectionThreshold=2000] [Threshold Exceeding] Does the > comparison in rejection checks (rejectionMemberCount * AbstractVoteTotal > MaximalRejectionThreshold * parliamentMembers.Count) correctly reject proposals with exactly 20.00% rejections, or can 20.01% rejections be exploited to DOS governance? (Low)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Vote Timing Manipulation] Can an attacker monitor pending votes and time their approval/rejection votes to keep proposals perpetually in a 'pending' state by maintaining vote counts just below thresholds until expiration? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalVoteThreshold=7500] [Participation Suppression] Can attackers exploit the 75% participation requirement by preventing 25% of miners from voting (via DOS, network partitioning, or social engineering) to indefinitely block proposal passage? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All] [Multiple Organization Confusion] Can an attacker create custom organizations with different thresholds (via CreateOrganization) while these constants only apply to the default organization, causing confusion about which governance rules apply and enabling bypass attacks? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All] [Default Organization Privilege] Since these constants define the default organization created during initialization, does this organization have special privileges that can be exploited, such as being the only organization that can update the proposer whitelist? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Negative Threshold] If these constants could somehow be set to negative values (e.g., through memory corruption or unsafe operations), would threshold checks using multiplication and comparison pass incorrectly, allowing any proposal to execute? (Low)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: AbstractVoteTotal=10000] [Zero Division] If AbstractVoteTotal were somehow zero, would division operations in percentage calculations throw exceptions and DOS the governance system, or would they silently succeed with incorrect results? (Low)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalApprovalThreshold=6667] [Threshold > AbstractVoteTotal] If MinimalApprovalThreshold were set higher than AbstractVoteTotal (e.g., 15000), would validation logic in Validate(organization) correctly reject the organization, or could such an organization be created and prevent all proposals from ever passing? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Strategic Abstention] Can miners strategically abstain (rather than reject) to avoid triggering the MaximalRejectionThreshold while still preventing proposal passage, and does this create a governance loophole where minority can block actions without appearing as opposition? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalApprovalThreshold=6667, MaximalRejectionThreshold=2000] [Approval-Rejection Gap] With 66.67% approval required but only 20% rejection allowed to block, can 13.33%-20% of miners force a deadlock by rejecting while remaining miners split between approval and abstention? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalVoteThreshold=7500] [Participation Manipulation] Can miners vote on less critical proposals to meet the 75% threshold while deliberately ignoring critical security proposals, allowing them to pass non-contentious proposals while blocking urgent updates? (Low)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Sybil Attack via Miner Manipulation] If an attacker can influence miner elections to control 67% of parliament seats, can they exploit the MinimalApprovalThreshold=6667 to pass any proposal including those that mint tokens, drain treasury, or modify economic parameters? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MaximalRejectionThreshold=2000] [Minority Veto Power] Can 21% of miners who control rejection threshold collude to extort the network by threatening to vote reject on all proposals unless paid, effectively holding governance hostage? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Side-Chain Governance Takeover] If these same threshold constants are used on side chains with fewer miners, can an attacker more easily meet the 66.67% approval threshold on a side chain and pass malicious cross-chain transactions to the main chain? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalApprovalThreshold=6667] [Cross-Chain Threshold Mismatch] If main chain and side chains use different approval thresholds, can an attacker exploit the difference to pass a proposal on the side chain (with lower effective threshold due to fewer miners) that affects main chain governance? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All] [Constant Migration] If these constant values need to be changed in a future version, can existing organizations created with old thresholds coexist with new organizations, and could this create governance fragmentation or bypass opportunities? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All] [Contract Upgrade Attack] During a Parliament contract upgrade, can an attacker exploit the transition period to create organizations with old constant values that have more permissive thresholds, then use these organizations after the upgrade? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalApprovalThreshold=6667] [Miner Set Transition] When the miner set changes (via consensus elections), can an in-flight proposal's approval count become invalid if miners who voted are no longer in the active set, and does the threshold calculation using old votes allow passage with <66.67% of current miners? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Miner Count Volatility] If parliament size fluctuates between voting rounds (miners added/removed), can threshold calculations based on current parliamentMembers.Count cause proposals to incorrectly pass or fail compared to when they were created? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Pre-Expiration Threshold Manipulation] Can miners coordinate to keep a malicious proposal just below approval threshold until honest miners stop monitoring, then quickly vote to exceed MinimalApprovalThreshold=6667 right before expiration and release? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalVoteThreshold=7500] [Participation Threshold Gaming] Can proposal creators set very long expiration times and slowly accumulate votes to reach 75% participation threshold, bypassing the intent that thresholds should be met with active, concurrent miner participation? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: AbstractVoteTotal=10000] [Percentage Base Mismatch] If other parts of the system use different percentage bases (e.g., 100, 1000, or 1000000), can conversion errors when integrating with Parliament governance cause incorrect threshold enforcement? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Constant Shadowing] Can a derived contract or partial class shadow these constant definitions with different values, causing inconsistent threshold enforcement across different execution contexts? (Low)"
]