[
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [Authorization Bypass] Lines 237-239 allow TokenHolder contract to remove beneficiaries. Can a malicious TokenHolder remove legitimate beneficiaries right before DistributeProfits, stealing their profit allocation? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [Cache Corruption] Lines 243-258 modify CachedDelayTotalShares based on removedMinPeriod, but if removedDetails contains entries with Key=0 (line 243 filter), can the cache become desynchronized from actual TotalShares? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [DoS] If a beneficiary has thousands of ProfitDetails across many periods, does RemoveProfitDetails iterate all of them causing gas exhaustion, preventing beneficiary removal? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [State Inconsistency] Line 235 checks if scheme OR currentDetail is null and returns early. If scheme is null but currentDetail exists, does this leave orphaned ProfitDetails in state that can never be removed? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Authorization Bypass] Lines 269-273 allow TokenHolder contract to fix profit details. Can a compromised TokenHolder extend EndPeriod to long.MaxValue for colluding beneficiaries, giving them permanent profit rights? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Period Manipulation] Lines 299-301 allow changing StartPeriod and EndPeriod. Can an attacker set StartPeriod to 0 and EndPeriod to long.MaxValue, claiming profits from all historical periods they weren't entitled to? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Detail Confusion] Lines 278-289 try to find detail by Id, then fallback to Shares matching. Can this cause wrong detail modification if multiple details have same Shares but different Ids, allowing unauthorized profit detail changes? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [State Corruption] Lines 302-304 remove old detail and add new without checking if LastProfitPeriod changed. Can this reset LastProfitPeriod to 0 in the cloned detail, allowing double-claiming of already-claimed periods? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Input Validation] Line 299 checks if input.StartPeriod == 0 to use original, but what if original StartPeriod is 0? Does this create confusion about whether period was intentionally set or defaulted? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Logic Error] Lines 321-324 filter removable details based on CanRemoveBeneficiaryDirectly, but line 351-356 has additional logic for EndPeriod >= CurrentPeriod. Can details be marked IsWeightRemoved but not actually removed, causing share accounting errors? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Duplicate Removal] Lines 334-338 can add the same profitDetail twice to detailsCanBeRemoved if profitDetailId matches and passes both conditions. Does this cause double-subtraction from TotalShares when processed? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [State Inconsistency] Line 345 sets IsWeightRemoved=true but line 346-350 may skip actual removal if LastProfitPeriod >= CurrentPeriod. Can this create zombie details that block future operations but don't free shares? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Accounting Error] Lines 364-372 remove weights for details with EndPeriod==CurrentPeriod separately from main removal. Can this double-count removals, subtracting shares twice from TotalShares? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Period Shortening] Line 355 sets EndPeriod to CurrentPeriod-1 for cancellable schemes. If CurrentPeriod is 0 or 1, does this create negative periods or prevent proper cleanup in subsequent periods? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Collection Modification] Lines 376-383 modify profitDetails.Details collection while potentially being iterated elsewhere. Can concurrent ClaimProfits calls cause collection modification exceptions or inconsistent state? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Authorization Bypass] Lines 426-428 allow TokenHolder contract to distribute profits. Can a compromised TokenHolder distribute profits with manipulated AmountsMap to drain scheme balances to attacker-controlled sub-schemes? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Accounting Error] Lines 437-444 default amount to full balance if AmountsMap value is 0. Can an attacker pass AmountsMap with zero values to distribute all tokens including those not intended for distribution? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Period Mismatch] Line 479-480 asserts input.Period == releasingPeriod. Can an attacker front-run this call with their own DistributeProfits for a future period, skipping proper period sequencing and profit distribution? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Burn Condition] Lines 485-486 burn profits if period<0 OR totalShares<=0. Can an attacker manipulate RemoveBeneficiary to reduce totalShares to 0 right before distribution, causing all profits to be burned instead of distributed? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Delayed Distribution] Lines 464-476 use CachedDelayTotalShares for delayed distribution. Can an attacker manipulate this cache through repeated Add/Remove beneficiary operations to corrupt share calculations during delay periods? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [State Race] Line 494 increments CurrentPeriod after distribution. Can concurrent DistributeProfits calls process the same period twice before CurrentPeriod updates, double-distributing profits? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Token Symbol Validation] Line 420 checks token symbol is not empty, but doesn't verify the token exists. Can distributing non-existent tokens corrupt AmountsMap and cause failures in later operations? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Balance Mismatch] Lines 449-459 auto-distribute all ReceivedTokenSymbols if IsReleaseAllBalanceEveryTimeByDefault. Can this distribute tokens from unrelated contributions that shouldn't be part of this period's distribution? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: BurnProfits()] [Token Loss] Lines 537-538 skip burning if balance < amount. Does this leave partial balances undistributed and unburned, accumulating as locked tokens in the virtual address that can never be recovered? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: BurnProfits()] [Period Increment] Line 520 increments CurrentPeriod even when burning. Can an attacker trigger burn conditions repeatedly to fast-forward CurrentPeriod, skipping proper profit distribution periods? (Medium)"
]