[
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: AddBeneficiary()] [Zero Shares] AssertValidInput at line 221 allows Shares >= 0, meaning zero shares are valid. Can adding beneficiaries with 0 shares pollute the ProfitDetails mapping and increase gas costs for iteration? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: AddBeneficiary()] [Old Detail Cleanup] Lines 204-207 remove details where EndPeriod + ProfitReceivingDuePeriodCount < CurrentPeriod. If CurrentPeriod grows very large, can this cleanup fail to remove all old details, causing unbounded state growth? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: AddBeneficiary()] [EndPeriod MaxValue] When EndPeriod is set to long.MaxValue at line 163, comparisons at line 205 could overflow. Can this cause old details to never be cleaned up, leading to state bloat? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: AddBeneficiary()] [Duplicate ID] Multiple ProfitDetails can be added for the same beneficiary with different IDs. Can an attacker add many details with unique IDs to DoS the ClaimProfits function by exceeding gas limits? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: AddBeneficiary()] [State Update Order] TotalShares is updated at line 182 before ProfitDetails at line 209. If transaction reverts after TotalShares update but before ProfitDetails update, can this cause share accounting mismatch? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [Early Return] Line 235 returns early if scheme or currentDetail is null. Can this be exploited where RemoveBeneficiary succeeds without error but doesn't actually remove shares from TotalShares? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [CachedDelayTotalShares Underflow] Lines 243-258 subtract removedShares from CachedDelayTotalShares. If removedShares > CachedDelayTotalShares[removedPeriod], can this cause underflow and corrupt future distributions? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [Authorization Bypass] Lines 237-239 allow both Manager and TokenHolder contract. Can TokenHolder remove beneficiaries added by Manager without consent, causing unauthorized profit denial? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [TotalShares Accounting] Line 260 subtracts removedDetails.Values.Sum() from TotalShares. If RemoveProfitDetails doesn't return all removed shares correctly, can this cause TotalShares to become inaccurate? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [Incomplete Removal] If DelayDistributePeriodCount is 0, the loop at lines 247-257 doesn't execute. Can this leave CachedDelayTotalShares unupdated when shares are removed, causing distribution errors? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveBeneficiary()] [Period Iteration] The loop at line 247 iterates from removedMinPeriod to removedMinPeriod + DelayDistributePeriodCount. If removedMinPeriod is close to long.MaxValue, can this cause overflow in period calculations? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Period Manipulation] At lines 299-301, StartPeriod and EndPeriod can be modified. Can a manager or TokenHolder contract retroactively extend EndPeriod to give certain beneficiaries access to more profits than originally intended? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Authorization Abuse] Lines 269-273 allow Manager and TokenHolder contract to fix details. Can this be abused to change beneficiary periods after profits are distributed to steal from other beneficiaries? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Detail Selection] Lines 278-289 try to find detail by ID, then fall back to finding by Shares. Can an attacker exploit this fallback logic to modify wrong profit details if multiple details have the same share count? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Share Accounting] The function modifies StartPeriod and EndPeriod but doesn't update TotalShares or CachedDelayTotalShares. Can this cause profit distribution calculations to become inaccurate? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Claimed Profits] If LastProfitPeriod > 0 (already claimed some profits), fixing StartPeriod or EndPeriod could allow double-claiming. Can beneficiaries exploit this to claim the same period's profits multiple times? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: FixProfitDetail()] [Zero Period Override] If input.StartPeriod or input.EndPeriod is 0, the original value is used (lines 299-301). Can attackers intentionally pass 0 to avoid changing certain periods while appearing to",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Weight Removal Flag] Lines 344 and 368 set IsWeightRemoved = true. Can details with this flag still participate in profit distribution if not properly checked elsewhere, leading to incorrect share calculations? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Removable Logic] Lines 321-324 determine removable details based on CanRemoveBeneficiaryDirectly. Can scheme managers manipulate this flag to prevent legitimate removal of expired beneficiaries, causing share accounting errors? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Period Shortening] At line 355, EndPeriod is set to CurrentPeriod - 1 for cancellable schemes. If this happens after profits were already calculated for CurrentPeriod, can beneficiaries lose profits they're entitled to? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Detail Deduplication] Lines 334-338 attempt deduplication but the logic is complex. Can attackers add duplicate profitDetailIds to cause incorrect removal counts, corrupting TotalShares? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Partial Removal] Lines 346-350 only remove details where LastProfitPeriod >= CurrentPeriod. Can this leave zombie details in state that accumulate indefinitely, causing gas exhaustion? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [Dictionary Key 0] Line 372 adds weights with key 0 to removedDetails. Can this conflict with actual period 0 removals, causing incorrect share subtraction? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: RemoveProfitDetails()] [State Cleanup] Lines 376-383 either update or remove ProfitDetailsMap entries. If profitDetails.Details.Count becomes 0 between check and removal, can this cause state inconsistency? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Period Validation] Line 479 asserts input.Period == releasingPeriod (CurrentPeriod). Can this be bypassed if CurrentPeriod is updated concurrently, allowing out-of-order distribution? (High)"
]