[
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Null Reference] Can an attacker query non-existent protocol symbols causing State.NftProtocolMap to return null, leading to null reference exceptions in downstream contract calls that assume non-null NFTProtocolInfo? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Information Disclosure] Can an attacker enumerate all existing NFT protocols by systematically querying different symbol values to map out the entire protocol space and identify high-value targets? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Input Validation] Does the function validate input.Value for null, empty string, or special characters that could cause unexpected behavior in State.NftProtocolMap key lookups? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [DoS] Can an attacker spam queries with extremely long symbol strings to cause excessive gas consumption or storage lookups affecting contract performance? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [State Consistency] If State.NftProtocolMap is corrupted or returns stale data, can this lead to incorrect protocol information being returned and used in authorization decisions elsewhere? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Case Sensitivity] Does the symbol lookup handle case sensitivity correctly - can an attacker query 'SYMBOL' vs 'symbol' to bypass protocol restrictions or access control checks? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Whitespace Handling] Can an attacker use symbols with leading/trailing whitespace to query different protocol entries than intended, potentially bypassing validation in other functions? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Unicode Exploits] Can an attacker use Unicode normalization attacks with visually similar characters in symbols to access or impersonate existing protocols? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [Hash Collision] Can an attacker craft different (Symbol, TokenId) pairs that produce the same tokenHash via CalculateTokenHash, allowing them to query information for NFTs they don't own? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [Integer Overflow] Can TokenId values near Int64.MaxValue cause overflow in CalculateTokenHash string concatenation, resulting in hash collisions with other valid NFTs? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [Negative TokenId] Does the function validate that TokenId is non-negative - can negative values bypass intended access controls or cause unexpected hash calculations? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [Null Input] What happens if input.Symbol is null or empty when passed to CalculateTokenHash - does it cause contract failure or return incorrect NFT information? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [State Consistency] If GetNFTInfoByTokenHash retrieves stale or inconsistent NFT data, can this lead to authorization bypasses in transfer or burn operations that rely on this view? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [Information Leakage] Can an attacker query NFT info for tokens they don't own to gather sensitive metadata like creator addresses, base URIs, or ownership history? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [TokenId Zero] Does the function correctly handle TokenId = 0 - is this a valid token or does it cause special behavior that could be exploited? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [Symbol Validation] Can an attacker use invalid or malformed symbols that pass through CalculateTokenHash but cause issues in State.NftInfoMap lookups? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Null NFTInfo] When State.NftInfoMap[input] returns null at line 22, the function returns new NFTInfo() - can this empty object be misused by callers expecting valid data? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Missing Protocol] If nftInfo.Symbol exists but State.NftProtocolMap[nftInfo.Symbol] returns null at line 24, does this cause null reference when accessing nftProtocolInfo properties? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [State Modification] Even though this is a view function, lines 25-28 modify nftInfo object properties - can this cause reentrancy or state inconsistency issues? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Data Override] The function overwrites ProtocolName, Creator, BaseUri, and NftType from protocol info - can this hide malicious modifications to the original NFT metadata? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Hash Validity] Does the function validate that input hash is valid and non-empty before querying State.NftInfoMap? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Empty NFTInfo Return] Returning new NFTInfo() for non-existent tokens could mislead callers into thinking the token exists with default values - can this enable fake token attacks? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Protocol Mismatch] What if nftInfo.Symbol doesn't match any entry in NftProtocolMap - does the returned NFTInfo have incomplete/corrupted protocol data? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Information Aggregation] By combining NFTInfo and NFTProtocolInfo, does this expose more data than intended to unauthorized viewers? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetBalance()] [Uninitialized Balance] If State.BalanceMap[tokenHash][input.Owner] has never been set, what value is returned - zero or null causing potential null reference? (Medium)"
]