[
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetManagingSchemeIds()] [Information Disclosure] Can an attacker query arbitrary manager addresses to enumerate all profit schemes in the system, potentially discovering private scheme structures and beneficiary relationships that should remain confidential? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetManagingSchemeIds()] [Missing Validation] Does the function allow null or zero-address input for Manager, potentially returning invalid or default state data that could be misinterpreted by calling contracts? (Low)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetManagingSchemeIds()] [State Inconsistency] If State.ManagingSchemeIds[input.Manager] returns null, does the function return null or an empty CreatedSchemeIds object, and could this inconsistency cause calling contracts to crash or mishandle the response? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetManagingSchemeIds()] [DoS] Can an attacker query a manager with thousands of scheme IDs, causing excessive gas consumption and potentially timing out the query or blocking other operations? (Low)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetScheme()] [Missing Validation] Does the function validate that the input Hash is non-null and non-empty before querying state, or can it return null/default Scheme objects for invalid inputs? (Low)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetScheme()] [Information Disclosure] Can an attacker enumerate all scheme hashes through brute force or dictionary attacks to discover all profit schemes, including their managers, total shares, and sub-scheme relationships? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetScheme()] [State Inconsistency] If a scheme is deleted but State.SchemeInfos[input] is not properly cleared, can stale scheme data be returned, leading to incorrect profit calculations in dependent contracts? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetScheme()] [Privacy Leak] Does returning the complete Scheme object expose sensitive fields like VirtualAddress, Manager, or SubSchemes that could be exploited to manipulate or front-run profit distributions? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Hash Collision] In the ternary operator at line 32-34, if input.Period == 0 returns the general ledger address, but what if Period is negative or overflows, potentially returning an unintended virtual address? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Virtual Address Manipulation] Can an attacker craft a SchemeId and Period combination that produces a hash collision with another scheme's virtual address through GetDistributedPeriodProfitsVirtualAddress, enabling them to query or manipulate unrelated profit pools? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Missing Validation] Does the function validate that input.SchemeId is a valid, existing scheme before calling Context.ConvertVirtualAddressToContractAddress, or can it return addresses for non-existent schemes? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Period Overflow] If input.Period is set to long.MaxValue or other boundary values, could this cause issues in GetDistributedPeriodProfitsVirtualAddress or downstream address calculations? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Predictable Addressing] Since the virtual address generation is deterministic based on SchemeId and Period, can an attacker precompute addresses and send tokens directly to future period addresses before they're officially released, potentially locking funds or manipulating distributions? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [Default Value Manipulation] At line 40-43, when DistributedProfitsMap returns null, the function returns a DistributedProfitsInfo with TotalShares = -1. Can calling contracts misinterpret -1 as a valid shares count, leading to incorrect profit calculations? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [Missing Validation] Does the function validate that input.Period is within valid bounds (>= 0 and <= scheme.CurrentPeriod) before querying, or can it return data for invalid future or negative periods? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [State Inconsistency] If GetDistributedPeriodProfitsVirtualAddress returns an address but State.DistributedProfitsMap has null at that address, is this a valid state or does it indicate a corruption that should trigger an assertion? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [Information Leak] Can an attacker query future periods (input.Period > scheme.CurrentPeriod) to see if profits have already been pre-allocated, potentially front-running distribution transactions? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [Sentinel Value] The use of TotalShares = -1 as a sentinel for non-existent data at line 42 could be exploited if any arithmetic operations don't check for this value, causing underflows or negative share calculations. Can this propagate to ClaimProfits logic? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetProfitDetails()] [Missing Validation] Does the function validate that input.SchemeId exists and input.Beneficiary is non-null before accessing State.ProfitDetailsMap, or can it return null causing NullReferenceException in callers? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetProfitDetails()] [Privacy Violation] Can any address query the profit details of any beneficiary in any scheme, exposing sensitive financial information about users' share allocations and profit history? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetProfitDetails()] [State Inconsistency] If a beneficiary is removed but their ProfitDetails are not cleared from state, can stale data be returned that contradicts the actual scheme state, leading to incorrect UI displays or integration bugs? (Low)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedPeriodProfitsVirtualAddress()] [Hash Collision] Does the function at line 53-54 ensure unique virtual addresses for all SchemeId+Period combinations, or can specially crafted inputs produce collisions enabling cross-scheme profit theft? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedPeriodProfitsVirtualAddress()] [Missing Validation] If schemeId is null or period is negative, can this produce invalid virtual addresses that could be exploited? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GeneratePeriodVirtualAddressFromHash()] [Hash Weakness] At line 59, using HashHelper.XorAndCompute with XOR operation - can an attacker find schemeId and period pairs that XOR to the same result as another scheme's hash, creating virtual address collisions? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GeneratePeriodVirtualAddressFromHash()] [Collision Attack] If HashHelper.ComputeFrom(period) is predictable and only depends on period value, can an attacker precompute a rainbow table of all period hashes to reverse-engineer scheme IDs from virtual addresses? (High)"
]