[
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetSymbolsToPayTXSizeFeeController()] [Controller Replacement] Can an attacker exploit the fallback to default controller to bypass proper initialization and use a controller with elevated privileges? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetSymbolsToPayTXSizeFeeController()] [Authority Confusion] Can the default controller have different authority requirements than the initialized controller, causing authorization bypasses when state is uninitialized? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetCrossChainTokenContractRegistrationController()] [Recursive Call] The function calls GetCrossChainTokenContractRegistrationController() recursively when state is null - is this the same function or a different internal function? Can this cause infinite recursion or unexpected behavior? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetCrossChainTokenContractRegistrationController()] [Cross-Chain Security] Can an attacker exploit uninitialized State.CrossChainTokenContractRegistrationController.Value to register malicious token contracts on cross-chain transfers? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetCrossChainTokenContractRegistrationController()] [Controller Authority] Is there proper validation that the returned controller can only register legitimate cross-chain token contracts, or can any address use this controller? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: IsTokenAvailableForMethodFee()] [Fee Token Validation] Can an attacker create a non-burnable token and attempt to use it for method fees? Does this function correctly prevent non-burnable tokens from being accepted? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: IsTokenAvailableForMethodFee()] [Input Validation] Is there validation that input.Value is not null or empty? Can providing invalid symbol strings cause unexpected behavior or expose uninitialized token info? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: IsTokenAvailableForMethodFee() private] [Exception Handling] The function throws AssertionException if token is not found - can an attacker cause DOS by requesting fee payment in non-existent tokens, causing all fee calculations to fail? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: IsTokenAvailableForMethodFee() private] [Burnable Check] The function only checks tokenInfo.IsBurnable - are there other token properties that should be validated for method fee eligibility (e.g., not locked, sufficient supply, owner permissions)? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: IsTokenAvailableForMethodFee() private] [Token Info Null] If GetTokenInfo(symbol) returns null, the AssertionException is thrown - can this be exploited to cause transaction failures when querying fee availability? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetReservedExternalInfoKeyList()] [External Info Keys] Can an attacker use knowledge of these reserved keys (LockCallbackExternalInfoKey, LogEventExternalInfoKey, TransferCallbackExternalInfoKey, UnlockCallbackExternalInfoKey) to inject malicious external info that triggers callbacks or events? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetReservedExternalInfoKeyList()] [Key Collision] Can an attacker create token external info with keys that collide with these reserved keys, potentially hijacking callback mechanisms or event logging? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetReservedExternalInfoKeyList()] [Hardcoded Keys] Are these hardcoded string keys validated consistently across all functions that use external info? Can inconsistent key handling lead to callback bypass or unauthorized operations? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: IsAddressInCreateWhiteList()] [Whitelist Check] Can an attacker become whitelisted by registering as one of the system contracts (ZeroSmartContract, Parliament Controller, Economic Contract, or CrossChain Contract)? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: IsAddressInCreateWhiteList()] [Contract Name Spoofing] Can an attacker deploy a contract with a spoofed name matching SmartContractConstants.EconomicContractSystemName or CrossChainContractSystemName to pass the whitelist check? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: IsAddressInCreateWhiteList()] [Parliament Controller] GetDefaultParliamentController().OwnerAddress is checked - can an attacker manipulate this owner address through governance to gain whitelist access? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: IsAddressInCreateWhiteList()] [System Contract Validation] Are the system contract addresses validated to prevent address reuse or spoofing? Can an attacker claim one of these addresses before the system contracts are deployed? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetTokenAlias()] [NFT Collection] The function calls GetNftCollectionSymbol(input.Value, true) - can an attacker provide a non-NFT symbol that gets incorrectly processed as an NFT collection, returning wrong alias information? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetTokenAlias()] [Alias Extraction] The function calls ExtractAliasSetting(tokenInfo) - if tokenInfo is null or malformed, can this cause null reference exceptions or return attacker-controlled alias strings? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetTokenAlias()] [Symbol Manipulation] Can an attacker provide a symbol with special characters or separators that cause GetNftCollectionSymbol to return a different collection than intended, exposing wrong alias data? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetSymbolByAlias()] [Alias Resolution] Can an attacker register an alias that collides with an existing symbol, causing GetActualTokenSymbol to return an unexpected symbol and enabling token confusion attacks? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetSymbolByAlias()] [Circular References] Can an alias be set to point to another alias, creating circular references that cause infinite loops or unexpected symbol resolution? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetActualTokenSymbol()] [Alias Priority] The function checks State.TokenInfos[aliasOrSymbol] first - can an attacker register both a token with symbol 'X' and an alias 'X' pointing to token 'Y', causing confusion about which token is actually referenced? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetActualTokenSymbol()] [Null Handling] If State.SymbolAliasMap[aliasOrSymbol] returns null, the function falls back to aliasOrSymbol - can this allow invalid symbols to pass through without validation? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetActualTokenSymbol()] [Map Corruption] Can State.SymbolAliasMap be corrupted to map legitimate aliases to attacker-controlled symbols, enabling token substitution attacks across all operations using this function? (Critical)"
]