[
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Missing Validation] Can an attacker query non-existent protocol symbols causing null return values that crash downstream integrations expecting valid NFTProtocolInfo objects, enabling denial of service against dependent contracts? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Information Disclosure] Does direct state map access without access control allow unauthorized parties to enumerate all NFT protocol configurations including creator addresses, base URIs, and protocol metadata that should remain private? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Input Validation] Can malicious input.Value strings containing special characters, extremely long strings, or null values cause state map lookup failures or unexpected behavior in the State.NftProtocolMap access? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [State Consistency] If State.NftProtocolMap[input.Value] returns null for deleted/burned protocols, does the function properly handle this case or return misleading empty objects to callers? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTProtocolInfo()] [Race Condition] Can concurrent queries during protocol updates return stale or inconsistent NFTProtocolInfo data when protocol metadata is being modified by admin transactions? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [Hash Collision] Can two different symbol+tokenId combinations produce the same tokenHash via CalculateTokenHash, causing GetNFTInfo to return incorrect NFT information for the wrong token? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [Missing Validation] Does the function validate that input.Symbol is non-empty and input.TokenId is positive before calculating tokenHash, or can invalid inputs produce misleading hash values? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [Information Disclosure] Can attackers enumerate all existing NFTs by iterating through tokenId values for known symbols, exposing sensitive NFT ownership and metadata without proper authorization? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [State Inconsistency] If the calculated tokenHash doesn't exist in State.NftInfoMap, does GetNFTInfoByTokenHash handle this gracefully or return confusing partial data? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfo()] [DoS via Gas] Can an attacker cause excessive gas consumption by querying NFTs with extremely long symbol strings, causing the CalculateTokenHash to consume excessive resources? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Null Reference] When State.NftInfoMap[input] returns null on line 22, the function returns empty NFTInfo but on line 24 accesses State.NftProtocolMap[nftInfo.Symbol] - can this cause null reference if nftInfo is instantiated empty? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [State Inconsistency] If nftInfo exists but nftInfo.Symbol maps to a non-existent protocol in State.NftProtocolMap (line 24), does nftProtocolInfo become null causing crashes on lines 25-28? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Data Integrity] Can the function return inconsistent NFTInfo where nftInfo.ProtocolName, Creator, BaseUri, and NftType are overwritten with potentially null/stale values from nftProtocolInfo if the protocol was modified after NFT creation? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Missing Validation] Does the function validate that the input Hash is properly formatted and not a zero/empty hash before attempting state map lookup? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Information Disclosure] Can attackers enumerate all NFT token hashes by brute-forcing hash values to discover NFTs that should remain private or unannounced? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Logic Error] The function modifies the returned nftInfo object by adding protocol-level fields (lines 25-28) - does this mutate the state object or create a copy, potentially corrupting state? (Critical)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetNFTInfoByTokenHash()] [Incomplete Data] If nftProtocolInfo is null, lines 25-28 assign null values to nftInfo fields - should the function return the original nftInfo without modification or throw an error? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetBalance()] [Missing Validation] Does the function validate that input.Owner address is valid and non-zero before querying State.BalanceMap, or can zero addresses return misleading zero balances? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetBalance()] [Hash Collision] Can symbol+tokenId combinations with hash collisions cause GetBalance to return incorrect balance for a different NFT than intended? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetBalance()] [State Access] If State.BalanceMap[tokenHash][input.Owner] returns null/undefined for non-existent entries, is the balance defaulted to 0 or does it cause errors? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetBalance()] [DoS via Enumeration] Can attackers cause resource exhaustion by rapidly querying balances for many owner addresses across many NFTs? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetBalance()] [Information Disclosure] Does the function allow anyone to query any user's NFT balance without access control, violating privacy for users wanting anonymous holdings? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetBalance()] [Input Validation] Can empty or null input.Symbol cause CalculateTokenHash to produce invalid hashes leading to incorrect balance queries? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetBalance()] [Race Condition] Can concurrent balance queries during transfer/mint/burn operations return stale balance values that don't reflect pending state changes? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_View.cs] [Function: GetBalanceByTokenHash()] [Missing Validation] Does the function validate that input.TokenHash is a valid hash and input.Owner is a valid address, or can malformed inputs query arbitrary state locations? (Medium)"
]