[
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [AmountOutOfTokenConvert: Triple Subtraction Risk] At line 73, the formula is TotalSupply - balance - AmountToTokenConvert—can specific value combinations cause integer underflow even if individual values are valid? (Medium)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [AmountOutOfTokenConvert: Zero Total Supply] If tokenInfo.TotalSupply=0 (token not yet minted), does line 73 always yield negative amountOutOfTokenConvert, causing needDeposit to remain 0 and allowing free connector enablement? (High)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [Error Messages: GetNeededDeposit] At line 59 and 61, assertions have prefixed messages '[GetNeededDeposit]Can't find...'—are these messages helpful for debugging, or do they leak internal state information to attackers probing for vulnerabilities? (Low)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [Error Messages: GetDepositConnectorBalance] At line 96, assertion message 'token symbol is invalid' is generic—does this prevent legitimate users from understanding why their query failed (null connector vs wrong IsDepositAccount flag)? (Low)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [Related Symbol: Chain Length] Do view functions limit the depth of RelatedSymbol lookups? If connector A->B->C->D forms a chain, can GetPairConnector or GetNeededDeposit enter infinite loops or excessive gas consumption? (Medium)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [Related Symbol: Self-Reference] If connector.RelatedSymbol points to itself (self-loop), does GetPairConnector at line 42 return the same connector for both ResourceConnector and DepositConnector, breaking pair assumptions? (High)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [Related Symbol: Orphaned Connectors] If connector exists but RelatedSymbol is deleted/unset, does GetNeededDeposit line 60 or GetDepositConnectorBalance line 97 fail to find fromConnector/ntSymbol, causing assertion failures that DOS legitimate queries? (Medium)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [IsPurchaseEnabled: Asymmetric Enable] If deposit connector has IsPurchaseEnabled=true but resource connector has IsPurchaseEnabled=false, does IsSymbolAbleToSell return true while Buy/Sell operations fail, creating misleading UX? (Medium)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [IsPurchaseEnabled: Disable After Query] Can IsPurchaseEnabled be toggled by governance between IsSymbolAbleToSell query and actual Sell transaction, causing TOCTOU race condition where user assumes selling is enabled but transaction fails? (Low)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [DepositInfo: Negative NeedAmount] If Bancor calculation in GetNeededDeposit returns negative needDeposit (due to formula edge cases), does line 86-90 set NeedAmount to negative value, and does EnableConnector handle this correctly? (High)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [DepositInfo: NeedAmount Zero Validity] If NeedAmount=0 at line 88, is this always valid, or should it indicate error state (e.g., connector already enabled, or total supply is zero)? Does EnableConnector validate this? (Medium)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [DepositInfo: AmountOutOfTokenConvert Reporting] Does returning AmountOutOfTokenConvert at line 89 leak information about token distribution that could be exploited by attackers to time enablement or frontrun liquidity provision? (Low)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [Default Controller: Parliament Dependency] Does GetDefaultConnectorController (called from GetControllerForManageConnector line 20) depend on Parliament contract being correctly initialized? If Parliament is uninitialized, does it return zero address causing all connector management to fail? (High)",
  "[File: contract/AElf.Contracts.TokenConverter/TokenConvert_Views.cs] [Default Controller: Upgrade Risk] If Parliament contract is upgraded and default organization address changes, does GetControllerForManageConnector return stale controller info until ConnectorController is explicitly reset? (Medium)"
]