[
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [Share Removal] Lines 787-797 remove shares from TotalShares and CachedDelayTotalShares after claiming. Can this cause negative TotalShares if shares were already removed in RemoveBeneficiary but details weren't cleared? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [Period Calculation] Line 774 calls GetMaximumPeriodCountForProfitableDetail which divides MaxPeriodCount by profitableDetailCount. Can profitableDetailCount=0 cause division by zero or return invalid period count? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [State Modification] Lines 801-806 rebuild ProfitDetails removing claimed entries. Can concurrent ClaimProfits calls for same beneficiary cause race conditions where some details are processed twice or lost? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [LastProfitPeriod Init] Lines 780-782 set LastProfitPeriod=StartPeriod if it was 0. If StartPeriod > CurrentPeriod due to DelayDistributePeriodCount, does this skip the first actual profitable period? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [Period Loop] Lines 860-912 loop from LastProfitPeriod to maxProfitPeriod. If maxProfitPeriod - LastProfitPeriod is extremely large (e.g., long.MaxValue), can this cause out-of-gas failures? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [Max Period Calculation] Lines 857-859 calculate maxProfitPeriod with complex Min logic. Can EndPeriod=long.MaxValue and large maxProfitReceivingPeriodCount cause overflow when adding LastProfitPeriod + maxProfitReceivingPeriodCount? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [Profit Calculation] Line 873-874 uses SafeCalculateProfits which may round down. Can rounding always favor the house, causing users to permanently lose small profit amounts across many periods? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [IsReleased Check] Line 881 checks IsReleased before transferring. Can DistributedProfitsInfo exist with profits but IsReleased=false, preventing legitimate claims even after distribution? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [Virtual Transfer] Lines 887-895 use SendVirtualInline for profit transfer. Can a reentrant call during this transfer manipulate profitDetail.LastProfitPeriod before line 917 updates it, causing double-claims? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [LastProfitPeriod Update] Line 908 sets lastProfitPeriod = period + 1 inside non-view mode. If transfer at line 887-895 fails but doesn't revert, does lastProfitPeriod still increment, skipping that period's profits? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [Symbol List] Line 851 creates symbol list from targetSymbol or ReceivedTokenSymbols. Can ReceivedTokenSymbols contain removed/invalid symbols causing unnecessary iterations and gas waste? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: SafeCalculateProfits()] [Precision Loss] Lines 958-961 use decimal arithmetic then cast to long. Can this cause systematic rounding errors where sum of individual allocations is less than totalAmount, losing tokens in virtual addresses? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: SafeCalculateProfits()] [Division by Zero] If totalShares is 0, line 961 performs division by zero. Although callers should prevent this, can any edge case reach this function with totalShares=0, causing contract failure? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: SafeCalculateProfits()] [Parameter Confusion] Function signature shows (totalAmount, shares, totalShares) but usage might confuse parameter order. Can incorrect parameter passing cause massive over-allocation or zero allocation? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: SafeCalculateProfits()] [Negative Results] If shares > totalShares due to corruption, can the calculation produce negative results that get cast to huge positive longs? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: GenerateSchemeId()] [Collision Risk] Line 968 uses createSchemeInput.Token for ID generation if provided. Can multiple schemes use the same token value to create ID collisions, bypassing the uniqueness check in CreateScheme? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: GenerateSchemeId()] [Predictable IDs] Lines 969-970 use scheme count for ID generation. Can an attacker predict future scheme IDs and pre-create malicious state at those addresses? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: GenerateSchemeId()] [Manager Confusion] Line 966 determines manager from input or sender. If input.Manager is set, can the sender create schemes for other managers, then manipulate the manager's scheme list? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: GetNewScheme()] [VirtualAddress] Line 944 converts schemeId to virtual address. Is this address deterministic and collision-free? Can attackers pre-fund this address before scheme creation to manipulate initial state? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: GetNewScheme()] [Default Period] Line 947 sets CurrentPeriod to 1. Can this cause off-by-one errors in period calculations where period 0 is expected but never exists? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: GetNewScheme()] [Delay Count] Line 949 sets DelayDistributePeriodCount from input without validation. Can extremely large values cause integer overflows when added to CurrentPeriod in AddBeneficiary line 188? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Cross-Function: CreateScheme + AddBeneficiary] [Race Condition] Can an attacker front-run scheme creation to add themselves as beneficiary before the legitimate creator, gaining unauthorized profit shares from period 1? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Cross-Function: DistributeProfits + ClaimProfits] [Reentrancy] During SendVirtualInline in DistributeProfits, can a malicious token contract reenter ClaimProfits to claim profits before distribution completes, double-spending distributed amounts? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Cross-Function: AddSubScheme + RemoveSubScheme] [State Corruption] Can rapidly adding and removing the same sub-scheme cause SubSchemes list and ProfitDetailsMap to become desynchronized, leading to profit calculation errors? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Cross-Function: AddBeneficiary + RemoveBeneficiary] [Share Accounting] If AddBeneficiary and RemoveBeneficiary are called in quick succession with overlapping ProfitDetails, can shares be double-counted or lost in TotalShares accounting? (High)"
]