[
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetTokenInfo()] [Input Validation] Can an attacker provide a null or empty Symbol in GetTokenInfoInput to cause unexpected behavior or access non-existent token data, potentially exposing uninitialized state or causing a revert that blocks legitimate queries? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetTokenInfo()] [Information Disclosure] Can an attacker enumerate all token symbols by systematically querying GetTokenInfo with various symbol strings to map the entire token registry, potentially exposing private or restricted token information? (Low)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetTokenInfo()] [Symbol Manipulation] Can an attacker provide a malformed or excessively long symbol string to trigger buffer overflow, excessive gas consumption, or state corruption in the underlying GetTokenInfo(string) implementation? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetNativeTokenInfo()] [State Dependency] If State.NativeTokenSymbol.Value is null or uninitialized, can this function return incorrect native token information or expose the contract to denial-of-service by reverting on every native token query? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetNativeTokenInfo()] [Governance Attack] Can a malicious governance action change State.NativeTokenSymbol.Value to point to a fake or malicious token, causing all native token queries to return incorrect information and potentially disrupting fee payment logic? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetResourceTokenInfo()] [DOS Attack] Can an attacker manipulate TokenContractConstants.PayTxFeeSymbolListName or PayRentalSymbolListName to contain an excessive number of symbols, causing this function to consume excessive gas and fail, blocking legitimate resource token queries? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetResourceTokenInfo()] [Data Integrity] Can duplicate symbols exist in both PayTxFeeSymbolListName and PayRentalSymbolListName arrays, causing tokenInfoList.Value to contain duplicate entries and potentially breaking downstream logic that assumes unique entries? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetResourceTokenInfo()] [Inconsistent State] If GetTokenInfo(symbol) returns null for some symbols in the arrays but not others, can this create an inconsistent resource token list that violates invariants about which tokens are available for fee payment? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetResourceTokenInfo()] [Array Manipulation] Can an unauthorized actor modify Context.Variables string arrays to inject malicious symbols into PayTxFeeSymbolListName or PayRentalSymbolListName, causing this function to return attacker-controlled token information? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetBalance()] [Symbol Aliasing] Can an attacker exploit GetActualTokenSymbol() to query balances using an alias that maps to a different token than expected, potentially accessing balances that should be restricted or hidden? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetBalance()] [Owner Validation] Is there any validation that input.Owner is a valid address? Can an attacker provide a zero address, contract address, or malformed address to extract unexpected balance information or cause state corruption? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetBalance()] [Information Leak] Can an attacker use GetBalance to query balances of locked, vesting, or restricted accounts (like virtual addresses) that should not be directly accessible, potentially exposing sensitive financial information? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetBalance()] [Symbol Mismatch] The function returns input.Symbol in the output but uses GetActualTokenSymbol internally - can this mismatch between requested symbol and actual symbol queried cause confusion in client applications or enable symbol spoofing attacks? (Low)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAllowance()] [Allowance Query] Can an attacker query allowances between arbitrary owner-spender pairs to map all approval relationships in the system, potentially identifying high-value targets for approval-based attacks? (Low)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAllowance()] [Symbol Resolution] Can an attacker provide an alias that resolves to a different token via GetActualTokenSymbol(), causing the function to return allowance for token A while the caller expects token B, leading to incorrect allowance assumptions? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAllowance()] [NFT Allowance] For NFT tokens with item IDs, does this function correctly handle the full symbol (collection-itemId)? Can an attacker query collection-level allowances when they should only see item-level allowances? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAllowance()] [State Access] The function directly accesses State.Allowances[input.Owner][input.Spender][symbol] - can uninitialized state return zero allowance when it should return an error, potentially hiding allowance state corruption? (Low)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAvailableAllowance()] [Allowance Calculation] Can an attacker exploit the Math.Max logic between specific allowance, all-symbol allowance, and NFT collection allowance to gain higher effective allowance than intended, enabling unauthorized transfers? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAvailableAllowance()] [Symbol Type Confusion] Can an attacker provide a symbol that CheckSymbolIdentifier validates differently than GetSymbolType, causing inconsistent allowance calculations between NFT and fungible token paths? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAvailableAllowance()] [All-Symbol Bypass] Can an attacker set an all-symbol allowance (*) that bypasses per-token allowance limits, allowing them to transfer any token with a single approval and violating per-token spending controls? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAvailableAllowance()] [NFT Collection Allowance] For NFT collections, can an attacker exploit GetNftCollectionAllSymbolAllowance to gain collection-wide allowance that enables transferring individual NFTs without item-specific approval? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAvailableAllowance()] [Allowance Aggregation] The function uses Math.Max to aggregate allowances - can this cause allowance inflation where the effective allowance exceeds any individual approval, violating least-privilege principles? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAvailableAllowance()] [Out Parameter] GetAllSymbolAllowance and GetNftCollectionAllSymbolAllowance use 'out _' parameters that are discarded - does this hide important validation or state information that should affect allowance calculation? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: GetAvailableAllowance()] [Return Value Confusion] The function returns input.Symbol but may query different symbols internally - can this mismatch cause client applications to incorrectly apply the allowance to the wrong token? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Views.cs] [Function: CheckSymbolIdentifier()] [Symbol Parsing] Can an attacker provide a symbol with multiple NFTSymbolSeparators to cause incorrect parsing, potentially matching the all-symbol identifier in unexpected positions and bypassing symbol-specific logic? (High)"
]