[
  "[File: contract/AElf.Contracts.Genesis/BasicContractZero_Constants.cs] [Constant: MinimalApprovalThreshold] [Vote Buying] With approval threshold at 66.67%, can an attacker calculate exact cost to buy sufficient votes (66.67% of tokens) and profitably execute malicious proposals if the stolen value exceeds vote acquisition cost, making the threshold insufficient for high-value governance decisions? (High)",
  "[File: contract/AElf.Contracts.Genesis/BasicContractZero_Constants.cs] [Constant: MinimalVoteThresholdThreshold] [Participation DOS] To prevent proposals from meeting the 80% participation requirement, can attackers grief by preventing 21% of eligible voters from accessing the voting interface, causing legitimate proposals to fail MinimalVoteThresholdThreshold check indefinitely? (Medium)",
  "[File: contract/AElf.Contracts.Genesis/BasicContractZero_Constants.cs] [Constants: MaximalAbstentionThreshold + MaximalRejectionThreshold] [Strategic Voting] Can voters coordinate to maximize abstentions and rejections at exactly 10% each (consuming full thresholds) while ensuring remaining votes provide minimum 66.67% approval, creating proposals that pass all thresholds with no safety margin for error? (Medium)",
  "[File: contract/AElf.Contracts.Genesis/BasicContractZero_Constants.cs] [Constant: ContractProposalExpirationTimePeriod] [Liquidity Attack] During the 259200-second voting period, can attackers manipulate token liquidity to temporarily acquire voting power, vote for malicious proposals, then sell tokens before proposal execution, avoiding economic consequences while corrupting governance? (High)",
  "[File: contract/AElf.Contracts.Genesis/BasicContractZero_Constants.cs] [Constants: All] [Multi-Contract References] If Parliament, Referendum, and Association contracts each independently reference these BasicContractZero constants but implement threshold validation differently, can inconsistent validation logic create governance paths where proposals pass in one organization type but fail in another despite same threshold values? (High)",
  "[File: contract/AElf.Contracts.Genesis/BasicContractZero_Constants.cs] [Constants: Expiration Periods] [Cross-Contract Timing] If a code check proposal (900 sec) triggers actions in contracts that reference ContractProposalExpirationTimePeriod (259200 sec), can timing mismatches cause race conditions where code deploys before related contract proposals expire, enabling partially-deployed attack vectors? (High)",
  "[File: contract/AElf.Contracts.Genesis/BasicContractZero_Constants.cs] [Constants: All Thresholds] [Inheritance Risk] If other contracts inherit from BasicContractZero and override threshold validation logic without respecting these constants, can derived contracts implement weaker thresholds (e.g., 50% approval instead of 66.67%) while claiming BasicContractZero compatibility? (Medium)",
  "[File: contract/AElf.Contracts.Genesis/BasicContractZero_Constants.cs] [Constants: All] [Const Inline] Since const values are inlined at compile-time, if consuming contracts compiled against different versions of BasicContractZero use different constant values (e.g., old code used MinimalApprovalThreshold=5000), can heterogeneous threshold enforcement cause governance inconsistencies? (High)",
  "[File: contract/AElf.Contracts.Genesis/BasicContractZero_Constants.cs] [Constants: Expiration Periods] [Time Source Dependency] If consuming code uses different time sources (block.timestamp vs. DateTime.Now) when applying expiration periods, can proposals experience timing discrepancies between when they should expire (timestamp + 259200) and when they actually expire? (Medium)"
]