[
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Negative Period] Line 485 allows input.Period < 0 to trigger burning. Can this be abused by malicious managers to destroy legitimate profits meant for beneficiaries? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [TotalShares Zero] Lines 485-486 return early and burn profits if totalShares <= 0. Can attackers force TotalShares to 0 through RemoveBeneficiary to cause profit loss? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [CachedDelayTotalShares] Lines 464-476 manipulate CachedDelayTotalShares. If period + DelayDistributePeriodCount overflows, can this cause incorrect cache entries and wrong totalShares calculations? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Empty AmountsMap] If input.AmountsMap is empty and IsReleaseAllBalanceEveryTimeByDefault is false, lines 448-460 result in empty profitsMap. Can this cause silent no-op distributions without error? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Balance Query] Lines 437-443 query token balance with amount.Value == 0. Can this consume excessive gas if called repeatedly with many tokens, enabling DoS? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Authorization] Lines 426-428 allow Manager or TokenHolder contract. Can TokenHolder trigger distribution at incorrect periods, disrupting expected profit schedules? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Virtual Address] Line 483 computes profitsReceivingVirtualAddress from schemeId and period. Can hash collisions cause different periods to share the same virtual address, mixing profits? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [State Update] CurrentPeriod is incremented at line 494 after distribution. If distribution fails but CurrentPeriod is already updated, can this cause period skipping? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfits()] [Symbol Validation] Line 420 asserts symbols are not empty, but doesn't verify tokens exist. Can distributing non-existent tokens cause state corruption or profit loss? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: BurnProfits()] [Insufficient Balance] Lines 537-538 check if balance < amount and continue on insufficient funds. Can this cause partial burns where some tokens are burned but not others, leading to inconsistent state? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: BurnProfits()] [Negative Amounts] Line 551 stores -amount in distributedProfitsInfo.AmountsMap. Can this negative value cause issues in subsequent calculations expecting positive amounts? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: BurnProfits()] [Transfer Before Burn] Lines 539-545 transfer to Context.Self before burning at lines 546-550. Can a reentrancy attack during transfer drain funds before burn executes? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: BurnProfits()] [Period Increment] Line 520 increments CurrentPeriod even when burning. Can this cause period numbers to advance without corresponding profit distribution, confusing beneficiaries? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: BurnProfits()] [Virtual Address Inline] Line 539 uses SendVirtualInline with scheme.SchemeId. Can this fail silently if virtual address operations fail, leaving tokens untransferred? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: PerformDistributeProfits()] [Remain Amount] Line 592 calculates remainAmount from DistributeProfitsForSubSchemes. If this calculation has rounding errors, can remain amount be larger than totalAmount, causing transfer failures? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: PerformDistributeProfits()] [Zero Transfers] Line 595 checks if remainAmount != 0 before transfer. Can remainAmount be 0 for all tokens, leaving all profits locked in sub-schemes without reaching individual beneficiaries? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: PerformDistributeProfits()] [Virtual Transfer Failure] Lines 596-602 use SendVirtualInline. If this fails, is there error handling, or can profits be silently lost? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfitsForSubSchemes()] [Precision Loss] Line 621 uses SafeCalculateProfits which converts to decimal. Can repeated precision loss across multiple sub-schemes cause sum(distributed) != totalAmount? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfitsForSubSchemes()] [Remain Calculation] Line 631 subtracts distributeAmount from remainAmount. If distributeAmount is calculated incorrectly due to rounding, can remainAmount become negative? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfitsForSubSchemes()] [LastProfitPeriod Update] Line 635 updates LastProfitPeriod to CurrentPeriod for all details. Can this cause issues if sub-scheme hasn't actually claimed profits yet? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfitsForSubSchemes()] [SubItemDetail Null] Line 634 assumes subItemDetail exists. If it's null (sub-scheme has no profit details), can this cause null reference exception? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfitsForSubSchemes()] [Symbol Tracking] Lines 641-644 add symbol to ReceivedTokenSymbols. Can this list grow unboundedly if many different tokens are distributed, causing state bloat? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfitsForSubSchemes()] [TotalShares Zero] SafeCalculateProfits at line 621 divides by totalShares. If totalShares is 0, can this cause division by zero or return incorrect 0 amounts? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: DistributeProfitsForSubSchemes()] [Nested Sub-Schemes] If sub-schemes have their own sub-schemes, distributions happen sequentially. Can deep nesting cause stack overflow or excessive gas consumption for distribution? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ContributeProfits()] [Period Validation] Line 684 asserts input.Period >= CurrentPeriod. Can an attacker contribute to far future periods, locking funds indefinitely until those periods are reached? (Medium)"
]