[
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: TreasuryContract] [Re-entrancy] During dividend distribution calls to TreasuryContract, could malicious Treasury re-enter to claim multiple reward distributions in single transaction? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: TokenContract] [Re-entrancy] When consensus contract calls TokenContract.Transfer for rewards, could TokenContract callback trigger additional consensus operations that corrupt round state? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: TokenHolderContract] [Re-entrancy] Could malicious TokenHolderContract re-enter during profit distribution calls to manipulate miner reward calculations? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: ParliamentContract] [Re-entrancy] When checking Parliament approval for consensus changes, could Parliament contract re-enter to approve its own proposals? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: ConfigurationContract] [Re-entrancy] Could ConfigurationContract re-enter during consensus parameter reads to provide inconsistent values within single round? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [All Properties] [Access Control] Are these internal properties accessible through reflection or serialization, allowing external contracts to read/modify contract references? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: ElectionContract] [Privilege Escalation] Could a non-admin account exploit the internal access modifier to directly set ElectionContract address via state manipulation? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: TreasuryContract] [Privilege Escalation] Is there validation that only authorized genesis contract can set TreasuryContract during initialization? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: TokenContract] [Authorization Bypass] Could unprivileged caller invoke internal methods that modify TokenContract reference through cross-contract calls? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [All Properties] [Upgrade Safety] If AEDPoS contract is upgraded, are these contract references preserved correctly, or could upgrade reset them to null/default causing consensus failure? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: ElectionContract] [Migration Risk] If Election contract is upgraded to new address, is there mechanism to update ElectionContract reference, or does AEDPoS remain pointed to old contract? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: TokenContract] [Backward Compatibility] Could TokenContract upgrade that changes method signatures cause consensus reward distribution to fail with method-not-found errors? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: ElectionContract] [DOS Attack] If ElectionContract enters infinite loop or gas-heavy computation when called, could this permanently halt consensus block generation? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: TreasuryContract] [DOS Attack] Could TreasuryContract deliberately fail or revert during reward distribution to prevent miners from producing blocks? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: ParliamentContract] [DOS Attack] If ParliamentContract verification calls timeout or consume excessive gas, could this block all consensus parameter governance updates? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/ContractsReferences.cs] [Property: ConfigurationContract] [DOS Attack] Could malicious ConfigurationContract return extremely large data structures that cause out-of-memory when reading consensus parameters? (High)"
]