[
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [External: CreateToken Call] At lines 12 and 54, CreateToken is called. If CreateToken has reentrancy guards, can calling it from CreateNFTCollection and CreateNFTInfo cause reentrancy issues? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [External: GetTokenInfo Call] GetTokenInfo is called at lines 61 and 167. Can an attacker manipulate token info between calls to create inconsistent state? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [External: IsInWhiteList Call] At line 78, IsInWhiteList is called. If this involves cross-contract calls, can reentrancy occur before DoTransfer at line 80? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [External: DoTransfer Call] DoTransfer is called at lines 80 and 91. If DoTransfer makes external calls, can reentrancy exploits occur before allowance deduction at line 94? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [External: DealWithExternalInfoDuringTransfer] Called at lines 81-82 and 92-93. If this function has side effects or state changes, can double-calling it cause issues? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [DOS: Symbol Processing] At line 135, symbol.Split() is called. Can attackers provide symbols with thousands of separators to cause excessive array allocation? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [DOS: ExternalInfo Iteration] At lines 22-24, ExternalInfo.Value.TryGetValue is called. If ExternalInfo contains millions of key-value pairs, can this cause gas exhaustion? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [DOS: Complex Assertion Logic] At lines 61-66, CheckSymbolSeed has nested OR conditions and multiple function calls. Can carefully crafted inputs maximize gas consumption in this check? (Low)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [DOS: GetAllowance Fallback Chain] At lines 103-113, GetAllowance checks up to 3 different allowance sources. Can an attacker force all checks to execute, maximizing gas cost? (Low)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [NFT: Item ID Validation] At line 159, IsValidItemId validates words[1]. What constitutes a valid item ID? Can attackers use special IDs like 0, -1, or MAX_INT to cause issues? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [NFT: Collection-Item Relationship] GetNftCollectionSymbol extracts collection from item symbol. Can mismatched collection-item pairs bypass validation (e.g., item from collection A transferred using collection B's allowance)? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [NFT: TotalSupply=1 Enforcement] At line 39, SEED NFTs must have TotalSupply=1. Is this enforced only at creation, or can subsequent mint operations violate uniqueness? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [NFT: Decimals=0 Assumption] At line 39, SEED NFTs must have decimals=0. Do other NFT operations assume decimals=0, and can non-zero decimals cause arithmetic issues? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [SEED: OwnedSymbol Reuse] At line 51, SymbolSeedMap maps ownedSymbol to SEED symbol. After SEED expiry, can the same ownedSymbol be reused for a different SEED, causing confusion? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [SEED: SeedCollectionSymbol Hardcoding] At line 37, SeedCollectionSymbol is compared. If this constant is changed, can existing SEED NFTs become orphaned or invalid? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [SEED: ExpireTime Overflow] At line 44, expirationTime is parsed as long. Can overflow values (e.g., long.MaxValue) cause expiration checks to always pass? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [SEED: OwnedSymbol Type Restriction] At lines 46-47, ownedSymbol cannot be NFT type. Can an attacker create circular dependencies where SEED A owns token B, which requires SEED B that owns token A? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [Exploit: Allowance Griefing] Can an attacker repeatedly call DoTransferFrom with minimal amounts to force victim's allowance to be consumed across wildcard, collection, and specific allowances, causing gas griefing? (Low)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [Exploit: Collection Symbol Squatting] Can an attacker create collections with symbols that are prefixes of popular token symbols (e.g., 'ELF-0' when 'ELF' token exists) to cause confusion? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [Exploit: SEED Front-Running] At line 51, SymbolSeedMap is updated. Can an attacker front-run legitimate SEED creation to claim desirable ownedSymbols? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [Exploit: Memo Surveillance] Since memo is passed through transfer functions, can sensitive information in memo be exploited for surveillance or correlation attacks? (Low)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [Exploit: ExternalInfo Poisoning] At lines 22-24 and 40-45, ExternalInfo is read. Can attackers pre-populate ExternalInfo with malicious values during collection creation to affect NFT creation? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [Lifecycle: Collection Creation to NFT Creation] Is there a time gap or state requirement between CreateNFTCollection and CreateNFTInfo calls? Can race conditions exploit this gap? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_NFT_Actions.cs] [Lifecycle: SEED Expiration Handling] After a SEED expires (checked at line 65), what happens to the SymbolSeedMap entry? Can expired entries cause memory leaks or incorrect state? (Low)"
]