[
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Authorization Bypass] Can an attacker register a voting item with a token symbol that's not in the whitelist by front-running the whitelist removal transaction, causing the whitelist check at line 29-34 to pass initially but fail later, potentially locking voter funds in an invalid voting item? (High)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Hash Collision] Can an attacker craft multiple VotingRegisterInput objects with different options but same hash (calculated at line 354) by manipulating sender address and input parameters, causing voting item ID collision and overwriting existing voting items? (Critical)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Timestamp Manipulation] Can an attacker register a voting item with StartTimestamp equal to EndTimestamp minus 1 (passing validation at line 361) but causing voting window to be effectively zero, enabling them to control voting outcomes by timing snapshot taking? (High)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Integer Overflow] Can an attacker register a voting item with TotalSnapshotNumber set to long.MaxValue (after default assignment at line 359), causing arithmetic overflow in snapshot number calculations during TakeSnapshot() calls? (High)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [State Inconsistency] If token whitelist check at line 29-34 involves external call that can fail or revert, can an attacker register a voting item in an inconsistent state where VotingItem exists but token is not actually whitelisted? (Medium)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Quadratic Voting Exploit] Can an attacker register a quadratic voting item with TicketCost set to zero (no validation present), allowing unlimited free voting and breaking the quadratic voting economic model? (Critical)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Quadratic Voting Overflow] Can an attacker register a quadratic voting item with TicketCost set to long.MaxValue, causing integer overflow in amount calculation at line 102 during Vote() execution? (High)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Options Injection] Can an attacker register a voting item with empty options array (no validation at registration), then add malicious options later, bypassing any intended option validation at registration time? (Medium)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Options Limit Bypass] Can an attacker register a voting item with exactly MaximumOptionsCount (64) options at line 49, then immediately call AddOption() to exceed the limit since AddOption only checks at line 285-286 but not during registration? (Medium)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Timestamp Bypass] Can an attacker register a voting item with StartTimestamp set to past time (no validation that it's >= current time), allowing immediate voting before intended start? (Medium)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [Snapshot Initialization] Can the VotingResult initialization at lines 58-63 create inconsistent state if CurrentSnapshotStartTimestamp differs from StartTimestamp, causing snapshot timing issues? (Low)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Register()] [DOS via Token Check] Can an attacker cause denial of service by registering voting items that trigger expensive token whitelist verification at line 29-34, exhausting gas for legitimate registrations? (Low)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: AssertValidNewVotingItem()] [Hash Collision] At line 354, votingItemId is calculated using input.GetHash(Context.Sender). Can an attacker find hash collision by manipulating input fields while keeping sender same, causing voting item ID reuse? (Critical)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: AssertValidNewVotingItem()] [Duplicate Registration] The check at line 356 only validates that VotingItem doesn't exist, but if an attacker can predict voting item ID, can they grief by front-running legitimate registration? (Medium)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: AssertValidNewVotingItem()] [Zero Snapshot Override] At line 359, if input.TotalSnapshotNumber is 0, it's set to 1. Can an attacker exploit this default behavior to create single-snapshot voting when multiple snapshots were intended? (Low)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [Quadratic Voting Double-Count] At lines 100-101, QuadraticVotesCountMap increments vote count, but if an attacker calls Vote() multiple times with same VoteId (before validation), can they manipulate the count calculation? (Critical)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [Integer Overflow in Quadratic Calculation] At line 102, amount = votingItem.TicketCost.Mul(currentVotesCount). Can an attacker trigger overflow by voting many times with high TicketCost, causing amount to wrap to negative or zero? (Critical)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [Vote Record Overwrite] At line 117, State.VotingRecords[input.VoteId] overwrites any existing record. Can an attacker vote twice with same VoteId, overwriting their first vote and double-counting in UpdateVotingResult()? (Critical)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [Token Lock Bypass] At lines 122-130, tokens are only locked if IsLockToken is true. For delegated voting (IsLockToken=false), can sponsor repeatedly vote on behalf of users without any token backing? (High)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [Delegated Voting Exploitation] For delegated voting at lines 386-388, sponsor must be sender and provide voter address. Can sponsor vote on behalf of arbitrary addresses without their consent, manipulating voter participation records? (High)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [VoteId Generation Collision] At line 397, VoteId is generated using Context.GenerateId(Context.Self, votingResult.VotesAmount.ToBytes(false)). Can two transactions with same VotesAmount generate same VoteId, causing vote overwrite? (Critical)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [Snapshot Boundary Exploit] At line 109, vote is recorded with current snapshot number. Can an attacker vote just before TakeSnapshot(), then vote again after, to count votes in both snapshots? (High)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [Amount Manipulation] At line 96, for non-quadratic voting, amount = input.Amount with no validation. Can an attacker vote with negative amount to reduce vote totals or cause underflow? (Critical)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [Zero Amount Vote] At lines 94-97, there's no check that amount > 0. Can an attacker vote with zero amount to inflate VotersCount without contributing votes, skewing statistics? (Medium)",
  "[File: contract/AElf.Contracts.Vote/VoteContract.cs] [Function: Vote()] [IsChangeTarget Bypass] At line 114, IsChangeTarget is stored but never validated. Can an attacker set this to manipulate vote change detection in downstream systems? (Low)"
]