[
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: ToString()] [Information Disclosure] If the ToString method is called from an untrusted context with a malicious format string, could an attacker extract sensitive miner information or public keys through the 'M' format specifier that aggregates all RealTimeMinersInformation.Keys? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: ToString()] [DoS] If RealTimeMinersInformation contains thousands of entries, could calling ToString with format 'M' cause excessive string concatenation via Aggregate operation, leading to memory exhaustion or gas consumption issues? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Disclosure] Does the GetLogs method expose sensitive consensus information (OutValue, InValue, PreviousInValue, Signature) through logging that could be used to predict or manipulate future consensus rounds? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [DoS] If RealTimeMinersInformation contains a large number of miners with extensive ActualMiningTimes lists, could the string concatenation operations in GetLogs cause excessive memory allocation or processing time? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Null Reference] If minerInRound.ExpectedMiningTime is null, the nullable formatting operator could still cause issues - is this properly handled when converting to DateTime and formatting? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Null Reference] If minerInRound.OutValue, PreviousInValue, InValue, or Signature are null, could calling ToHex() on null values cause exceptions that disrupt logging or expose error details? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Disclosure] The Substring(0, 10) operation on Pubkey reveals the first 10 characters of miner public keys - could this partial information be combined with other data to identify or deanonymize miners? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Index Out of Range] If minerInRound.Pubkey is less than 10 characters, the Substring(0, 10) operation will throw an exception - is this input validation gap exploitable to cause logging failures? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Logic Error] The comparison 't < roundStartTime' determines if an ActualMiningTime belongs to previous round's extra block slot - if GetRoundStartTime() returns incorrect values, could this misclassify mining times and obscure consensus violations? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Leakage] The log output explicitly marks the 'This Node' for the matching public key - could this information be used by attackers to target specific nodes or predict which node will produce the next block? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Leakage] The log identifies the 'Current EBP' (Extra Block Producer) - could exposing this information allow attackers to predict extra block timing or target the EBP node? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [DoS] If a miner has an extremely large number of ActualMiningTimes entries, the OrderBy, Select, and string.Join operations could consume excessive resources - is there a limit on ActualMiningTimes count? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: ToString()] [Input Validation] The ToString method accepts any format string without validation - could passing extremely long format strings cause buffer issues or excessive processing? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Race Condition] If RealTimeMinersInformation is modified concurrently while GetLogs iterates through it, could this cause inconsistent log output or exceptions that reveal system state? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Disclosure] The ImpliedIrreversibleBlockHeight (Lib) is logged for each miner - could discrepancies in these values across miners reveal consensus disagreements or be used to identify byzantine nodes? (Low)"
]