[
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Authorization Bypass] Can an attacker create an organization with identical parameters to an existing organization but different CreationToken, resulting in collision-free duplicate organizations with same voting members but different virtual addresses, enabling governance fragmentation? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Input Validation] Can an attacker set ProposalReleaseThreshold.MinimalApprovalThreshold to 0 despite validation at line 74, causing immediate proposal approval without any member votes, bypassing governance requirements? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Math Logic Error] Can MinimalApprovalThreshold equal MinimalVoteThreshold while MaximalAbstentionThreshold + MinimalApprovalThreshold equals organizationMemberCount, allowing proposals to pass with only abstentions and zero approvals? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Logic Bypass] Can an attacker create organization where MaximalRejectionThreshold + MinimalApprovalThreshold equals organizationMemberCount, enabling proposal approval even when all non-approving members reject? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Duplicate Detection] Does the duplicate check at line 84 only verify non-null existence, allowing re-creation attempts to silently fail without reverting, potentially confusing organization creators about actual organization address ownership? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [State Inconsistency] If organization creation succeeds but OrganizationCreated event emission fails, can the organization exist in state without external indexers knowing, creating state-event desynchronization? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Whitelist Validation] Can ProposerWhiteList contain addresses that are not in OrganizationMemberList, allowing non-members to create proposals that members cannot vote on, causing governance deadlock? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Empty Member List] Despite Empty() check in Validate(), can OrganizationMemberList.OrganizationMembers be populated with invalid/null addresses, passing validation but breaking voting logic? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganizationBySystemContract()] [Authorization Bypass] Can a malicious contract become a system contract through exploit in GetSystemContractNameToAddressMapping(), then create organizations bypassing normal authorization at line 98? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganizationBySystemContract()] [Callback Reentrancy] Can OrganizationAddressFeedbackMethod callback at line 102 re-enter CreateOrganization or other functions, enabling reentrancy attacks during organization creation? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganizationBySystemContract()] [Feedback Method Exploit] Can attacker-controlled OrganizationAddressFeedbackMethod at line 102 consume all gas in SendInline call, causing organization creation to succeed but feedback to fail silently? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganizationBySystemContract()] [Input Validation] Does the function validate that OrganizationCreationInput is properly formed before passing to CreateOrganization at line 100, or can malformed input bypass system contract checks? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposal()] [Authorization Bypass] After AssertIsAuthorizedProposer check at line 109, can organization's ProposerWhiteList be modified before CreateNewProposal executes, allowing unauthorized proposal creation via race condition? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposal()] [Proposal ID Collision] Can an attacker manipulate input.Token to generate predictable proposalId in CreateNewProposal, creating collisions that overwrite existing proposals or prevent proposal creation? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposal()] [Duplicate Prevention] At Association_Helper.cs line 163, does 'Proposal already exists' check prevent front-running where attacker copies proposal parameters to block legitimate proposal creation? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposal()] [Timestamp Manipulation] Can proposer set ExpiredTime far in past or extremely far in future in CreateProposalInput, bypassing validation at Association_Helper.cs line 89 to create un-clearable or instantly-expired proposals? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposalBySystemContract()] [Authorization Confusion] Does line 118 check OriginProposer authorization but line 157 in CreateNewProposal sets Context.Sender as proposer, creating mismatch where system contract becomes proposer instead of OriginProposer? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposalBySystemContract()] [System Contract Bypass] Can malicious system contract create proposals for any organization regardless of ProposerWhiteList by exploiting system contract privilege at line 116? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposalBySystemContract()] [Origin Spoofing] Can system contract specify arbitrary OriginProposer address at line 118, bypassing proposer whitelist checks for unauthorized addresses? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [Double Voting Prevention] Does AssertProposalNotYetVotedBySender at line 126 check all vote types, or can member vote via Approve() then change vote through external contract call before state update at line 131? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [Member List Race] Can organization member be removed from OrganizationMemberList between AssertIsAuthorizedOrganizationMember check at line 128 and Approvals.Add at line 130, allowing removed members to vote? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [Non-Member Approval] Can attacker add their address to proposal.Approvals externally if they gain temporary member access then get removed, causing their approval to count in IsReleaseThresholdReached despite no longer being member? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [Vote After Expiry] Does GetValidProposal at line 125 prevent voting on expired proposals, or can members vote after ExpiredTime, with votes counting if proposal hasn't been cleared via ClearProposal? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [State Update Atomicity] Between line 130 Approvals.Add and line 131 State.Proposals assignment, can reentrancy or concurrent transaction modify proposal state, causing vote loss? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [Event Emission Failure] If ReceiptCreated event at line 132-139 fails after state update at line 131, can off-chain systems miss vote records while on-chain state is updated? (Low)"
]