[
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForTitle] [Input Validation] Could the MaxLengthForTitle value of 255 be insufficient for legitimate governance proposals in non-ASCII languages where multi-byte UTF-8 encoding reduces effective character count, potentially causing DOS by rejecting valid proposals? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForDescription] [Resource Exhaustion] Could the MaxLengthForDescription value of 10200 allow attackers to create proposals with extremely large descriptions that cause excessive storage costs or state bloat, especially if many proposals are created? (Low)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Input Validation] Is the MaxLengthForProposalDescriptionUrl value of 255 sufficient to accommodate complex URL schemes with query parameters, authentication tokens, or long domain names that may be needed for legitimate proposal documentation? (Low)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForTitle] [String Encoding] Do the constants check string.Length (character count) or byte count? If they check character count but the blockchain stores UTF-8 bytes, could an attacker bypass the limit by using multi-byte characters to consume more storage than intended? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForDescription] [String Encoding] Could the 10200 character limit for Description be exploited with special Unicode characters (emoji, combining marks, zero-width characters) to create misleading proposals or consume excessive storage while appearing shorter to users? (Low)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [All Constants] [Consistency] Are these constant values identical to those in Parliament and Referendum contracts, and if not, could the inconsistency allow an attacker to exploit one governance contract while being blocked by another, undermining governance uniformity? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForDescription] [Consistency] The MaxLengthForDescription is 10200 - does this match the maximum transaction size or state storage limits in AElf? Could a mismatch allow proposal creation to succeed but cause failures during proposal execution or storage? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [All Constants] [Validation Bypass] Are these constants used consistently across all proposal creation paths (CreateProposal and CreateProposalBySystemContract)? Could system contracts bypass these limits and create malformed proposals? (High)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForTitle] [Validation Bypass] Since these are public constants, could they be changed in a contract upgrade without migration logic, potentially invalidating existing proposals or allowing previously invalid proposals to become valid retroactively? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForTitle] [Boundary Condition] What happens when a title is exactly 255 characters? Are there off-by-one errors in the validation that could allow 256 characters, or reject valid 255-character titles? (Low)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Boundary Condition] Is there validation for empty strings (length 0)? Could an attacker create proposals with empty titles or URLs that pass validation but cause unexpected behavior in UI or indexing systems? (Low)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForDescription] [Boundary Condition] Could a proposal with description length exactly 10200 cause integer overflow or buffer issues in downstream systems that allocate fixed buffers based on this constant? (Low)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Missing Constants] [Input Validation] Are there minimum length requirements? Could an attacker spam the system with proposals containing single-character or empty titles/descriptions that are technically valid but meaningless? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Missing Constants] [DOS] Without minimum length requirements, could an attacker create thousands of minimal-size proposals to bloat the proposal database while consuming minimal transaction fees? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [URL Validation] The URL length limit is checked before URI validation - could an attacker craft a 255-character string that passes length validation but fails URI validation, wasting gas without creating a valid proposal? (Low)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [URL Validation] Could the 255-character limit prevent the use of legitimate long URLs with extensive query parameters, forcing proposers to use URL shorteners that could later be hijacked or expire? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForDescription] [Resource Cost] Is there dynamic pricing for proposal creation based on description length? Could the fixed 10200-character limit allow attackers to create maximum-size proposals at a fixed cost, causing disproportionate storage burden? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [All Constants] [Gas Optimization] Are these constants used in error messages? Could the validation logic be optimized by checking the most likely-to-fail condition first (e.g., description before title) to save gas on invalid inputs? (Low)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [All Constants] [Proposal Lifecycle] Are these limits only checked at creation time? Could a proposal be created with maximum-length fields and then additional data (approvals, rejections) cause the total state size to exceed storage limits? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForDescription] [State Management] When a proposal is cleared after expiration, is the 10200-character description properly freed from state? Could expired proposals with max-length descriptions accumulate and bloat storage if not properly garbage collected? (Low)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [All Constants] [Upgrade Safety] If these constants are changed in a contract upgrade, what happens to existing proposals that were created under old limits? Could they become invalid or cause failures during retrieval? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [All Constants] [Migration] Is there a mechanism to validate that proposed constant changes are backward-compatible? Could an upgrade reduce MaxLengthForDescription from 10200 to a smaller value, breaking existing proposals? (High)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForDescription] [Spam Attack] Could an attacker create multiple proposals with exactly 10200-character descriptions filled with random data to maximize storage usage and perform a state bloat attack on the Association governance system? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForTitle] [UI/Display Attack] Could an attacker create proposals with 255-character titles containing control characters, BIDI override characters, or homoglyphs to mislead voters in UI displays while passing validation? (Medium)",
  "[File: contract/AElf.Contracts.Association/AssociationConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Phishing Attack] Could the 255-character URL limit be exploited to create lookalike phishing URLs that appear legitimate in truncated displays but redirect to malicious sites? (Low)"
]