[
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Cross-Function: Callback Coordination] Three callback functions (Locking, Transfer, Unlock) all use SendInline. Can attacker trigger callbacks in sequence to drain token balance through reentrancy? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Cross-Function: Authority Checks] Multiple functions check authority (AssertSystemContractOrLockWhiteListAddress, CheckCrossChainTokenContractRegistrationControllerAuthority). Are these consistently applied or can attacker find path that skips checks? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Cross-Function: State Caching] GetElectionContractAddress and GetVoteContractAddress cache addresses. If these contracts call back into TokenContract, can stale cache cause wrong contract to be authorized? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Complex Attack: NFT-Collection Confusion] CheckTokenAndCollectionExists expects collection symbol to end with '-0', but can attacker create NFT with itemId='0' to make it indistinguishable from collection, then exploit this in approval/transfer logic? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Complex Attack: Cross-Chain Replay] CrossChainVerify checks merkle proof but not transaction uniqueness. Can attacker take valid cross-chain mint transaction and replay it multiple times with same proof? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Complex Attack: Fee Allowance Gaming] ModifyFreeFeeAllowanceAmount processes allowances in order by expiration. Can attacker structure multiple allowances to always consume from others' allowances first, never depleting their own? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Complex Attack: Alias Chain Attack] GetTokenInfo resolves aliases once, but what if actualTokenSymbol is itself an alias? Can attacker create A->B->C chain where final resolution differs from expected? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Complex Attack: Callback Reentrancy Chain] If token has callbacks for Lock, Transfer and Unlock, can attacker trigger Lock -> Transfer (via callback) -> Unlock (via callback) -> Lock again, creating reentrancy loop? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Complex Attack: Symbol Case Collision] RegisterTokenInfo uses ToUpper() for case-insensitive check, but State.TokenInfos stores exact case. Can attacker register 'TOKEN', then query 'token' to get different result? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Complex Attack: Blacklist Bypass via Lock] IsInTransferBlackListInternal only blocks DoTransfer. Can blacklisted address lock tokens to voting contract, then have voting contract transfer them out, bypassing blacklist? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Complex Attack: Balance Underflow via Multiple Paths] If ModifyBalance is called from Transfer, Burn, and Fee deduction simultaneously, can total deductions exceed balance causing underflow before any individual check catches it? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Math: Add() Overflow] Line 123 uses before.Add(addAmount). Does Add() throw on overflow or silently wrap? Can attacker trigger overflow to create infinite balance? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContract_Helper.cs] [Math: Negative Amount Edge Case] ModifyBalance accepts negative addAmount. What happens if addAmount is exactly Int64.MinValue? Does negation on line 120 overflow? (High)"
]