[
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Authorization Bypass] Can any user create unlimited profit schemes by repeatedly calling CreateScheme with different Context.Sender addresses, potentially causing state bloat or DOS through excessive scheme creation? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [State Collision] If a user calls CreateScheme twice, does the second call overwrite the first scheme at State.TokenHolderProfitSchemes[Context.Sender], causing loss of the first scheme's SchemeId and making funds inaccessible? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Input Validation] Can input.MinimumLockMinutes be set to zero or negative values, allowing immediate withdrawals and bypassing the intended lock period mechanism? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Input Validation] Can input.MinimumLockMinutes be set to an extremely large value (e.g., int64.MaxValue), effectively creating a permanent lock that prevents withdrawals indefinitely? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Input Validation] Is input.Symbol validated to ensure it represents a valid token before creating the scheme, or can arbitrary symbols lead to scheme creation with non-existent tokens? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [State Inconsistency] The scheme is stored before the ProfitContract.CreateScheme call completes - if that call fails, is the local state left in an inconsistent state with a scheme that has no corresponding profit scheme? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Cross-Contract Call] Does the ProfitContract.CreateScheme.Send call have any failure modes that could leave State.TokenHolderProfitSchemes populated but without a valid underlying profit scheme? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Authorization] Manager is set to Context.Sender in ProfitContract - can this be exploited to create schemes where the manager is a contract address that can be manipulated? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Configuration] IsReleaseAllBalanceEveryTimeByDefault is hardcoded to true - could this lead to unexpected behavior where funds are always released even when partial distribution is intended? (Low)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Configuration] CanRemoveBeneficiaryDirectly is hardcoded to true - does this allow scheme managers to remove beneficiaries and steal their shares before they claim profits? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Input Validation] Can AutoDistributeThreshold contain negative values in the map, potentially causing underflow or logic errors during auto-distribution checks? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [Input Validation] Can AutoDistributeThreshold be empty or null, and if so, does this cause issues in RegisterForProfits where it's checked? (Low)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: CreateScheme()] [DOS] Can an attacker create schemes with AutoDistributeThreshold containing thousands of token symbols, causing gas exhaustion during RegisterForProfits iterations? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [Authorization] Does AddBeneficiary check that Context.Sender is the scheme manager, or can any user add arbitrary beneficiaries to any scheme? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [Arithmetic Overflow] On line 55, shares.Add(detail.Details.Single().Shares) could overflow if the sum exceeds int64.MaxValue - is there overflow protection? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [Logic Error] If detail.Details.Any() is true but contains multiple entries (not single), will detail.Details.Single() throw an exception causing DOS? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [Share Manipulation] Can a malicious manager repeatedly add and remove the same beneficiary to accumulate shares without actually locking more tokens? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [Input Validation] Can input.Shares be zero or negative, potentially causing division by zero or incorrect profit calculations in the Profit contract? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [State Consistency] RemoveBeneficiary is called before AddBeneficiary - if RemoveBeneficiary succeeds but AddBeneficiary fails, the beneficiary loses their existing shares permanently? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [Input Validation] Is input.Beneficiary validated to be non-null and non-zero address before being added as a beneficiary? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [Logic Error] The comment says 'Only keep one detail' but the code removes and re-adds - could this cause unexpected period reset or profit loss for the beneficiary? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [Reentrancy] Could a malicious beneficiary contract exploit reentrancy during the RemoveBeneficiary or AddBeneficiary cross-contract calls? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: AddBeneficiary()] [Share Duplication] If GetProfitDetails returns details but the Single() assumption is wrong, could shares be duplicated instead of merged? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: RemoveBeneficiary()] [Authorization] Does RemoveBeneficiary verify that Context.Sender is authorized (scheme manager) before removing beneficiaries and their shares? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: RemoveBeneficiary()] [Logic Error] Line 78 calls .Details.Single() - if there are zero or multiple details, will this throw an exception causing DOS? (High)"
]