[
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Authorization Bypass] The SetMethodFee method returns Empty() without any authorization checks - can any caller freely set arbitrary method fees for the NFT contract, bypassing governance and allowing unauthorized fee manipulation? (Critical)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Missing State Management] The SetMethodFee method does not store the provided MethodFees to any state variable - does this mean method fee changes are silently ignored, creating a disconnect between governance proposals and actual fee enforcement? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: ChangeMethodFeeController()] [Authorization Bypass] The ChangeMethodFeeController method returns Empty() without verifying Context.Sender matches the current controller - can any address claim ownership of the method fee controller, bypassing Parliament governance? (Critical)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: ChangeMethodFeeController()] [Missing State Management] The ChangeMethodFeeController method does not persist the AuthorityInfo to State.MethodFeeController - does this create a vulnerability where controller changes are accepted but never enforced? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFeeController()] [Missing Initialization] GetMethodFeeController returns an empty AuthorityInfo{} instead of initializing with Parliament default organization - does this break ACS1 standard expectations and prevent governance-based fee management? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Hardcoded Fee Vulnerability] GetMethodFee returns a hardcoded 100 ELF fee only for 'Create' method - can this fixed fee become economically exploitable if ELF price increases dramatically, making NFT creation prohibitively expensive and causing DOS? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Fee Bypass] GetMethodFee returns empty MethodFees{} for all methods except 'Create' - does this mean all other NFT contract methods (Mint, Transfer, Burn, etc.) have zero transaction fees, allowing spam attacks? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Symbol Hardcoding] The Create method fee hardcodes Context.Variables.NativeSymbol without validating it exists - could this cause transaction failures if NativeSymbol is misconfigured or changes during a chain upgrade? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Fee Immutability] GetMethodFee always returns 100_00000000 for Create regardless of SetMethodFee calls - does this violate the ACS1 standard's promise that SetMethodFee controls method fees, breaking governance expectations? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Input Validation Missing] SetMethodFee accepts MethodFees input but performs no validation on Fees array, BasicFee amounts, or Symbol validity - could malicious input cause issues if this implementation is ever activated? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Standard Violation] ACS1 standard requires SetMethodFee to 'override all fees of the method', but this implementation does nothing - does this violate the contract interface specification and break caller expectations? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: ChangeMethodFeeController()] [Standard Violation] ACS1 standard specifies 'the default is parliament and default organization', but GetMethodFeeController returns empty AuthorityInfo - is this a compliance violation that breaks governance integration? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Inconsistent Behavior] GetMethodFee checks input.Value == nameof(Create) using exact string matching - could case sensitivity or method name changes in protobuf compilation cause fee lookup failures? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Missing IsSizeFeeFree] GetMethodFee for Create does not set IsSizeFeeFree flag - should Create method be exempt from size-based fees like system methods in MultiToken contract are? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFeeController()] [Governance Bypass] GetMethodFeeController does not reference Parliament contract or default organization - can NFT fee governance proposals be created but never executable since there's no valid authority? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: ChangeMethodFeeController()] [Organization Validation Missing] ChangeMethodFeeController does not call CheckOrganizationExist to validate the AuthorityInfo.ContractAddress - could invalid or non-existent organizations be set as controllers? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [RequiredMethodFeeControllerSet Missing] SetMethodFee does not call RequiredMethodFeeControllerSet() to initialize Parliament default controller - does this prevent proper governance initialization on first deployment? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Sender Verification Missing] SetMethodFee lacks 'Assert(Context.Sender == State.MethodFeeController.Value.OwnerAddress)' check - can any address including malicious contracts call this method without authorization? (Critical)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [State Map Missing] The implementation has no State.TransactionFees mapped state to store method fees - is this a stub implementation that will cause integration failures when activated? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFeeController()] [State Variable Missing] NFTContractState has no MethodFeeController state variable - does this mean the controller can never be persisted, breaking the upgrade/change controller functionality? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [State Lookup Missing] GetMethodFee does not query State.TransactionFees[input.Value] like MultiToken does - is the hardcoded Create fee intentionally bypassing stored fee configuration? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: All Methods] [Contract Initialization] No Initialize() method visible in this partial class - could the MethodFeeController never get initialized with Parliament default, leaving governance permanently broken? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Context.Variables Dependency] The code accesses Context.Variables.NativeSymbol directly - could this fail if the Variables plugin is not initialized or returns null during early chain state? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: ChangeMethodFeeController()] [Cross-Contract Validation Missing] ChangeMethodFeeController does not validate AuthorityInfo.ContractAddress is a valid authorization contract (Parliament/Association/Referendum) - can arbitrary contracts be set as controllers? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Token Burnability Missing] SetMethodFee does not verify fee tokens are burnable via AssertValidFeeToken like MultiToken does - could non-burnable tokens be set as method fees causing collection failures? (Medium)"
]