[
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: Initialized] [Initialization] Can the Initialized state be manipulated or re-initialized after initial setup, allowing an attacker to call InitialTreasuryContract multiple times and recreate profit schemes, causing accounting confusion or fund lock? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: TreasuryHash] [State Integrity] If TreasuryHash is set to null or an invalid Hash after initialization, could subsequent Release() or Donate() operations fail or send funds to wrong schemes, causing permanent fund loss? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: WelfareHash, SubsidyHash, RewardHash] [Scheme Corruption] Can an attacker cause these scheme hashes to point to malicious profit schemes they control, redirecting all treasury distributions to attacker addresses? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: BasicRewardHash, VotesWeightRewardHash, ReElectionRewardHash] [Reward Redirection] If these hash values are modified without proper validation, could mining rewards be redirected to unauthorized beneficiaries instead of legitimate miners? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: TransactionFees] [Fee Manipulation] Can the MappedState<string, MethodFees> be manipulated to set zero fees for expensive operations or excessive fees for cheap operations, enabling DOS or economic attacks? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: MethodFeeController] [Authorization Bypass] If MethodFeeController is set to null or an attacker-controlled organization, could unauthorized fee changes be executed, allowing free transactions or denial of service? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: TreasuryController] [Governance Takeover] Can TreasuryController be changed to an attacker's address without proper multi-sig approval, allowing complete control over treasury settings and fund distribution? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: SymbolList] [Token Whitelist] If SymbolList is modified to exclude native token or include malicious tokens, could donations fail or malicious tokens be accepted, causing accounting errors? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: DividendPoolWeightSetting] [Weight Manipulation] Can weight values be set to zero or extreme values, causing division by zero errors or unfair distribution skewing all rewards to one pool? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: MinerRewardWeightSetting] [Reward Distribution] If BasicMinerRewardWeight is set to zero while others are high, could all rewards go to Welcome/Flexible pools, denying regular miners their earnings? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: DonatedDividends] [Accounting] Can the MappedState<long, Dividends> be corrupted by setting arbitrary block heights with fake dividend amounts, causing incorrect reward calculations? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: MiningReward] [Reward Inflation] If MiningReward SingletonState is manipulated to extreme values, could it cause treasury inflation or deflation, breaking economic invariants? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: LatestMinedTerm] [Miner Tracking] Can LatestMinedTerm mappings be corrupted to mark miners as new when they're not, causing them to receive welcome rewards multiple times? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: IsReplacedEvilMiner] [Miner Flagging] If IsReplacedEvilMiner flag is cleared prematurely or never set, could evil miners receive full rewards instead of reduced shares? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: ReplaceCandidateMap] [Candidate Injection] Can attackers inject arbitrary pubkeys into ReplaceCandidateMap for future terms, claiming welcome rewards they shouldn't receive? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: HasNewMiner] [Term Manipulation] If HasNewMiner flag is manipulated, could flexible rewards be incorrectly routed to Welfare or Basic pools, breaking reward distribution logic? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: ProfitsReceiverMap] [Receiver Hijacking] Can ProfitsReceiverMap be modified without proper authorization, redirecting miner/candidate rewards to attacker addresses? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContractState.cs] [State: TreasuryVirtualAddress] [Address Poisoning] If TreasuryVirtualAddress is changed to attacker-controlled address, would all treasury funds be redirected, causing total fund loss? (Critical)"
]