[
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: ProfitContract] [Profit Theft] Are there setter functions for ProfitContract reference that lack proper authorization, enabling attacker to redirect AddBeneficiary calls to drain subsidy pool? (Critical)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: TokenContract] [Token Theft] Can TokenContract reference be updated without authorization to point at malicious contract that approves unlimited transfers from election contract balance? (Critical)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: VoteContract] [Race Condition] If VoteContract is lazily initialized via Context.GetContractAddressByName, can attacker front-run initialization to register fake vote contract address? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: ParliamentContract] [Race Condition] During concurrent SetVoteWeightInterest calls, can race in ParliamentContract initialization cause wrong default organization to authorize vote weight changes? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: AEDPoSContract] [Race Condition] Can concurrent UpdateCandidateInformation calls during AEDPoSContract initialization bypass sender authorization checks? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: VoteContract] [State Desync] If VoteContract.TakeSnapshot and ElectionContract snapshot logic desync, can vote weights be calculated from stale voting records causing incorrect miner selection? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: ProfitContract] [State Desync] If ProfitContract.DistributeProfits fails but ElectionContract increments CurrentTermNumber, can subsequent distributions use wrong period causing reward loss? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: TokenContract] [State Desync] If TokenContract.Lock succeeds but VoteContract.Vote fails, are tokens permanently locked without corresponding vote entry? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: VoteContract] [Contract Upgrade] If VoteContract is upgraded with incompatible GetVotingRecord return type, will ElectionContract calls revert breaking all withdrawals? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: ProfitContract] [Contract Upgrade] If ProfitContract is upgraded removing GetScheme method, will GetEndPeriod calculations fail preventing all new votes? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: TreasuryContract] [Contract Upgrade] If TreasuryContract migration breaks GetProfitsReceiverOrDefault, can candidate subsidy payments fail causing loss of backup miner incentives? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: ProfitContract] [DOS Attack] If ProfitContract.GetProfitDetails returns unbounded details list, can attacker create excessive profit entries causing GetProfitDetailByElectionVotingRecord to exhaust gas? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: DividendPoolContract] [DOS Attack] Can DividendPoolContract.GetSymbolList return large symbol array causing DistributeProfits to exceed gas limit, freezing term transitions? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContractReferenceState.cs] [Property: VoteContract] [DOS Attack] If VoteContract.GetVotingRecord has unbounded gas cost for complex vote IDs, can attacker create expensive vote IDs that DOS Withdraw operations? (Low)"
]