[
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: DefaultOrganizationMinimalApprovalThreshold=6667] [Governance Bypass] Can an attacker exploit the 66.67% approval threshold to pass malicious proposals with only 67% miner support when parliament size is small (e.g., 3 miners), allowing 2 compromised miners to control governance and bypass the intended supermajority requirement? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: DefaultOrganizationMaximalAbstentionThreshold=2000] [Governance Denial-of-Service] Can 21% of miners (just above the 20% abstention threshold) deliberately abstain on critical proposals to permanently block governance actions, creating a DOS vector where no proposals can pass even with unanimous approval from remaining miners? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: DefaultOrganizationMaximalRejectionThreshold=2000] [Governance Denial-of-Service] Can 21% of miners (just above the 20% rejection threshold) permanently veto all proposals by voting reject, enabling a minority to block critical system upgrades, security patches, or economic parameter changes? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: DefaultOrganizationMinimalVoteThresholdThreshold=7500] [Threshold Inconsistency] Does the 75% minimal vote threshold (7500/10000) create a scenario where proposals can pass with 66.67% approval but fail due to insufficient total participation, and can attackers exploit this by preventing miners from voting to DOS governance? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: AbstractVoteTotal=10000] [Integer Overflow] When multiplying vote counts by AbstractVoteTotal=10000 in threshold calculations, can an attacker trigger integer overflow with a large parliament size (e.g., >2^31/10000 = 214,748 miners), causing vote validation logic to fail or incorrectly approve/reject proposals? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Mathematical Invariant Violation] Do the constants allow invalid states where MinimalApprovalThreshold(6667) + MaximalAbstentionThreshold(2000) + MaximalRejectionThreshold(2000) = 10667 > AbstractVoteTotal(10000), violating the fundamental constraint that approval+abstention+rejection cannot exceed 100%? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalVoteThreshold=7500, MinimalApproval=6667] [Threshold Logic Error] Can a proposal with exactly 66.67% approvals and 8.33% abstentions (total 75% participation) pass governance checks despite having abstentions, and does this violate the invariant that approval threshold should account for non-approval votes? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MaximalAbstentionThreshold=2000, MaximalRejectionThreshold=2000] [Symmetry Assumption] Does treating abstention and rejection thresholds equally (both 20%) create exploitable edge cases where strategic voting between abstain/reject can bypass intended governance safeguards? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: AbstractVoteTotal=10000] [Precision Loss] When calculating percentages using integer division with AbstractVoteTotal=10000 base, can rounding errors accumulate across multiple proposals or voting rounds to cause incorrect governance outcomes (e.g., 6666/10000 vs 6667/10000 approval rates)? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: DefaultOrganizationMinimalApprovalThreshold=6667] [Boundary Condition] At exactly 66.67% approval (e.g., 2 of 3 miners), does the >= comparison in threshold checks allow proposals to pass, and can attackers exploit the boundary by timing votes to hit exactly this threshold before opposition can vote? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All] [Immutability Risk] Are these constants truly immutable after compilation, or could a malicious contract upgrade or cross-contract call modify them at runtime, allowing an attacker to change governance thresholds to 0% approval or 100% rejection requirements? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All] [Default Organization Lock-in] Since these constants are used only during Initialize() for the default organization, can an attacker exploit the one-time initialization to create a default organization with these potentially flawed thresholds that cannot be changed later? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All] [Hardcoded Values] Do the hardcoded constant values prevent governance from adapting to changing network conditions (e.g., increased miner count, security incidents), and can this inflexibility be exploited to maintain control after initial compromise? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: Used in Initialize()] [Race Condition] Can an attacker front-run the Initialize() call to set up the default organization with these constant thresholds before legitimate initialization, gaining control over the primary governance organization? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: Used in Initialize()] [Reentrancy] Could a malicious contract exploit reentrancy during Initialize() when these constants are applied to the default organization, potentially creating multiple default organizations or manipulating threshold values? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: AbstractVoteTotal=10000] [Cross-Contract Inconsistency] If other governance contracts (Referendum, Association) use different AbstractVoteTotal values or percentage bases, can an attacker exploit conversion errors when proposals are passed between governance systems? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Emergency Organization Bypass] Can these default threshold constants be bypassed when CreateEmergencyResponseOrganization() uses different hardcoded values (90% approval), and does this create a two-tier governance system with inconsistent security assumptions? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalApprovalThreshold=6667] [Single Miner Attack] With only 1 miner in parliament, does the 66.67% threshold calculation round down to 0.6667 miners required, allowing the single miner to approve proposals with 1 vote (100% > 66.67%), and can this be exploited during initial network bootstrap? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalVoteThreshold=7500] [Two Miner Deadlock] With 2 miners, does the 75% vote threshold require 1.5 miners to participate, and can rounding errors cause both miners voting to fail the threshold check (2*10000/2 = 10000 vs required 7500*2 = 15000)? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Three Miner Governance] With exactly 3 miners (common in test networks), can 2 miners (66.67%) pass proposals by exploiting exact threshold matching, and does this create a security risk where losing control of 2 of 3 nodes compromises the entire governance system? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: AbstractVoteTotal=10000] [Large Parliament Overflow] With 1000+ miners, when calculating approvedMemberCount * AbstractVoteTotal (line 84 of Parliament_Helper.cs), can integer overflow occur if approvedMemberCount * 10000 exceeds int32 max value (2,147,483,647), causing approval checks to fail or incorrectly succeed? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: All thresholds] [Rounding Precision] With large parliament sizes (e.g., 10,000 miners), does integer division in threshold calculations introduce precision errors where (6667 * 10000) / 10000 != 6667 due to intermediate overflow, potentially allowing proposals to pass with insufficient approval? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MaximalAbstentionThreshold=2000] [Abstention Griefing] Can a coalition of 20% miners permanently abstain on all proposals to keep them just at the threshold, preventing both approval and rejection, and creating a governance deadlock that requires manual intervention? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MaximalRejectionThreshold=2000] [Rejection Griefing] Can 20% of miners reject all proposals to keep rejection count exactly at the threshold boundary, and can they coordinate to add/remove rejection votes to manipulate proposal timing and prevent release? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament_Constants.cs] [Constants: MinimalApprovalThreshold=6667] [Vote Withholding] Can a miner with >33% voting power withhold their vote until the last moment, then vote reject to push rejection over the threshold (with cooperation from 20% of miners), effectively giving them veto power despite being a minority? (High)"
]