[
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForTitle] [Input Validation] If validation uses >= instead of >, can an attacker submit a 256-character title to bypass the 255 limit, causing storage overflow or unexpected behavior in downstream consumers? (High)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Input Validation] If validation checks string.Length (character count) but storage uses UTF-8 byte encoding, can an attacker submit 10200 multi-byte Unicode characters (e.g., emoji/CJK) totaling 40KB+ bytes to cause storage DOS or exceed block size limits? (High)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Input Validation] If URL validation checks character length but HTTP clients use byte length, can an attacker submit a 255-character URL with multi-byte encoding totaling 1KB+ to bypass downstream URL size limits or cause parsing failures? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForTitle] [Off-by-One Error] If consuming code checks input.Title.Length < MaxLengthForTitle instead of <=, can an attacker submit exactly 255 characters when only 254 are intended, potentially breaking fixed-size storage assumptions? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Null Handling] If the 10200 character limit is enforced without null checks, can an attacker pass null descriptions to bypass validation and inject null references into proposal storage, causing contract crashes during proposal retrieval? (High)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Storage DOS] Can an attacker create thousands of proposals with exactly 10200-character descriptions to maximize state storage costs, economically attacking the chain by exhausting affordable storage limits? (High)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Gas Exhaustion] If proposal descriptions are hashed or indexed on-chain, can an attacker submit maximum-length 10200-character strings with pathological patterns (repeated characters, null bytes) to cause quadratic gas consumption during string processing? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForTitle] [Spam Attack] Can an attacker create proposals with maximum-length titles (255 chars) and descriptions (10200 chars) at minimal cost to spam governance, making legitimate proposals hard to find and degrading user experience? (Low)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [External DOS] If the contract or indexer automatically fetches URLs up to 255 characters, can an attacker submit malicious URLs pointing to slow/infinite-response endpoints to DOS external systems monitoring proposals? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Unicode Normalization] If consuming code doesn't normalize Unicode before length checking, can an attacker submit descriptions using composed vs decomposed characters (NFC vs NFD) to bypass the 10200 limit by storing effectively duplicate data? (Low)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForTitle] [Control Characters] Does the 255-character limit allow control characters (null bytes, newlines, escape sequences)? Can an attacker inject control characters in titles to break display systems, logs, or JSON serialization without violating the length constraint? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [URL Encoding] If the 255-character limit is checked before URL encoding/decoding, can an attacker submit a 200-character raw URL that expands to 300+ characters after percent-encoding, bypassing downstream URL length limits? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Surrogate Pairs] In UTF-16 environments, if length is counted as code units rather than code points, can an attacker submit 10200 surrogate pairs (20400 code units) representing 10200 characters to double actual storage consumption? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForTitle] [Cross-Contract Inconsistency] Association and Referendum contracts have identical MaxLengthForTitle=255, but if Parliament increases this limit in an upgrade without coordinating, can proposals with 256+ char titles migrate from Parliament to Association/Referendum and be rejected, breaking cross-governance workflows? (High)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Storage Format Mismatch] If the 10200 limit assumes ASCII but storage uses UTF-8, and another contract reads descriptions as UTF-16, can encoding mismatches corrupt proposal text or truncate descriptions mid-character, violating governance transparency? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constants] [Version Compatibility] If these constants are changed in a contract upgrade but historical proposals were stored under old limits, can queries against old proposals fail validation checks, making historical governance data inaccessible? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForTitle] [Empty String] If MaxLengthForTitle=255 but minimum length is unchecked, can an attacker create proposals with empty titles, making proposals indistinguishable in UIs and breaking governance discovery mechanisms? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Whitespace-Only] If the 10200-character limit doesn't validate content quality, can an attacker submit descriptions consisting entirely of spaces or newlines, wasting storage while providing zero information and degrading governance quality? (Low)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Invalid URLs] Does the 255-character limit validate URL format, or can an attacker submit non-URL strings (arbitrary text, SQL injection payloads) that pass length checks but break systems expecting valid URLs? (High)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Storage Cost Attack] At 10200 characters per proposal, if storage costs are underpriced relative to proposal creation fees, can an attacker profit by creating max-length proposals and forcing the chain to subsidize expensive state storage? (High)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForTitle] [Indexing Overhead] If off-chain indexers store titles up to 255 characters without compression, can max-length title spam cause indexer databases to bloat, degrading query performance and increasing infrastructure costs? (Low)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Compression Bypass] If descriptions are compressed before storage, can an attacker craft 10200-character strings with low compressibility (random characters, high entropy) to maximize post-compression storage size and attack compression assumptions? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForDescription] [Information Hiding] Can a malicious proposer embed misleading information deep within a 10200-character description, exploiting voter attention limits to hide malicious proposal details that violate governance intent but pass length validation? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForTitle] [Impersonation] With 255 characters available, can an attacker craft titles nearly identical to legitimate proposals (using Unicode lookalikes, zero-width characters) to confuse voters and redirect approval to malicious proposals? (High)",
  "[File: contract/AElf.Contracts.Parliament/ParliamentConstants.cs] [Constant: MaxLengthForProposalDescriptionUrl] [Phishing] Can an attacker submit a 255-character URL to a phishing site mimicking legitimate proposal documentation, exploiting the lack of URL validation to steal voter credentials or manipulate voting decisions? (High)"
]