[
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Approve()] [Race Condition] Can two approve transactions from the same parliament member be included in the same block, bypassing the AssertProposalNotYetVotedByMember check at line 82? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Approve()] [State Manipulation] After approving, can the parliament member be removed from the miner list, and does their vote still count in IsReleaseThresholdReached calculations? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Approve()] [DOS Attack] Can an attacker fill the proposal.Approvals list with a massive number of addresses (if they gain temporary parliament access) to cause gas exhaustion in threshold calculations? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Approve()] [Reentrancy] Can the ReceiptCreated event firing at line 85-92 be exploited for reentrancy if event handlers can call back into the contract? (Low)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Approve()] [Time Manipulation] Can a proposal be approved after ExpiredTime if the approval transaction is submitted just before expiration but processed after? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Reject()] [Vote Manipulation] Can a parliament member vote to reject, then immediately change to approve in the same block by exploiting transaction ordering? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Reject()] [Logic Error] If proposal.Rejections list grows very large, can the rejection threshold calculation overflow when computing rejectionMemberCount * AbstractVoteTotal? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Reject()] [State Inconsistency] Can a member's rejection vote remain counted even after they are removed from the current parliament member list? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Reject()] [Front-Running] Can a malicious member front-run a Release transaction by submitting enough rejection votes to block the proposal just before release? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Abstain()] [Vote Manipulation] Can abstention votes be strategically cast to prevent proposals from reaching the minimal vote threshold without triggering the maximal abstention threshold? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Abstain()] [Logic Error] Does abstaining count toward both MinimalVoteThreshold and MaximalAbstentionThreshold, creating contradictory conditions where a proposal can be simultaneously approved and rejected? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Abstain()] [DOS Attack] Can parliament members all abstain to freeze governance permanently by preventing any proposal from reaching approval threshold? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Abstain()] [State Manipulation] Can abstention votes be added after a proposal is already released but before it's removed from state? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Release()] [Authorization Bypass] Can the proposer check at line 135 be bypassed if the Proposer field in ProposalInfo is manipulated during proposal creation? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Release()] [Reentrancy Attack] Can the SendVirtualInlineBySystemContract call at line 138-140 be exploited for reentrancy to release the same proposal multiple times before it's removed from state? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Release()] [Time-Based Attack] Can a proposal be released after its ExpiredTime if IsReleaseThresholdReached() doesn't check expiration, allowing execution of stale proposals? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Release()] [Logic Error] If the proposal is removed from state at line 142 but SendVirtualInlineBySystemContract fails, is the proposal lost permanently without being executable? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Release()] [State Manipulation] Can the parliament member list change between threshold check and execution, causing a proposal that no longer meets threshold to be released? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Release()] [DOS Attack] Can a proposer release a proposal that calls back into Parliament contract methods, causing infinite recursion? (Medium)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: Release()] [Virtual Address Attack] Can CalculateVirtualHash be manipulated to call arbitrary contracts by controlling organization.CreationToken during organization creation? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: ChangeOrganizationThreshold()] [Authorization Bypass] Can any address call ChangeOrganizationThreshold by creating an organization with that address, then modifying its thresholds to invalid values? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: ChangeOrganizationThreshold()] [Logic Error] Can an organization change its thresholds to values that make it impossible to release any future proposals (e.g., MinimalApprovalThreshold > 10000)? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: ChangeOrganizationThreshold()] [State Inconsistency] Can threshold changes apply retroactively to existing proposals, allowing already-approved proposals to become unapproved? (Critical)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: ChangeOrganizationThreshold()] [Race Condition] Can threshold changes be front-run by proposal releases to either block or force execution of pending proposals? (High)",
  "[File: contract/AElf.Contracts.Parliament/Parliament.cs] [Function: ChangeOrganizationThreshold()] [Validation Bypass] Does Validate(organization) at line 152 properly check for integer overflow in threshold calculations, or can adversarial thresholds bypass validation? (Medium)"
]