[
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetDividends()] [Future Block Check] Asserts CurrentHeight > input.Value - but can querying dividends for current block (CurrentHeight == input.Value) cause confusion about whether mining reward is included? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetDividends()] [State Read Inconsistency] Reads DonatedDividends for specific block and MiningReward global state - if MiningReward is updated after dividend snapshot, can reward be double-counted or missed? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetDividends()] [Null Dictionary Handling] If dividends is null, creates new with only native symbol - but shouldn't it still check DonatedDividends for other symbols that might have been donated? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetUndistributedDividends()] [Gas Exhaustion] Iterates all symbols in SymbolList and calls GetBalance for each - if symbol list is very large, can this exceed gas limits making function uncallable? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetUndistributedDividends()] [Missing Error Handling] If GetBalance fails for any symbol (token not exists), does the entire function revert, or does it skip that symbol, potentially hiding missing funds? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetTreasurySchemeId()] [Null Return] Returns Hash.Empty if State.TreasuryHash.Value is null - can callers distinguish between uninitialized and intentionally empty, causing confusion? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetSymbolList()] [No Null Check] Directly returns State.SymbolList.Value - if this is null (shouldn't be after init, but if state corrupted), will caller crash trying to iterate null list? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetInitialMinerList()] [Round 1 Assumption] Queries round 1 information - if round 1 data is corrupted or missing, will this return empty list, breaking all new-miner detection logic? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetAddressesFromCandidatePubkeys()] [Duplicate Addresses] Adds both Address.FromPublicKey and GetProfitsReceiver for each pubkey - if receiver isn't set, doesn't this add same address twice, causing duplicate beneficiary registration? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetAddressesFromCandidatePubkeys()] [Invalid Pubkey] No validation that pubkeys are valid hex strings - can invalid pubkey cause Address.FromPublicKey to throw, breaking entire reward update? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetProfitsReceiver()] [Fallback Risk] If ProfitsReceiverMap returns null, falls back to Address.FromPublicKey - if pubkey is invalid or this address is contract/burner, are rewards permanently lost? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: GetVotesWeight()] [Election Contract Dependency] Calls Election contract's GetCalculateVoteWeight - if Election contract is compromised or has bug, can it return manipulated weights affecting welfare distributions? (High)"
]