[
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: TokenConverterFeeRate] [Economic Exploit] Could the hardcoded 0.005 (0.5%) fee rate be insufficient to prevent arbitrage attacks or MEV exploitation in TokenConverter swaps, allowing attackers to drain liquidity pools through repeated small swaps with minimal fees paid? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenConnectorInitialVirtualBalance] [Supply Manipulation] Could the 100,000 initial virtual balance for the native token connector create price manipulation vulnerabilities in the Bancor-based TokenConverter when combined with low actual reserve balances? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenInitialVirtualBalance] [Price Oracle Attack] Is the ResourceTokenInitialVirtualBalance of 100,000 (without decimals, vs 100,000_00000000 for NativeToken) intentionally 100 million times smaller, and could this asymmetry enable price manipulation in the TokenConverter reserve ratio calculations? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenTotalSupply] [Inflation Attack] Could the hardcoded ResourceTokenTotalSupply of 500,000,000 tokens be exceeded if other contracts have mint authority, causing supply inflation beyond the intended cap? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ElectionTokenTotalSupply] [Voting Power Manipulation] Could the 1 billion VOTE token supply enable whale attacks where a single entity acquires >51% voting power since the supply is capped and immutable? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: MemoMaxLength] [DoS Attack] Is the 64-byte memo limit enforced consistently across all contracts using memos, or could larger memos bypass validation in some paths causing storage bloat DoS? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenToResourceBalance] [Economic Imbalance] Could the 10,000,000 native-to-resource balance ratio create unfair initial pricing that advantages early adopters or enables pump-and-dump schemes? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: PayTxFeeSymbolListName, PayRentalSymbolListName] [Configuration Tampering] If these string names reference mutable configuration storage, could an attacker modify the symbol lists to cause transaction failures or enable fee evasion? (High)"
]