[
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: IsTimeToChangeTerm()] [Off-by-One Logic] The example shows term changes at period boundaries - can attackers exploit edge cases at exact period multiples to cause unexpected term transitions? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetAbsModulus()] [Unused Function] This static function is defined but may not be used - can dead code harbor vulnerabilities if accidentally called elsewhere? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetAbsModulus()] [Division by Zero] If intValue is 0, modulus operation throws DivideByZeroException - can this cause DoS if function is used in consensus logic? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetAbsModulus()] [Negative Result Masking] The Math.Abs masks whether original result was negative - can this hide important signedness information needed for validation? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Multiple Functions] [Race Condition] If RealTimeMinersInformation can be modified during iteration in functions like GetMinedBlocks, CalculateSignature, can concurrent modifications cause inconsistent state? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Multiple Functions] [Null MinerInRound] Many functions access minerInRound properties without null checks - if RealTimeMinersInformation contains null values, can this cause cascading NullReferenceExceptions? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [RoundId + GetHash] [Hash Collision] If RoundId calculation changes but GetHash doesn't update properly, can two different rounds produce same hash and break round validation? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [GetMiningInterval + IsTimeSlotPassed] [Inconsistent Intervals] If GetMiningInterval returns different values when called at different times in same round, can IsTimeSlotPassed produce inconsistent results? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [FirstMiner + GetRoundStartTime] [Null Timestamp] If FirstMiner returns empty MinerInRound, does GetRoundStartTime return null ExpectedMiningTime causing crashes in time comparisons? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [CheckRoundTimeSlots + GetMiningInterval] [Validation Bypass] CheckRoundTimeSlots validates intervals but GetMiningInterval only uses first two miners - can inconsistent intervals pass validation but break downstream logic? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [TryToDetectEvilMiners + GetMiningOrder] [Punishment Bypass] If GetMiningOrder returns int.MaxValue for detected evil miners, can they avoid order-based restrictions despite being marked as evil? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [NeedToChangeTerm + IsTimeToChangeTerm] [Time Synchronization] If nodes have different blockchainStartTimestamp values, can they disagree on whether term change is needed, forking the chain? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [GetExtraBlockMiningTime + GetMiningInterval] [Time Collision] If GetMiningInterval returns 0 or very small value, can extra block time collide with next round's start time? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Multiple Functions] [Dictionary Key Format] If RealTimeMinersInformation keys aren't consistently formatted (hex case, padding), can lookup failures cause silent security bypasses? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [RoundId Property] [Consensus Fork] If attacker controls RoundIdForValidation and sets all ExpectedMiningTime to null, different nodes could have different RoundIdForValidation values, causing permanent chain fork? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [CheckRoundTimeSlots] [Sybil Attack] Attacker registers single miner to bypass time slot validation, then adds colluding miners who don't follow proper intervals, breaking fair mining schedule? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [IsTimeSlotPassed] [Time Warp Attack] In round 1, attacker as FirstMiner manipulates ActualMiningTimes to make all other miners' slots appear passed, allowing them to mine multiple blocks? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [CalculateSignature] [Preimage Attack] Colluding miners choose signatures such that XOR aggregate equals a target value, allowing them to predict future round signatures and game consensus? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [NeedToChangeTerm + IsTimeToChangeTerm] [Term Lock] Attacker prevents miners from reaching MinersCountOfConsent threshold by DoSing mining or manipulating timestamps, locking blockchain in current term indefinitely? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [GetCheckableRound] [Hash Manipulation] Attacker exploits cleared fields to submit two rounds with different EncryptedPieces but same hash, causing consensus confusion about round state? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Multiple Functions] [Dictionary Poisoning] Attacker adds miners with malformed data (null timestamps, negative counts, invalid orders) that pass initial validation but break during round progression? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [GetMiningInterval + IsTimeSlotPassed] [Precision Attack] Attacker exploits integer division precision loss in IsTimeSlotPassed to mine during other miners' slots by manipulating interval calculations? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [FirstMiner + FirstActualMiner] [Leader Election Manipulation] Attacker races to set OutValue first to become FirstActualMiner despite being late in Order, gaining authority over round initialization? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [TryToDetectEvilMiners] [Selective Enforcement] Attacker operates multiple evil miners just below threshold individually, but combined they degrade network significantly without triggering detection? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [RoundId Property] [Empty Dictionary] If RealTimeMinersInformation is empty, does RealTimeMinersInformation.Values.All return true, causing Sum of empty set and returning 0 as RoundId? (Medium)"
]