[
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [Authorization Bypass] Can the ConfigurationController SingletonState be left uninitialized, allowing any caller to set configurations before proper authorization is established, bypassing governance controls? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [Access Control] Can the ConfigurationController be overwritten after initialization without proper multi-sig approval, allowing a single compromised admin to hijack all configuration authority? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [State Corruption] Can the ConfigurationController AuthorityInfo be set to a zero address or invalid contract address, permanently locking configuration updates? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [Governance Attack] Can an attacker front-run the ConfigurationController initialization with a malicious AuthorityInfo, gaining permanent control over system configurations? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [Privilege Escalation] Can the ConfigurationController be changed to point to a contract that the attacker controls, bypassing organization-based governance? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [DoS] Can the ConfigurationController be set to a non-existent or self-destructed contract address, permanently disabling all configuration changes? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [Race Condition] Can concurrent calls to change ConfigurationController result in inconsistent state where different callers see different controllers during transition? (Medium)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [Organization Validity] Can the ConfigurationController reference an organization that was later dissolved or had its members removed, breaking governance? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [Circular Dependency] Can the ConfigurationController create a circular reference where the controller contract itself depends on configurations it controls, causing deadlock? (Medium)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: ConfigurationController] [Immutability Violation] Can the SingletonState implementation allow multiple writes to ConfigurationController in the same transaction, violating singleton semantics? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [Authorization Bypass] Can the MethodFeeController be uninitialized at deployment, allowing anyone to set method fees before governance is established? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [Economic Attack] Can an attacker who controls MethodFeeController set prohibitively high fees for critical system methods, effectively DoS-ing the entire chain? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [Fee Manipulation] Can the MethodFeeController be changed to a malicious contract that sets zero fees for expensive operations, enabling spam attacks? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [State Corruption] Can the MethodFeeController AuthorityInfo be corrupted with mismatched ContractAddress and OwnerAddress, breaking fee updates? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [Privilege Escalation] Can the MethodFeeController be transferred to an attacker-controlled organization, allowing them to extract rent from all contract users? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [DoS] Can the MethodFeeController be set to an address that always reverts, permanently freezing all fee updates and locking the current fee structure? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [Cross-Contract Attack] Can the MethodFeeController reference a malicious contract that drains fees to attacker addresses instead of proper distribution? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [Initialization Race] Can multiple initialization attempts for MethodFeeController result in the last caller winning, bypassing intended default authority? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [Governance Bypass] Can MethodFeeController be changed without going through the proper proposal and voting process if checks are missing in the setter? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: MethodFeeController] [Token Whitelist Bypass] Can the MethodFeeController set fees in non-whitelisted or malicious tokens, causing accounting errors or enabling fee evasion? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: TransactionFees] [Fee Evasion] Can the TransactionFees mapping be left unpopulated for critical methods, allowing attackers to call expensive operations for free? (Critical)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: TransactionFees] [Key Collision] Can similar method names or hash collisions in the TransactionFees mapping cause fee misattribution between different methods? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: TransactionFees] [Overflow/Underflow] Can the MethodFees stored in TransactionFees mapping contain negative or overflowed values, causing incorrect fee calculation? (High)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: TransactionFees] [Stale Data] Can the TransactionFees mapping retain outdated fee structures after token prices change dramatically, causing economic imbalance? (Medium)",
  "[File: contract/AElf.Contracts.Configuration/ConfigurationState.cs] [State: TransactionFees] [DoS via Storage] Can an attacker populate the TransactionFees mapping with millions of entries, causing excessive storage costs and lookup delays? (Medium)"
]