[
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: RemoveBeneficiary()] [User Fund Loss] If RemoveBeneficiary is called on a user who registered via RegisterForProfits, their locked tokens remain locked but they lose beneficiary status. Can they still withdraw? Is this a fund-locking vulnerability? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: RemoveBeneficiary()] [Reentrancy] Between RemoveBeneficiary at line 80 and AddBeneficiary at line 87, can malicious ProfitContract re-enter and cause double removal or state corruption? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: RemoveBeneficiary()] [Input Validation] Does the function validate input.Beneficiary is not null or zero address? Can removing zero address cause unexpected behavior? (Low)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: RemoveBeneficiary()] [Atomicity] If RemoveBeneficiary at line 80 succeeds but AddBeneficiary at line 87 fails, shares are permanently lost. Is there transaction rollback to prevent partial execution? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: RemoveBeneficiary()] [Integer Arithmetic] Line 93 performs lockedAmount.Sub(input.Amount). Does Sub() method properly handle edge cases like equal values, or can it cause unexpected results? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [Authorization Bypass] Line 102 calls GetValidScheme with input.SchemeManager but Context.Sender contributes the tokens. Can attacker contribute to any scheme without being the manager, potentially triggering unwanted auto-distributions? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [Accounting Error] Lines 107-113 use TransferFrom to pull tokens from Context.Sender. If Sender hasn't approved TokenHolderContract, transaction fails but GetValidScheme already executed. Can repeated failures cause state inconsistency? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [Double Approval] Lines 115-120 approve ProfitContract to spend input.Amount. If ContributeProfits is called multiple times, do approvals accumulate? Can this lead to ProfitContract having excessive approval beyond intended amounts? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [Cross-Contract Risk] Line 122 calls ProfitContract.ContributeProfits. If ProfitContract is compromised, can it drain approved tokens without actually distributing profits to beneficiaries? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [Input Validation] Does the function validate input.Amount is positive and not zero? Can contributing zero amounts cause logic errors or waste gas? (Low)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [Symbol Mismatch] No validation that input.Symbol matches scheme.Symbol. Can contributing wrong token symbol cause funds to be locked in ProfitContract but never distributed to beneficiaries? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [Reentrancy] Between TransferFrom at line 107, Approve at line 115, and ContributeProfits at line 122, can malicious token contract or ProfitContract re-enter and manipulate state? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [DOS Attack] Can attacker repeatedly contribute tiny amounts to trigger excessive state updates and gas consumption, effectively DOSing the profit distribution mechanism? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [Approval Race] If multiple ContributeProfits calls happen concurrently, can the Approve at line 115 create race conditions where ProfitContract has inconsistent approval amounts? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ContributeProfits()] [Fund Loss] If ProfitContract.ContributeProfits fails after tokens are transferred and approved, are tokens permanently locked in TokenHolderContract with no recovery mechanism? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [Authorization Bypass] Line 134 only checks if sender is TokenContract OR scheme manager. Can TokenContract be manipulated to call DistributeProfits on behalf of attackers, bypassing manager authorization? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [State Race Condition] Line 144 increments scheme.Period after distribution. If DistributeProfits is called multiple times concurrently, can Period be incremented incorrectly causing profit calculation errors? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [Logic Bug] Line 133 calls GetValidScheme with updateSchemePeriod=true, which updates period in UpdateTokenHolderProfitScheme. But then line 144 also updates period. Is period being double-incremented? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [Accounting Error] Lines 138-139 create DistributeProfitsInput with scheme.Period. If period is incremented at line 144 but distribution uses old period, can profits be attributed to wrong period causing double-claims? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [Input Validation] Line 141 checks if AmountsMap exists and is non-empty, but doesn't validate amounts are positive. Can distributing zero or negative amounts cause accounting errors? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [DOS Attack] Can malicious scheme manager repeatedly call DistributeProfits with empty AmountsMap, infinitely incrementing period without distributing anything, breaking profit claiming logic? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [Front-Running] Can scheme manager front-run user ClaimProfits by calling DistributeProfits to increment period, causing user's claim to target wrong period and fail? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [Period Overflow] Line 144 uses scheme.Period.Add(1). If period reaches Int64.MaxValue, will Add cause overflow or throw exception, permanently freezing distributions? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [State Corruption] Line 145 saves updated scheme back to state. If ProfitContract.DistributeProfits at line 143 fails, is scheme.Period still incremented, causing permanent desync with ProfitContract? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: DistributeProfits()] [Authorization Logic] Why is TokenContract allowed to call DistributeProfits at line 134? Can this be exploited if TokenContract has vulnerabilities or is upgradeable? (High)"
]