[
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Authorization Bypass] Can an attacker create multiple organizations with the same address by providing identical CreateOrganizationInput but different CreationToken values, potentially bypassing the duplicate organization check at line 84? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [State Manipulation] Does the check 'State.Organizations[organizationAddress] == null' at line 84 properly prevent organization re-creation if an attacker first creates then somehow removes an organization from state? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Validation Bypass] Can an attacker bypass the Validate(organization) check at line 83 by crafting ProposalReleaseThreshold values that pass validation but create exploitable voting scenarios? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [DoS Attack] Can an attacker spam organization creation to exhaust state storage, given that line 84-91 doesn't have any rate limiting or cost mechanism beyond transaction fees? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Integer Overflow] In the organization validation logic, can MinimalVoteThreshold, MinimalApprovalThreshold, MaximalAbstentionThreshold, or MaximalRejectionThreshold values cause integer overflow when compared against organizationMemberCount? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Logic Error] Can an organization be created with ProposerWhiteList containing addresses not in OrganizationMemberList, allowing non-members to propose but never reach approval threshold? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Address Collision] Can two different CreateOrganizationInput values with different CreationTokens produce the same organizationAddress via CalculateOrganizationHashAddressPair, causing state overwrites? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganization()] [Validation Bypass] Can an attacker create an organization with empty or minimal ProposerWhiteList/OrganizationMemberList that technically passes validation but creates unusable governance? (Low)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganizationBySystemContract()] [Authorization Bypass] Can a non-system contract impersonate a system contract address to bypass the authorization check at line 98-99 and create privileged organizations? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganizationBySystemContract()] [Callback Manipulation] Can an attacker exploit the SendInline callback at line 102 to re-enter CreateOrganizationBySystemContract or manipulate the calling system contract's state? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganizationBySystemContract()] [DoS Attack] Can a malicious system contract provide an invalid OrganizationAddressFeedbackMethod at line 101-102 causing SendInline to fail and blocking organization creation? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateOrganizationBySystemContract()] [Authorization Bypass] Does Context.GetSystemContractNameToAddressMapping() at line 98 properly validate all system contracts, or can newly added/modified system contracts bypass intended restrictions? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposal()] [Authorization Bypass] Can an attacker bypass the AssertIsAuthorizedProposer check at line 109 by exploiting race conditions in ProposerWhiteList modifications? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposal()] [Proposal Collision] Can an attacker predict or force proposal ID collisions via GenerateProposalId to overwrite existing proposals, bypassing the check at line 163? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposal()] [DoS Attack] Can an attacker create proposals with extremely long Title (255 chars), Description (10200 chars), or ProposalDescriptionUrl (255 chars) at maximum allowed length to cause state bloat? (Low)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposal()] [Time Manipulation] Can an attacker create proposals with ExpiredTime far in the future to permanently lock proposal storage, since cleanup requires expiry at line 286? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposal()] [Validation Bypass] Can an attacker create a proposal with null or invalid ToAddress/ContractMethodName that passes initial validation but fails during Release execution? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposalBySystemContract()] [Authorization Bypass] Can a system contract create proposals on behalf of any OriginProposer without proper authorization checks beyond line 118? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposalBySystemContract()] [Proposer Impersonation] At line 118, can a malicious system contract specify any arbitrary OriginProposer address to bypass whitelist restrictions and create unauthorized proposals? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: CreateProposalBySystemContract()] [State Inconsistency] Does line 119 properly set the Proposer field in the created proposal, or does it use Context.Sender (system contract) instead of OriginProposer, breaking release authorization? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [Double Voting] Can an attacker vote multiple times by exploiting race conditions between AssertProposalNotYetVotedBySender check at line 126 and vote recording at line 130? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [Authorization Bypass] Can a non-member temporarily gain membership, vote, then lose membership while their vote remains counted in threshold calculations? (High)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [State Manipulation] After voting at line 130, can an attacker remove themselves from OrganizationMemberList but keep their vote counted in IsReleaseThresholdReached calculations? (Critical)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [Proposal Expiry] Does GetValidProposal at line 125 properly check expiry before allowing votes, or can votes be cast on expired proposals that haven't been cleared? (Medium)",
  "[File: contract/AElf.Contracts.Association/Association.cs] [Function: Approve()] [DoS Attack] Can an attacker vote on proposals immediately before expiry to prevent the original proposer from releasing, since only the proposer can release at line 186? (Medium)"
]