[
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: TransactionFees] [Enumeration DOS] If the implementation provides a method to enumerate all TransactionFees entries, can an attacker add thousands of fee mappings to cause out-of-gas errors when users try to list or validate fee structures? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: Contract References] [Reference Leakage] If getter methods expose internal contract reference addresses without access control, can attackers analyze the references to discover vulnerabilities in TokenContract, ElectionContract, or other dependent contracts? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [Cross-State: All Contract References] [Reference Consistency Attack] If contract references (TokenContract, TokenConverterContract, ElectionContract, ProfitContract, ParliamentContract, ZeroContract) can be set independently, can an attacker create inconsistent state where references point to incompatible contract versions, breaking economic flows? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: MethodFeeController + ParliamentContract] [Governance Deadlock] If MethodFeeController requires ParliamentContract approval but ParliamentContract reference is incorrect or points to a non-functional contract, can the system enter deadlock where fees cannot be updated and governance is frozen? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: TransactionFees] [Fee Token Symbol Confusion] If MethodFees stored in TransactionFees contains fee amounts without explicit token symbol validation, can an attacker exploit symbol confusion attacks, paying fees in worthless tokens instead of the required native token? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: MethodFeeController (AuthorityInfo)] [Multi-Sig Threshold Bypass] If MethodFeeController stores an AuthorityInfo with organization address but doesn't validate the organization's signature threshold, can an attacker create a 1-of-N organization where they control 1 key and bypass intended multi-sig governance? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: Initialized] [Double Initialization Race] If multiple initialization transactions are submitted simultaneously before Initialized is set to true, can the contract be initialized multiple times with different parameters, causing state inconsistency or overwriting critical references? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: All States] [Zero Address Injection] If any contract reference state (TokenContract, ElectionContract, ProfitContract, etc.) allows zero/null address without validation, will calls to those references silently fail or return default values, breaking economic operations? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: TransactionFees] [Negative Fee Exploit] If MethodFees in TransactionFees mappings can be set to negative values without validation, can an attacker configure methods to pay users instead of charging fees, draining the contract's token balance? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: MethodFeeController] [Self-Referential Authority] If MethodFeeController can be set to point to the Economic contract itself as the authority, creating a circular authorization reference, can this enable unauthorized fee updates or cause infinite recursion? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: TransactionFees Entry Deletion] [Fee Deletion DOS] If TransactionFees entries can be deleted without replacement, can an attacker remove fee configurations for critical methods, causing those methods to fail when they try to calculate or charge fees? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractState.cs] [State: MethodFeeController Deletion] [Authority Removal Attack] If MethodFeeController can be set to null/empty AuthorityInfo, does this disable all fee governance, freezing the fee structure permanently or enabling anyone to modify fees? (Critical)"
]