[
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: Donate()] [Approval Manipulation] Approve is called for the full donation amount before ContributeProfits - if ContributeProfits fails or uses less than approved, does the excess approval remain, creating security risk for future transactions? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: Donate()] [Integration Risk] If TokenConverter.IsSymbolAbleToSell changes state between the check and ConvertToNativeToken call, can an attacker donate a token that becomes unconvertible, locking funds in the Treasury? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: Donate()] [Event Manipulation] DonationReceived event is only fired when NOT converting - does this mean converted donations aren't logged, breaking external monitoring and transparency? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: Donate()] [Precision Loss] When converting non-native tokens to native tokens via TokenConverter, can slippage or rounding cause significant value loss that isn't tracked or compensated? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: DonateAll()] [Reentrancy] DonateAll queries balance then calls Donate with that amount - can an attacker exploit reentrancy during GetBalance or Donate to change the balance mid-execution, causing over-donation or under-donation? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: DonateAll()] [Race Condition] If multiple transactions modify the sender's balance between GetBalance call and actual transfer in Donate, can the transfer fail or transfer an incorrect amount? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: DonateAll()] [Authorization] Since DonateAll is public and uses Context.Sender's balance, can an attacker call this to force-donate another user's full balance if they have approval? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: ConvertToNativeToken()] [Reentrancy Critical] The function calls Approve, then Sell, then SendInline to DonateAll - can an attacker exploit reentrancy during Sell to call ConvertToNativeToken again, creating infinite recursion or double-spending? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: ConvertToNativeToken()] [Slippage Attack] Sell is called without any slippage protection - can an attacker front-run the donation with a large trade to get unfavorable conversion rate, extracting value from the treasury? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: ConvertToNativeToken()] [State Inconsistency] If Sell succeeds but SendInline to DonateAll fails, the tokens are converted but not donated - are they lost, or can an attacker claim them? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: ConvertToNativeToken()] [Approval Leak] Full amount is approved to TokenConverter - if Sell fails or uses partial amount, does excess approval persist, allowing TokenConverter to drain Treasury funds later? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetDividendPoolWeightSetting()] [Authorization] Only TreasuryController can call this, but if GetDefaultTreasuryController returns attacker-controlled address (during initialization race), can attacker set malicious weights permanently? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetDividendPoolWeightSetting()] [Integer Overflow] Weights are int type - can extremely large weights cause overflow in proportion calculations in GetDividendPoolWeightProportion, breaking reward distribution math? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetDividendPoolWeightSetting()] [Accounting Error] ResetSubSchemeToTreasury removes old weights and adds new ones - if RemoveSubScheme succeeds but AddSubScheme fails, will the scheme be permanently disconnected from Treasury, losing all future rewards? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetDividendPoolWeightSetting()] [DOS Attack] Can an attacker repeatedly call this function (if they control TreasuryController) to constantly remove and re-add schemes, disrupting ongoing distributions and causing gas exhaustion? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetDividendPoolWeightSetting()] [Validation Bypass] The function only checks that weights > 0, but doesn't verify maximum bounds - can extremely high weights cause disproportionate distributions that drain the treasury to one scheme? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetMinerRewardWeightSetting()] [State Corruption] Similar to SetDividendPoolWeightSetting - if ResetSubSchemeToMinerReward partially fails, can MinerReward scheme end up with missing or duplicate sub-schemes, breaking miner reward distribution? (Critical)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetMinerRewardWeightSetting()] [Timing Attack] If weights are changed between Release calls, miners who already contributed to a period might receive rewards based on new weights, either benefiting or losing unfairly? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: ResetWeight()] [Logic Error] If oldWeight == newWeight, the function returns early - but what if the scheme was manually removed externally? Should the function still re-add it to ensure consistency? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: ResetWeight()] [Edge Case] If oldWeight is 0 (not registered), RemoveSubScheme is skipped - but can AddSubScheme fail if the scheme is somehow already registered, causing silent failure? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: ResetSubSchemeToTreasury()] [Race Condition] If two SetDividendPoolWeightSetting calls race, can they both read the same old weights, causing both to remove the schemes twice (failing on second removal) or add twice (duplicate shares)? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetSymbolList()] [Authorization Bypass] AssertPerformedByTreasuryController is called, but if State.TreasuryController.Value is null, it falls back to GetDefaultTreasuryController - can this be exploited during initialization? (High)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetSymbolList()] [Validation Gap] The function checks IsTokenAvailableForMethodFee OR IsInWhiteList, but doesn't verify token actually exists or has supply - can attacker add non-existent tokens that break GetUndistributedDividends? (Medium)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetSymbolList()] [Logic Flaw] The assertion prevents tokens that can be sold via TokenConverter, but what if a token becomes sellable AFTER being added to symbol list - will it cause issues in future operations? (Low)",
  "[File: contract/AElf.Contracts.Treasury/TreasuryContract.cs] [Function: SetSymbolList()] [DOS Risk] If symbol list grows very large, will GetUndistributedDividends (which iterates all symbols) hit gas limits, making treasury balance unqueryable? (Medium)"
]