[
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenPrefix] [Case Sensitivity] Is the prefix 'nt' case-sensitive? Could attackers create tokens with symbols 'NT', 'Nt', 'nT' to impersonate native token connectors and steal funds from confused users? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenToResourceBalance] [Balance Discrepancy] The value 10_000_000_00000000 (10 million tokens) is 10x larger than NativeTokenConnectorInitialVirtualBalance. Does this asymmetry in paired connectors create arbitrage opportunities in the Bancor pricing between native-to-resource and resource-to-native swaps? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenToResourceBalance] [Liquidity Risk] With 10 million native tokens allocated per resource connector but actual issued supply potentially much larger, could this create liquidity fragmentation where trading certain resource pairs becomes impossible due to insufficient connector reserves? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenToResourceBalance] [Price Discovery] Is the 10_000_000_00000000 balance properly calibrated to establish fair initial pricing between native tokens and resource tokens, or could this value cause immediate mispricing exploitable by MEV bots? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ElectionTokenSymbol] [Symbol Squatting] The hardcoded 'VOTE' symbol could conflict with existing tokens on the chain. Does CreateElectionTokens() check if 'VOTE' is already registered, or would initialization fail catastrophically if the symbol is taken? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ElectionTokenSymbol] [Governance Attack] Since 'VOTE' tokens are issued entirely to ElectionContract at initialization, could an attacker who compromises ElectionContract gain control over 1 billion VOTE tokens and manipulate all election outcomes? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ElectionTokenSymbol] [String Validation] The symbol 'VOTE' lacks validation for length, special characters, or reserved keywords. Could malicious deployment parameters override this to inject symbols that break token transfer logic? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ShareTokenSymbol] [Dual Token Confusion] With both 'VOTE' and 'SHARE' tokens issued at identical supply (1 billion) and decimals (8), could users confuse these tokens leading to sending SHARE tokens to VOTE-only addresses and vice versa, causing permanent loss? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ShareTokenSymbol] [Purpose Ambiguity] The constant defines 'SHARE' but lacks documentation on its purpose. Could this token be exploited for unintended use cases, or is there insufficient separation between SHARE and VOTE token permissions? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ElectionTokenTotalSupply] [Supply Concentration] The entire 1_000_000_000_00000000 supply (1 billion tokens) of both VOTE and SHARE is issued immediately to ElectionContract. Does this create a centralization risk where ElectionContract becomes a single point of failure controlling all voting power? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ElectionTokenTotalSupply] [Inflation Risk] Is 1 billion election tokens sufficient for long-term network growth, or could this fixed supply create deflation as more validators join, forcing later hard forks to increase supply? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ElectionTokenTotalSupply] [Distribution Control] Since CreateElectionTokens() issues all 1 billion tokens to ElectionContract without vesting or distribution schedules, could early exploits of ElectionContract allow attackers to dump the entire supply and crash voting token value? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ElectionTokenDecimals] [Consistency] All tokens (resource, election, native) use 8 decimals. While consistent, could this create issues if future tokens need different precision for voting weights, share calculations, or fee divisions? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ElectionTokenDecimals] [Voting Precision] With 8 decimals, the minimum voting unit is 0.00000001 tokens. Could this enable voting manipulation through dust voting or rounding exploits in vote weight calculations? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: MemoMaxLength] [Validation Bypass] The 64-byte limit is checked in AssertValidMemo() using UTF-8 byte count. Could attackers bypass this by using multi-byte UTF-8 characters to inject more semantic content while staying under 64 bytes? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: MemoMaxLength] [DoS Vector] If memo validation is missing in some code paths that use economic contract methods, could attackers send extremely long memos that bypass the 64-byte check and cause gas exhaustion or storage bloat? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: MemoMaxLength] [Encoding Issues] Does the 64-byte limit properly account for all UTF-8 encoding edge cases, or could certain character sequences cause the byte count to be miscalculated, allowing longer memos through? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: PayTxFeeSymbolListName] [List Injection] The string 'SymbolListToPayTxFee' is used to retrieve context variables. Could an attacker who controls chain variables inject malicious symbols into this list, creating fake resource tokens that bypass fee validation? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: PayTxFeeSymbolListName] [Empty List Risk] If Context.Variables.GetStringArray('SymbolListToPayTxFee') returns empty or null during CreateResourceTokens(), would initialization silently succeed without creating fee payment tokens, breaking the entire fee payment system? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: PayTxFeeSymbolListName] [Symbol Duplication] If the same symbol appears in both PayTxFeeSymbolListName and PayRentalSymbolListName lists, does CreateResourceTokens() attempt to create the token twice causing initialization failure? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: PayRentalSymbolListName] [Rental Bypass] Could an attacker modify the 'SymbolListToPayRental' context variable to exclude certain resource tokens, allowing them to use resources without paying rental fees? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: PayRentalSymbolListName] [List Manipulation] Is there validation that PayRentalSymbolListName returns valid, non-empty symbol strings? Could injection of empty strings, special characters, or excessively long symbols break connector creation? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: ResourceTokenTotalSupply + ResourceTokenInitialVirtualBalance] [Economic Imbalance] The ratio between actual supply (500M) and virtual balance (0.001) is 5x10^14. Does this extreme ratio create Bancor formula edge cases where the price calculation fails mathematically or produces irrational results? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: NativeTokenConnectorInitialVirtualBalance + NativeTokenToResourceBalance] [Connector Asymmetry] The 10:1 ratio between these paired connector balances violates standard Bancor symmetric connector assumptions. Could this asymmetry be exploited for arbitrage by rapidly swapping between directions? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: ElectionTokenTotalSupply + ElectionTokenSymbol] [Governance Capture] With 1 billion VOTE tokens issued to ElectionContract at initialization, does the system have sufficient safeguards against ElectionContract bugs that could allow unauthorized VOTE token transfers to attackers? (Critical)"
]