[
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [IsMinerListJustChanged Stale] If IsMinerListJustChanged is set at line 14 but miner list actually changed earlier, can stale flag values propagate through multiple rounds, confusing miner transition logic? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [RealTimeMinersInformation Mutation] If external code mutates RealTimeMinersInformation between lines 16-17 and line 26, can the miners categorization become stale, causing wrong miners to be assigned orders? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [ProducedBlocks Gaming] Can a miner manipulate their ProducedBlocks value at line 34 to appear more productive than reality, gaining unfair rewards in downstream distribution logic? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [MissedTimeSlots Reset] Is there a maximum MissedTimeSlots value that triggers ejection, or can a miner accumulate infinite missed slots at line 54 without consequence, remaining in miner set indefinitely? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GetMinedMiners()] [Selective Mining] Can a miner strategically mine only in certain rounds to optimize their SupposedOrderOfNextRound at line 128, gaining favorable order positions while avoiding penalty accumulation? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [Zero Mining Interval] If GetMiningInterval returns 0 at line 20, do all ExpectedMiningTime values become identical at lines 33 and 50-51, causing all miners to mine simultaneously? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [Empty Miner List] If RealTimeMinersInformation is empty, does minersCount == 0 at line 18 cause divide-by-zero in GetAbsModulus at line 121? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: BreakContinuousMining()] [Same Miner All Positions] If all positions (first, second, last, last-but-one, extra block producer) resolve to the same miner, can the multiple swaps create circular dependencies that corrupt the round structure? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: CalculateNextExtraBlockProducerOrder()] [All Miners No Signature] If all miners produce blocks but none have signatures (all Signature == null), does line 113 return no results, making firstPlaceInfo null and defaulting to order 1? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [Maximum Miners] If minersCount approaches Int32.MaxValue, can the Enumerable.Range at line 41 allocate excessive memory, causing OOM and blockchain halt? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [Round Rollback] If GenerateNextRoundInformation is called multiple times for the same round (e.g., due to chain re-org), can this create duplicate nextRound objects with different states, splitting consensus? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [Time Slot Overlap] If miningInterval is very small at line 20, can consecutive ExpectedMiningTime values at lines 33 and 50-51 overlap within clock precision, causing two miners to mine simultaneously? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: BreakContinuousMining()] [Swap Verification] After swapping orders and timestamps, is there validation that the new arrangement still maintains chronological order, or can swaps create time inversions? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [BlockchainAge Manipulation] Can an attacker manipulate blockchainStartTimestamp or currentBlockTimestamp to produce a BlockchainAge at line 23 that triggers age-dependent consensus behaviors prematurely? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [IrreversibleBlock Regression] If ConfirmedIrreversibleBlockHeight at line 69 decreases from current round to next round, can this violate irreversibility guarantees and enable double-spend attacks? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: CalculateNextExtraBlockProducerOrder()] [Signature Grinding] Can the first miner at line 112-113 produce their block with many different signature values offline, choosing one that makes them or an ally the extra block producer? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: CalculateNextExtraBlockProducerOrder()] [Withholding Attack] Can miners withhold blocks if their signature would select an unfavorable extra block producer, waiting until a favorable signature appears? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: CalculateNextExtraBlockProducerOrder()] [Predictable Default] When firstPlaceInfo is null and order defaults to 1 at line 116, can miners exploit this predictability to target or avoid the first position strategically? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_Generation.cs] [Function: GenerateNextRoundInformation()] [FinalOrderOfNextRound Source] Where is FinalOrderOfNextRound set in current round, and can miners manipulate this field at line 28 to control their next round position? (High)"
]