[
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetManagingSchemeIds()] [Null Reference] If State.ManagingSchemeIds[input.Manager] returns null for a non-existent manager, can this cause downstream null reference exceptions when the returned CreatedSchemeIds is used without validation? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetManagingSchemeIds()] [Information Disclosure] Can an attacker enumerate all scheme IDs managed by arbitrary addresses to map governance relationships and identify high-value targets for social engineering attacks? (Low)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetManagingSchemeIds()] [Data Integrity] If input.Manager is the zero address (Address.FromPublicKey(new byte[33])), does this return invalid or corrupted scheme data that could mislead profit calculations? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetManagingSchemeIds()] [State Consistency] If a manager's scheme IDs are updated mid-query through a race condition with a state-modifying transaction, can this return stale or inconsistent CreatedSchemeIds? (Low)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetManagingSchemeIds()] [DoS] Can an attacker create a massive number of schemes for a single manager address, causing GetManagingSchemeIds to return an unbounded list that exhausts memory or processing limits? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetScheme()] [Null Reference] If State.SchemeInfos[input] returns null for a non-existent scheme hash, can subsequent code that consumes this Scheme object fail with null reference exceptions without proper validation? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetScheme()] [Hash Collision] If two different schemes somehow produce the same Hash input due to a weakness in the hash algorithm, can GetScheme return incorrect scheme data leading to profit miscalculation? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetScheme()] [Data Tampering] If the State.SchemeInfos mapping is corrupted or contains invalid Scheme objects, can GetScheme propagate poisoned data that causes profit distribution errors? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetScheme()] [Privacy Leak] Can an attacker query GetScheme with randomly generated hashes to discover private or internal schemes not meant to be publicly accessible? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetScheme()] [State Desync] If GetScheme is called during a scheme update transaction, can it return a Scheme object in an intermediate/inconsistent state with mismatched CurrentPeriod and other fields? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Virtual Address Collision] If input.Period == 0, GetSchemeAddress returns Context.ConvertVirtualAddressToContractAddress(input.SchemeId). Can two different schemeIds produce the same virtual address due to hash collisions in ConvertVirtualAddressToContractAddress? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Virtual Address Collision] When input.Period != 0, GetSchemeAddress calls GetDistributedPeriodProfitsVirtualAddress. Can the XOR-based hash in GeneratePeriodVirtualAddressFromHash (line 59) produce colliding addresses for different (schemeId, period) pairs? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Integer Overflow] If input.Period is set to Int64.MaxValue or a negative value, can GetSchemeAddress derive an invalid virtual address that points to unintended accounts? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Zero Period Bypass] The special case 'input.Period == 0' returns the general ledger address. Can an attacker exploit this by claiming profits from period 0 to drain the general ledger instead of period-specific accounts? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Address Prediction] Can an attacker precompute GetDistributedPeriodProfitsVirtualAddress for future periods and send tokens directly to those addresses to manipulate profit distributions? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetSchemeAddress()] [Null Input] If input.SchemeId is null or Hash.Empty, does GetSchemeAddress return a valid but meaningless address that could be mistakenly used in profit operations? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [Default Value Ambiguity] When State.DistributedProfitsMap[releasedProfitsVirtualAddress] is null, GetDistributedProfitsInfo returns a new DistributedProfitsInfo with TotalShares = -1. Can downstream code misinterpret -1 as a valid share count and perform incorrect division operations? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [Sentinel Value Confusion] The TotalShares = -1 sentinel (line 42) indicates non-existence. Can an attacker create a scheme with exactly -1 total shares to bypass existence checks elsewhere in the system? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [Virtual Address Derivation] GetDistributedProfitsInfo calls GetDistributedPeriodProfitsVirtualAddress (line 39). If this address calculation is manipulable via period selection, can an attacker query profits from unauthorized periods? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [Null Coalescing Logic] The ?? operator on line 40 returns a new object when null. Can this mask genuine data corruption where DistributedProfitsInfo should exist but was deleted? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetDistributedProfitsInfo()] [Period Bounds] If input.Period is negative, zero, or exceeds the scheme's CurrentPeriod, does GetDistributedProfitsInfo return misleading data instead of throwing an error? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetProfitDetails()] [Null Reference] State.ProfitDetailsMap[input.SchemeId][input.Beneficiary] has no null check. If either key doesn't exist, does this throw an exception or return null that causes downstream failures? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetProfitDetails()] [Double Indexing] The nested dictionary access [input.SchemeId][input.Beneficiary] on line 48 can fail if SchemeId exists but Beneficiary doesn't. Is there inconsistent null handling between the two levels? (High)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetProfitDetails()] [Privacy Leak] Can any caller query GetProfitDetails for arbitrary (SchemeId, Beneficiary) pairs to discover other users' profit allocations and investment patterns? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ViewMethods.cs] [Function: GetProfitDetails()] [Zero Address] If input.Beneficiary is the zero address, does GetProfitDetails return a valid ProfitDetails object that could be confused with legitimate system accounts? (Medium)"
]