[
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [All Properties] [Upgrade Safety] If MultiToken contract is upgraded and the new version expects different interfaces from the referenced contracts (Parliament, Association, Referendum, etc.), but the contract references still point to old contract versions, can method calls fail due to interface mismatches, breaking authorization and fee systems without obvious errors? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: ParliamentContract] [Sender Spoofing] In AssertSenderAddressWith(GetDefaultParliamentController().OwnerAddress) used by ChangeTransferBlackListController, if the ParliamentContract reference can be manipulated to return Context.Sender as the organization address, can the attacker bypass the sender assertion and modify the transfer blacklist controller to their own address? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [All Properties] [Re-initialization] If InitializeAuthorizedController can be called multiple times and contract references are re-initialized with different addresses each time, can an attacker call this repeatedly to override legitimate controller organizations with their own, gradually taking control of all fee and governance parameters? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: ParliamentContract] [Name Resolution Manipulation] Since ParliamentContract.Value is set via Context.GetContractAddressByName(SmartContractConstants.ParliamentContractSystemName), if an attacker can manipulate the Genesis contract's name registry mapping for 'AElf.ContractNames.Parliament', can they cause all parliament-related operations to interact with a malicious contract instead? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: AssociationContract] [Name Resolution Manipulation] If SmartContractConstants.AssociationContractSystemName can be tampered with or if GetContractAddressByName has vulnerabilities, can an attacker cause MultiToken to reference a fake AssociationContract that creates organizations with no authorization requirements, breaking all multi-sig security? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: ReferendumContract] [Name Resolution Manipulation] If the contract name constant for ReferendumContract is compromised or name resolution fails, can the UserFeeController initialization create an invalid referendum controller that can never execute proposals, permanently freezing the ability to change user fee parameters? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: ConfigurationContract] [Name Resolution Manipulation] If ConfigurationContract name resolution is manipulated during lazy initialization in GetActualFee, can an attacker point it to a contract that returns malicious fee configurations, enabling selective fee bypass for specific contracts while maintaining normal fees for others to avoid detection? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [All Properties] [Value Property Manipulation] Since contract references are accessed via State.ContractName.Value property, if the underlying .Value setter is not properly protected and can be modified through reflection or state manipulation, can an attacker directly overwrite contract reference addresses without going through proper initialization, bypassing all validation logic? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [All Properties] [Internal Access Abuse] Since all properties are marked 'internal' and visible to the entire AElf.Contracts.MultiToken assembly, if there are test utilities, helper classes, or other types within the same assembly that can be invoked through transaction calls, can an attacker use these to directly modify contract references without proper authorization checks? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: ParliamentContract] [Container Manipulation] Since ParliamentContract is of type ParliamentContractContainer.ParliamentContractReferenceState, if the container type definition can be manipulated or if there are vulnerabilities in how containers resolve contract addresses, can this allow redirecting all parliament contract calls to attacker-controlled addresses? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: AssociationContract] [Container Manipulation] If AssociationContractContainer.AssociationContractReferenceState has mutable state or configuration that can be modified after initialization, can an attacker change the target contract address for association operations mid-execution, causing organization creation and voting to interact with different contracts than intended? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: ConfigurationContract] [Null Dereference] In GetActualFee, if State.ConfigurationContract.Value is null and GetConfiguration.Call is invoked, does this cause a null reference exception that can be exploited for DOS of user contract fee charging, allowing transactions to proceed without proper fee validation? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: DividendPoolContract] [Null Dereference] If DividendPoolContract.Value is never initialized and dividend-related operations attempt to call methods on it, can this cause transaction failures that lock dividend funds in the MultiToken contract permanently, creating a fund loss vulnerability? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Properties: AssociationContract, ReferendumContract] [System Contract Privilege] Since CreateOrganizationBySystemContract methods are used with these references to bypass normal creation restrictions, if the contract references don't properly validate that the caller is a system contract, can user contracts create privileged organizations with system-level authority? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [All Properties] [Front-Running] If contract reference initialization happens lazily (e.g., checking 'if State.ParliamentContract.Value == null'), can an attacker monitor mempool for the first transaction that triggers initialization and front-run it with a malicious transaction that initializes the reference to their own address first? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Properties: ParliamentContract, AssociationContract, ReferendumContract] [Controller Replacement] After ChangeUserFeeController or ChangeDeveloperController is called, setting RootController to a new value, if the change validation uses compromised contract references for CheckOrganizationExist, can an attacker replace legitimate controllers with their own organizations, gaining permanent control over fee parameters? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: ParliamentContract] [Fee Symbol Manipulation] In ChangeSymbolsToPayTXSizeFeeController, if AssertControllerForSymbolToPayTxSizeFee uses State.SymbolToPayTxFeeController which defaults to GetDefaultSymbolToPayTxFeeController() returning parliament controller, and the ParliamentContract reference is compromised, can an attacker modify which tokens are accepted for transaction fees, potentially requiring users to pay in attacker-controlled tokens? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: ParliamentContract] [Blacklist Manipulation] In ChangeTransferBlackListController, the sender must be the default parliament controller owner address obtained through ParliamentContract reference. If this reference is compromised to return the attacker's address, can the attacker change the blacklist controller to their own organization, enabling them to blacklist arbitrary addresses and freeze their token transfers? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Properties: ParliamentContract, AssociationContract] [Authorization Inconsistency] If different methods use different contract references for authorization (e.g., some using State.ParliamentContract.GetDefaultOrganizationAddress, others using locally obtained parliamentContractAddress via GetContractAddressByName), can inconsistencies arise where authorization passes in one code path but fails in another, creating exploitable edge cases? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Properties: AssociationContract, ReferendumContract] [Threshold Edge Case] When organizations are created with MaximalRejectionThreshold = 0 and MaximalAbstentionThreshold = 0, if the contract references don't properly enforce these thresholds, can proposals be rejected or abstained despite the 0 maximums, creating deadlock situations where no proposals can pass? (Medium)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: ReferendumContract] [Token Symbol Manipulation] In GetReferendumControllerCreateInputForUserFee, the referendum organization is created with tokenSymbol = GetPrimaryTokenSymbol(). If an attacker can manipulate which symbol is considered primary before this initialization, can they create a referendum controller requiring votes in a token they control, enabling unauthorized fee changes? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: AssociationContract] [Member List Injection] When creating association organizations with OrganizationMemberList containing specific addresses, if the AssociationContract reference is compromised and allows manipulation of the member list during or after creation, can an attacker add themselves to controller organizations, gaining multi-sig approval power they shouldn't have? (Critical)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Properties: AssociationContract, ReferendumContract] [Address Mismatch] When organization addresses are calculated using CalculateOrganizationAddress before calling CreateOrganizationBySystemContract, if the actual created organization address differs from the calculated one due to contract reference manipulation, can controller AuthorityInfo point to non-existent organizations, breaking all governance? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [Property: AssociationContract] [Creator Validation Bypass] In GetDefaultSideChainRentalController, if State.SideChainCreator.Value is used to create the rental controller but this value is never properly validated or can be manipulated before controller creation, can an attacker set themselves as the side chain creator and gain control over rental fees? (High)",
  "[File: contract/AElf.Contracts.MultiToken/TokenContractReferenceState.cs] [All Properties] [Partial Class Vulnerability] Since this is a partial class 'public partial class TokenContractState', if there are other partial definitions of TokenContractState in the same namespace/assembly that add methods or properties with access to these internal contract references, can those definitions be exploited to bypass security checks and directly manipulate contract references? (Medium)"
]