[
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ContributeProfits()] [Released Period] Lines 698-699 assert period is not released. Can this check be bypassed if IsReleased is not set properly, allowing contribution after distribution? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ContributeProfits()] [Zero Period] When input.Period is 0 (lines 670-681), funds go to virtual address. Can this bypass period-based distribution logic, allowing immediate claim before intended distribution? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ContributeProfits()] [TransferFrom] Lines 673-680 and 704-710 use TransferFrom. Can this be exploited if attacker hasn't approved contract, causing transaction to fail but state updates to persist? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ContributeProfits()] [Amount Overflow] Line 701 adds input.Amount to existing AmountsMap value. Can this overflow if accumulated contributions exceed long.MaxValue? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ContributeProfits()] [Symbol Validation] Line 656 calls AssertTokenExists, but at lines 716-717, symbol is added to ReceivedTokenSymbols without re-validation. Can invalid tokens be tracked? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ContributeProfits()] [Virtual Address Direct] Comment at line 715 mentions direct virtual address contribution. Can external actors send tokens directly to scheme virtual addresses to bypass contribution tracking? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ContributeProfits()] [DistributedProfitsInfo Creation] Lines 691-694 create new DistributedProfitsInfo if null. Can this overwrite existing profit info if not checked carefully? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ResetManager()] [Authorization] Line 729 only checks if sender is current manager. Can a compromised manager transfer ownership to attacker address, permanently losing control? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ResetManager()] [New Manager Validation] Line 730 only checks if newManager is non-empty. Can manager be set to contract addresses or black hole addresses, making scheme unmanageable? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ResetManager()] [ManagingSchemeIds Update] Lines 733-738 update both old and new manager's scheme lists. If operation is interrupted between updates, can scheme tracking become inconsistent? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ResetManager()] [Null NewManagerSchemeIds] Line 736 handles null newManagerSchemeIds. Can this cause issues if new manager already manages schemes but state is corrupted? (Low)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [Beneficiary Override] Line 754 allows input.Beneficiary to override sender. Can anyone claim profits for any beneficiary, enabling front-running or grief attacks? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [Detail Limit] Lines 772-773 limit processing to ProfitReceivingLimitForEachTime (10). Can beneficiaries with >10 details be forced to call ClaimProfits multiple times, wasting gas? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [Period Limit] Line 774 calls GetMaximumPeriodCountForProfitableDetail to limit periods claimed. Can this prevent beneficiaries from claiming all owed profits, causing profit loss? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [LastProfitPeriod Initialization] Lines 780-782 set LastProfitPeriod to StartPeriod if 0. Can incorrect StartPeriod values cause beneficiaries to miss initial periods? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [Shares Removal] Lines 787-792 calculate sharesToRemove and subtract from TotalShares. If this calculation is wrong, can TotalShares become negative or incorrectly reduced? (Critical)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [CachedDelayTotalShares] Lines 793-797 subtract sharesToRemove from all cached values. Can this cause cached values to become negative or incorrect if removal timing is wrong? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [Detail Filtering] Lines 765-767 filter availableDetails with complex conditions. Can edge cases cause valid details to be excluded or invalid details included? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [State Update Order] Lines 799 and 806 update SchemeInfos and ProfitDetailsMap. If transaction reverts between these, can state become inconsistent? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [IsWeightRemoved Check] Line 789 checks !profitDetail.IsWeightRemoved. Can details with this flag still have shares counted incorrectly in sharesToRemove calculation? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ClaimProfits()] [Available vs Profitable] Lines 766 and 767 define availableDetails and profitableDetails differently. Can the distinction cause confusion leading to incorrect profit calculations? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [Period Loop] Lines 860-912 loop through periods from LastProfitPeriod to maxProfitPeriod. If this range is huge, can it cause gas exhaustion or transaction timeout? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [MaxProfitPeriod Calculation] Lines 857-859 calculate maxProfitPeriod with complex Min logic. Can integer overflow when adding maxProfitReceivingPeriodCount cause incorrect period bounds? (High)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [TotalShares Zero] Line 868 checks TotalShares == 0. If true, iteration continues without error. Can this cause silent profit loss for periods with 0 shares? (Medium)",
  "[File: contract/AElf.Contracts.Profit/ProfitContract.cs] [Function: ProfitAllPeriods()] [Precision Loss] Line 873 uses SafeCalculateProfits. Can cumulative precision loss over many periods cause significant profit loss or gain? (High)"
]