[
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenConnectorInitialVirtualBalance] [Economic Manipulation] Could the hardcoded virtual balance of 100_000_00000000 in connector initialization create a price manipulation vector where an attacker exploits the Bancor formula at launch to drain native tokens by purchasing resource tokens at artificially low prices before normal market discovery occurs? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenConnectorInitialVirtualBalance] [Integer Overflow] Does the virtual balance value of 100_000_00000000 (100,000 tokens with 8 decimals) risk overflow when multiplied with connector weights or other balance calculations in TokenConverter Bancor pricing formulas, potentially causing transaction reverts or incorrect price calculations? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenConnectorInitialVirtualBalance] [Economic Imbalance] Is the 100_000_00000000 virtual balance correctly calibrated against ResourceTokenInitialVirtualBalance and NativeTokenToResourceBalance to prevent arbitrage opportunities where attackers can exploit price discrepancies between connector pairs at initialization? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenConnectorInitialVirtualBalance] [Immutability Risk] Since this constant cannot be updated post-deployment, could incorrect initial calibration of 100_000_00000000 permanently break the economic model by making resource tokens too expensive or too cheap relative to native tokens, requiring chain halt or hard fork? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenConnectorInitialVirtualBalance] [Precision Loss] Does the 8-decimal precision in 100_000_00000000 cause precision loss in Bancor formula calculations when combined with weight=",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: TokenConverterFeeRate] [Fee Bypass] Could the hardcoded string fee rate '0.005' (0.5%) be bypassed by attackers who directly interact with TokenConverter internal functions rather than going through the economic contract's initialization path? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: TokenConverterFeeRate] [String Injection] Is the string literal '0.005' properly validated before being parsed into a decimal in TokenConverter.Initialize()? Could malicious deployment scripts inject '0.0005' or '0.5' causing either fee revenue loss or user exploitation? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: TokenConverterFeeRate] [Economic Denial] Does the 0.5% fee rate create economic incentives for attackers to perform large-volume wash trading or sandwich attacks on resource token swaps, where the low fee makes such attacks profitable despite the cost? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: TokenConverterFeeRate] [Fee Accumulation] Is there a mechanism to collect and distribute the 0.5% fees? If fees accumulate in TokenConverter without proper withdrawal, could this lock economic value and break the intended token circulation model? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: TokenConverterFeeRate] [Immutable Configuration] Since the fee rate '0.005' is hardcoded and set only during InitializeTokenConverterContract(), can this value ever be adjusted if market conditions require fee changes, or would the system be locked into a suboptimal fee structure permanently? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: TokenConverterFeeRate] [String Parsing] Could the string-to-decimal conversion of '0.005' in different runtime environments or cultures cause parsing errors (e.g., comma vs period as decimal separator) leading to initialization failure or incorrect fee application? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenTotalSupply] [Supply Inflation] Could the fixed supply of 500_000_000_00000000 per resource token (CPU, RAM, etc.) be insufficient for network growth, forcing later supply increases that would require governance proposals and potentially destabilize existing token economics? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenTotalSupply] [Initial Issuance] Since CreateResourceTokens() issues the entire ResourceTokenTotalSupply to TokenConverter at initialization, does this create a single point of failure where compromising TokenConverter gives an attacker control over 500 million tokens per resource type? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenTotalSupply] [Integer Boundaries] Is the value 500_000_000_00000000 (500 million tokens with 8 decimals = 50 quadrillion base units) safely within C# long type bounds (9.2 quintillion) considering multiplication operations in fee calculations or balance transfers? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenTotalSupply] [Economic Imbalance] With multiple resource tokens (CPU, RAM, DISK, NET) each having 500_000_000_00000000 supply, does this create economic imbalance if one resource type is more valuable than others, allowing attackers to arbitrage between resource token pairs? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenTotalSupply] [Burnable Risk] Since resource tokens are created with IsBurnable=true and full supply is issued to TokenConverter, could an attacker exploit TokenConverter vulnerabilities to burn large amounts of resource tokens, creating artificial scarcity and price manipulation? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenDecimals] [Precision Mismatch] If native token uses different decimals than ResourceTokenDecimals=8, could this create precision loss or overflow risks in TokenConverter swap calculations that convert between native and resource tokens? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenDecimals] [Rounding Exploitation] With 8 decimals, could attackers exploit rounding errors in resource token transfers or fee calculations by sending amounts like 0.00000001 to cause cumulative precision loss favoring the attacker over many transactions? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenDecimals] [Dust Attacks] Does the 8-decimal precision allow for dust attacks where attackers send minimal amounts (1 base unit = 0.00000001 tokens) to many addresses, bloating state storage or creating DoS conditions in token iteration logic? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenInitialVirtualBalance] [Price Manipulation] The drastically low virtual balance of 100_000 (only 0.001 tokens with 8 decimals) compared to NativeTokenConnectorInitialVirtualBalance creates extreme price sensitivity. Could an attacker front-run the first resource token purchase to extract maximum value from the initial steep price curve? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenInitialVirtualBalance] [Economic Attack] With virtual balance at 100_000 vs actual issued supply of 500_000_000_00000000, is there a massive price discontinuity that allows early purchasers to acquire resource tokens at 0.0000002% of their eventual equilibrium price? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenInitialVirtualBalance] [Decimal Mismatch] The value 100_000 appears to lack the 8-decimal suffix (should be 100_000_00000000?). Does this mean the virtual balance is only 0.001 tokens, creating an unintended extreme price curve at initialization? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenInitialVirtualBalance] [Connector Weight Imbalance] Combined with connector weight='0.005' (0.5%), does the tiny virtual balance of 100_000 create Bancor formula edge cases where price calculations overflow or underflow at extreme buy/sell volumes? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenPrefix] [Symbol Collision] The prefix 'nt' could collide with user-created tokens named 'ntCPU', 'ntRAM', etc. Does the system prevent users from creating tokens with the reserved 'nt' prefix, or could this cause confusion and economic exploits? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenPrefix] [String Concatenation] The Append() operation combining 'nt' + resourceTokenSymbol in connector creation lacks validation. Could empty or malicious resource token symbols create invalid connector symbols like 'nt' (standalone) or 'nt<script>' (injection)? (Medium)"
]