[
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Abstain()] [Quorum Manipulation] At line 106, AbstentionCount is incremented. Can an attacker use Abstain votes to artificially inflate total vote count (line 15-16 in IsReleaseThresholdReached) to meet MinimalVoteThreshold without providing meaningful approval? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: GetAllowance() in Referendum_Helper.cs] [Allowance Timing] At lines 144-150, GetAllowance reads current allowance from token contract. Between this read and TransferFrom execution, can allowance be revoked, causing TransferFrom to fail silently while vote counts increment? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: GetAllowance() in Referendum_Helper.cs] [Zero Allowance Check] Line 150 asserts allowance > 0, but can an attacker set allowance to exactly 1 wei to pass validation, then vote multiple times with minimal token commitment? (Low)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ReclaimVoteToken()] [Premature Unlock] At line 118-119, tokens can be reclaimed if proposal is null OR expired. Can an attacker delete a proposal via ClearProposal, then immediately reclaim tokens before proposal execution, invalidating votes? (Critical)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ReclaimVoteToken()] [DOS Attack] Anyone can call ReclaimVoteToken for any proposalId. Can an attacker front-run legitimate reclaims to cause assertion failures at line 78 in UnlockToken, permanently locking user tokens? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: UnlockToken() in Referendum_Helper.cs] [State Mismatch] Receipt is fetched using lockedAddress at line 77, but removed using Context.Sender at line 87. If lockedAddress ≠ Context.Sender, does this create orphaned receipts or allow token theft? (Critical)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: UnlockToken() in Referendum_Helper.cs] [Reentrancy] Transfer at line 79-86 is a cross-contract call. Can the recipient re-enter ReclaimVoteToken or other methods to unlock additional tokens or manipulate vote counts? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: UnlockToken() in Referendum_Helper.cs] [Insufficient Validation] Line 78 only checks receipt != null. Can an attacker reclaim tokens from a proposal they never voted on by exploiting state initialization bugs? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ReclaimVoteToken()] [Expired Proposal Exploitation] If a proposal expires but IsReleaseThresholdReached is true, can voters reclaim tokens before Release() is called, invalidating the vote quorum and preventing execution? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ChangeOrganizationThreshold()] [Unauthorized Modification] At line 126, Context.Sender is used as the organization address. Can only the organization itself call this function? What prevents external contracts from changing thresholds of arbitrary organizations? (Critical)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ChangeOrganizationThreshold()] [Retroactive Threshold Changes] After threshold is changed at line 128-130, does this affect existing active proposals? Can an attacker raise thresholds to prevent pending proposals from being released? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ChangeOrganizationThreshold()] [Validation Bypass] Validate() is called at line 129 after the threshold is updated. Can an attacker set invalid thresholds that pass Validate() but create impossible voting conditions (e.g., MinimalApprovalThreshold = MaxInt64)? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ChangeOrganizationThreshold()] [Event Emission Timing] OrganizationThresholdChanged event at line 131-135 is fired after state update. If the transaction reverts after firing, could this create event/state inconsistencies? (Low)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ChangeOrganizationProposerWhiteList()] [Whitelist Bypass] At lines 139-152, the organization address is Context.Sender. Can a malicious organization add arbitrary proposers to its whitelist, then use those proposers to create fraudulent proposals? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ChangeOrganizationProposerWhiteList()] [Retroactive Whitelist Changes] If proposers are removed from whitelist after creating proposals, can those proposals still be released? Does this create authorization inconsistencies? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: ChangeOrganizationProposerWhiteList()] [Empty Whitelist] Can an organization set ProposerWhiteList to empty, violating the Validate() check at line 93 and preventing all future proposals? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Validate() in Referendum_Helper.cs] [Token Existence Check] At line 95, GetTokenInfo checks if token exists, but can an attacker create an organization with a valid token, then burn all tokens, making the organization unusable? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Validate() in Referendum_Helper.cs] [Threshold Logic] At line 98-101, validation allows MinimalApprovalThreshold == MinimalVoteThreshold. Can proposals be released with zero approval if abstention and rejection are low enough? (Medium)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Validate() in Referendum_Helper.cs] [Negative Threshold] MaximalAbstentionThreshold and MaximalRejectionThreshold can be >= 0. Can setting them to 0 make it impossible to reject or abstain on proposals? (Low)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Release()] [Authorization Check] At line 166, only proposal.Proposer can release. In CreateProposalBySystemContract flow, if Proposer is the system contract, does this prevent legitimate release by the original OriginProposer? (Critical)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Release()] [Threshold Check Timing] IsReleaseThresholdReached is checked at line 168, but vote counts could change between the check and SendVirtualInlineBySystemContract execution. Can this cause unauthorized releases? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Release()] [Virtual Inline Call] SendVirtualInlineBySystemContract at line 169-171 executes arbitrary contract methods. Can an attacker craft proposal.ToAddress and proposal.ContractMethodName to call privileged functions or perform reentrancy attacks? (Critical)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Release()] [Virtual Hash Calculation] CalculateVirtualHash at line 170 uses organization.CreationToken. Can an attacker manipulate CreationToken during organization creation to control the virtual address used in execution? (High)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Release()] [State Cleanup Timing] Proposal is removed at line 174 AFTER execution. If execution calls back into Referendum contract, could the proposal still exist, allowing double-execution or re-entrancy? (Critical)",
  "[File: contract/AElf.Contracts.Referendum/Referendum.cs] [Function: Release()] [Expired Proposal Release] GetValidProposal at line 165 checks ExpiredTime, but can a proposer release an expired proposal if thresholds are met, bypassing time-based governance safeguards? (High)"
]