[
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [Authorization Bypass] Can an attacker call InitialEconomicSystem multiple times before State.Initialized.Value is set to true at line 38, exploiting potential race conditions in concurrent transactions to create duplicate tokens or re-initialize critical contracts? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [State Corruption] If CreateNativeToken fails at line 24 but doesn't revert, could subsequent token creation calls at lines 25-26 proceed with an invalid native token, breaking the economic model's token dependencies? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [DOS Attack] Can an attacker front-run the legitimate InitialEconomicSystem call with a malicious one that sets invalid parameters, causing the assertion at line 18 to permanently block initialization and freeze the entire economic system? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [Missing Validation] Does the function validate that input.MiningRewardTotalAmount at line 30 is within reasonable bounds, or could passing MAX_LONG cause integer overflow when issuing mining rewards to consensus contract? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [Missing Validation] Is input.NativeTokenTotalSupply validated before token creation at line 24, or could an attacker pass 0 or negative values to break token economics? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [Missing Validation] Are input.NativeTokenDecimals checked to be within valid range (e.g., 0-18), or could extreme values cause precision loss or overflow in subsequent token operations? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [Partial Initialization] If InitialMiningReward at line 30 fails after tokens are created, does the contract remain in a partially initialized state where tokens exist but mining rewards are not distributed? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [Cross-Contract Dependency] If State.TokenContract.InitialCoefficients at line 36 or InitializeAuthorizedController at line 37 fail, does State.Initialized get set to true anyway at line 38, leaving the system in an inconsistent state? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [Authorization Bypass] Is there any validation that the caller has authority to initialize the economic system, or can any user call this function if they win the race condition? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: InitialEconomicSystem()] [Supply Manipulation] If input.MiningRewardTotalAmount exceeds input.NativeTokenTotalSupply, does InitialMiningReward at line 30 cause token issuance to exceed total supply cap? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [Authorization Bypass] The native token is created with Issuer = Context.Self at line 61 and Owner = Context.Self at line 63, but could an attacker manipulate Context.Self through delegatecall or similar mechanisms to gain control? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [Supply Manipulation] Is input.NativeTokenTotalSupply at line 58 validated against maximum safe values to prevent overflow in downstream operations like transfers or balance calculations? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [Missing Validation] If input.NativeTokenSymbol is empty, null, or contains special characters, could token creation succeed but break subsequent operations relying on valid symbol formatting? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [Lock Whitelist Bypass] The LockWhiteList at lines 44-52 filters null addresses at line 53, but could an attacker exploit contract address predictability to pre-compute and front-run whitelist additions? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [Token Property Manipulation] The IsBurnable property at line 60 is set from input.IsNativeTokenBurnable, but is this validated to ensure consistency with economic model requirements? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [Primary Token Hijacking] SetPrimaryTokenSymbol is called at line 66 without validation - could calling this multiple times or with malicious symbols break fee payment logic across the chain? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [State Manipulation] If Context.GetContractAddressByName returns null for any contract at lines 46-51, those contracts are excluded from LockWhiteList at line 53, potentially breaking critical lock/unlock functionality for essential contracts? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [Token Name Injection] The TokenName is hardcoded as 'Native Token' at line 57, but should it be validated from input to prevent UI/display confusion attacks? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [Decimals Precision] Could setting NativeTokenDecimals at line 59 to extreme values (0 or 18) cause precision loss or overflow in price calculations with TokenConverter? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateNativeToken()] [Lock Whitelist DOS] Could the Where clause at line 53 filtering null addresses be exploited by an attacker manipulating contract deployments to create an empty whitelist, breaking lock functionality? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateResourceTokens()] [Duplicate Token Creation] The loop at lines 80-103 creates tokens based on Context.Variables arrays - could duplicate symbols in PayTxFeeSymbolListName or PayRentalSymbolListName cause duplicate token creation attempts and revert? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateResourceTokens()] [Supply Inflation] Each resource token gets issued the full ResourceTokenTotalSupply (500M tokens) to tokenConverter at lines 96-102 - is there validation that this doesn't exceed any global supply limits? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateResourceTokens()] [Authorization Bypass] Resource tokens are issued to tokenConverter at line 100 with Issuer = Context.Self at line 90 - could manipulating the tokenConverter address at line 72 redirect these tokens to an attacker-controlled address? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateResourceTokens()] [Symbol Injection] The Union operation at line 82 merging PayTxFeeSymbolListName and PayRentalSymbolListName - could injecting malicious symbols into Context.Variables break downstream token operations? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContract.cs] [Function: CreateResourceTokens()] [Lock Whitelist Vulnerability] The LockWhiteList at lines 74-79 only includes Treasury and TokenConverter - could excluding other critical contracts break resource token locking for vote/profit contracts? (Medium)"
]