[
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Disclosure] Could exposing full miner public keys, signatures, and cryptographic values (OutValue, InValue, PreviousInValue) in log output leak sensitive consensus information to unauthorized parties monitoring logs? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Disclosure] Does displaying ImpliedIrreversibleBlockHeight in logs reveal internal consensus state that could help attackers predict or manipulate LIB calculations? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [DOS] Could an attacker with a maliciously long public key cause performance issues when calling Substring(0, 10) if string length checks are missing? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Disclosure] Does revealing the full mapping between miner public keys and their Order, ExpectedMiningTime, and ActualMiningTimes expose timing attack vectors for consensus manipulation? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Disclosure] Can exposing FinalOrderOfNextRound in logs allow attackers to predict future miner ordering and prepare targeted attacks? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: ToString()] [Input Validation] Does the format string parameter lack validation, potentially allowing format string injection if this output is used in security-sensitive contexts? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Information Disclosure] Could revealing ProducedBlocks and MissedTimeSlots counts help attackers identify and target underperforming or frequently offline miners? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round_GetLogs.cs] [Function: GetLogs()] [Logic Error] If ActualMiningTimes contains timestamps before roundStartTime, could the comparison logic incorrectly categorize legitimate mining times as previous round extra blocks? (Low)"
]