[
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: IsTimeSlotPassed()] [Order Manipulation] The check minerInRound.Order < expectedOrder can be bypassed if Order values are manipulated - can a miner set their Order to int.MaxValue to always appear as slot not passed? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: IsTimeSlotPassed()] [CurrentBlockTime Manipulation] If currentBlockTime can be set to far future or past values, can this allow miners to prematurely pass or indefinitely delay time slot validation? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: CalculateSignature()] [Null Signature Handling] If minerInRound.Signature is null, does HashHelper.XorAndCompute handle it safely, or can null signatures break the aggregate calculation? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: CalculateSignature()] [Signature Withholding] If a miner deliberately withholds their signature (keeps it as null or Hash.Empty), does the XOR aggregate become predictable, allowing signature forgery attacks? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: CalculateSignature()] [XOR Cancellation] Can colluding miners choose signatures that XOR to zero or a predictable value, allowing them to precompute and manipulate the final round signature? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: CalculateSignature()] [Aggregate Order Dependency] If RealTimeMinersInformation.Values enumeration order is non-deterministic, will different nodes compute different aggregate signatures and break consensus? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: CalculateSignature()] [InValue Manipulation] The inValue parameter is XORed with aggregate - can an attacker provide crafted inValue to produce desired output signatures for round manipulation? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetExtraBlockMiningTime()] [Order Manipulation] The function uses OrderBy to find last miner - if Order values are manipulated to be equal or out of sequence, can wrong miner's time be used for extra block calculation? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetExtraBlockMiningTime()] [Null ExpectedMiningTime] If the last miner has null ExpectedMiningTime, will AddMilliseconds throw NullReferenceException and halt extra block production? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetExtraBlockMiningTime()] [Mining Interval Zero] If GetMiningInterval() returns 0, extra block time equals last miner's time - can this cause extra block to be produced at same timestamp as normal block? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetExtraBlockMiningTime()] [Timestamp Overflow] Adding mining interval to ExpectedMiningTime could overflow if time is near max timestamp - can this cause extra block time to wrap to past? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetExtraBlockMiningTime()] [Empty Miner List] If RealTimeMinersInformation is empty, Last() throws exception - can this be exploited to DoS extra block production? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetMinedBlocks()] [Integer Overflow] If ProducedBlocks values are manipulated to be near long.MaxValue, can the Sum() operation overflow and return incorrect total mined blocks count? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetMinedBlocks()] [Negative Block Count] If minerInRound.ProducedBlocks can be negative, can this reduce total count and manipulate reward distributions or consensus metrics? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetMinedBlocks()] [Missing Validation] The function sums without validating ProducedBlocks values - can corrupted or malicious miner data poison the total count? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetMinerList()] [Duplicate Keys] If RealTimeMinersInformation contains duplicate keys, does the MinerList include duplicates, potentially inflating miner count for consensus threshold calculations? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetMinerList()] [Invalid Hex Conversion] If keys are not valid hex strings, can ByteStringHelper.FromHexString throw exceptions and DoS miner list retrieval? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: GetMinerList()] [Empty Key Handling] Can empty or whitespace keys be added to RealTimeMinersInformation, causing invalid MinerList that breaks downstream consensus operations? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: IsInMinerList()] [Case Sensitivity] If pubkey comparison is case-sensitive but miner registration is case-insensitive, can an attacker bypass miner list checks using different casing? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: IsInMinerList()] [Whitespace Handling] Does the function trim or normalize pubkey before checking, or can attackers add whitespace to valid keys to bypass validation? (Low)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: FirstMiner()] [Order Uniqueness] If multiple miners have Order == 1, which one is returned by FirstOrDefault? Can this non-determinism cause different nodes to have different FirstMiner and break consensus? (Critical)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: FirstMiner()] [Missing Miner] If no miner has Order == 1, function returns new MinerInRound() - can this empty miner object cause NullReferenceExceptions in code expecting valid first miner data? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: FirstMiner()] [Empty Count Check] The RealTimeMinersInformation.Count > 0 check returns empty MinerInRound if false - can empty rounds bypass FirstMiner-dependent validation? (Medium)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: FirstActualMiner()] [OutValue Manipulation] The function returns first miner with non-null OutValue - can a late miner set OutValue first to become FirstActualMiner and gain undue consensus authority? (High)",
  "[File: contract/AElf.Contracts.Consensus.AEDPoS/Types/Round.cs] [Function: FirstActualMiner()] [Null Return] Function can return null if no miner has OutValue - can code calling this function crash with NullReferenceException? (Medium)"
]