[
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: TokenConverterFeeRate + ResourceTokenInitialVirtualBalance] [Fee Economics] With a 0.5% fee and tiny initial virtual balance, could the first few trades incur fees larger than the trade value itself due to extreme price volatility from low liquidity? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: All Token Decimals] [Cross-Token Operations] All tokens share 8 decimals, but what if native token is configured with different decimals during deployment? Would this break all TokenConverter operations that assume uniform decimal precision? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: PayTxFeeSymbolListName + PayRentalSymbolListName] [Resource Overlap] If symbols appear in both lists, are resource tokens created once with dual-purpose or twice causing errors? Does union() in CreateResourceTokens() properly deduplicate, or could this cause token creation failures? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Usage: CreateResourceTokens()] [Issuance Vulnerability] Since ResourceTokenTotalSupply is issued entirely to TokenConverter in a single Issue() call, if TokenConverter lacks proper access controls, could an attacker immediately transfer all 500M tokens out? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Usage: CreateElectionTokens()] [Single Transaction Risk] Both VOTE and SHARE tokens (2 billion tokens total) are created and issued in a single InitialEconomicSystem transaction. If this transaction fails partially, could the chain end up in an inconsistent state with one token created but not the other? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Usage: InitializeTokenConverterContract()] [Connector Configuration] Constants define connector balances but not weights (hardcoded to '0.5' and '0.005' in code). Could mismatch between hardcoded weights and constant balances create Bancor formula violations? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Usage: AssertValidMemo()] [Validation Inconsistency] MemoMaxLength=64 is enforced in IssueNativeToken() via AssertValidMemo(), but is this validation applied consistently to all token operations (Issue, Transfer, etc.), or could some paths bypass the memo length check? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Usage: Symbol Lists] [Runtime Dependency] CreateResourceTokens() depends on runtime Context.Variables for symbol lists rather than compile-time constants. Could malicious chain initialization set empty or invalid symbol arrays, causing initialization to succeed with zero resource tokens? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Global: All Constants] [Immutability Risk] ALL constants in this file are immutable after compilation. If any value is misconfigured (wrong decimal places, incorrect balances, typos in fee rate), is there any recovery mechanism short of chain restart or hard fork? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Global: TokenConverterFeeRate] [Fee Adjustment] The 0.5% fee rate cannot be changed after InitializeTokenConverterContract() runs. If market conditions require fee adjustments, does the lack of governance-controlled fee updates create economic inflexibility? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Global: All Supplies] [Supply Economics] Token supplies (500M resource, 1B election) are fixed and immediately issued. Does this prevent future supply adjustments needed for network scaling, forcing eventual governance to create new token contracts? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: All _00000000 suffixes] [Human Error Risk] Many constants use 8-zero suffixes for decimals (e.g., 100_000_00000000). Could developers miscount zeros during deployment configuration, causing 10x or 100x magnitude errors? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: ResourceTokenInitialVirtualBalance] [Missing Decimals] The value 100_000 lacks the _00000000 suffix pattern used elsewhere. Is this intentionally 0.001 tokens, or is it a bug that should be 100_000_00000000? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: All Decimal Values] [Overflow in Calculations] When constants like ResourceTokenTotalSupply (5*10^16) are multiplied with prices or balances in Bancor formulas, could intermediate calculations overflow C# long.MaxValue (9.2*10^18)? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: TokenConverterFeeRate] [String Format Risk] The fee rate '0.005' is a string that must be parsed to decimal. Does the parsing handle edge cases like '0.005000', '.005', or locale-specific formats correctly? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: NativeTokenPrefix] [Prefix Validation] The prefix 'nt' has no length or character validation. Could this prefix create tokens with symbols longer than protocol limits when concatenated with resource symbols? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: PayTxFeeSymbolListName + PayRentalSymbolListName] [Name Collision] Could these constant strings collide with other context variable names in the chain, causing unintended behavior if developers reuse 'SymbolListToPayTxFee' for different purposes? (Low)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Usage: InitialEconomicSystem()] [Initialization Order] Constants are used in sequence: CreateNativeToken → CreateResourceTokens → CreateElectionTokens → InitializeTokenConverterContract. If one step fails, are previous token creations rolled back, or could the chain end up with partial economic system? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Usage: Initialization] [Re-initialization Risk] Is there protection against calling InitialEconomicSystem() multiple times with different constant values? Could an attacker trigger re-initialization to overwrite economic parameters? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Usage: Token Creation] [Lock Whitelist Dependency] CreateResourceTokens() adds TokenConverter to lock whitelist. If TokenConverter address is null at initialization, could this create tokens without proper lock controls, allowing unrestricted token movements? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: Connector Balances] [Front-Running Attack] Given public knowledge of NativeTokenConnectorInitialVirtualBalance and ResourceTokenInitialVirtualBalance before chain launch, could sophisticated attackers pre-calculate optimal front-running strategies for first block trades? (High)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: Resource Token Configuration] [MEV Extraction] With all resource tokens sharing identical supply (500M) and decimals (8) but potentially different actual demand, could MEV bots exploit predictable initialization patterns for arbitrage? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constant: TokenConverterFeeRate] [Sandwich Attacks] Does the 0.5% fee provide sufficient protection against sandwich attacks where attackers front-run and back-run user trades to extract value from price slippage? (Medium)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Constants: Election Token Supply] [Governance Manipulation] Could an attacker who gains control of ElectionContract immediately after initialization distribute 1 billion VOTE tokens to colluding addresses to gain permanent governance control? (Critical)",
  "[File: contract/AElf.Contracts.Economic/EconomicContractConstants.cs] [Usage: TokenContract Integration] [Contract Address Risk] Constants are used to configure TokenContract (MultiToken). If TokenContract address resolution fails during initialization, could constants be applied to wrong contract addresses? (High)"
]