[
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: Withdraw()] [Timestamp Edge Case] Line 227 uses strict less-than (<). If lock timestamp + minutes EQUALS current time, withdrawal fails. Is this one-block delay exploitable? (Low)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: Withdraw()] [LockId Validation] Line 219 asserts lockId != null, but doesn't validate lockId matches expected hash. Can lockId be manipulated in state to unlock wrong user's tokens? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ClaimProfits()] [Authorization Bypass] Line 250 allows input.Beneficiary to be null, defaulting to Context.Sender. Can scheme manager claim profits on behalf of ANY beneficiary by specifying their address? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ClaimProfits()] [Front-Running] Can scheme manager front-run user ClaimProfits by first calling DistributeProfits to change period, causing user's claim to fail or claim wrong period? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ClaimProfits()] [Input Validation] No validation that beneficiary is actually registered in the scheme. Can claiming for non-existent beneficiary cause errors or state corruption? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ClaimProfits()] [Reentrancy] Line 251 delegates to ProfitContract.ClaimProfits. Can malicious ProfitContract re-enter TokenHolderContract during claim to manipulate state? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ClaimProfits()] [DOS Attack] Can attacker repeatedly claim zero profits to consume gas and DOS the claiming mechanism? Should there be rate limiting or minimum claim amounts? (Low)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ClaimProfits()] [State Desync] If ProfitContract.ClaimProfits succeeds but TokenHolderContract state is inconsistent (wrong period, wrong SchemeId), can user claim profits they shouldn't be entitled to? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: ClaimProfits()] [Scheme Validation] Line 249 calls GetValidScheme which may update scheme state. Can claiming trigger unwanted state updates that affect other users? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: GetValidScheme()] [Null Pointer] Line 281 asserts scheme != null, but if scheme doesn't exist, can calling functions that depend on GetValidScheme be permanently DOSed? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: GetValidScheme()] [State Mutation] GetValidScheme calls UpdateTokenHolderProfitScheme which modifies state. Should a getter function modify state? Can this cause unexpected side effects? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: GetValidScheme()] [Parameter Inconsistency] updateSchemePeriod parameter at line 278 is only used in one code path. Can inconsistent usage lead to bugs where period is updated when it shouldn't be? (Medium)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: UpdateTokenHolderProfitScheme()] [State Corruption] Line 289 returns early if SchemeId is set and not updating period. Can this cause scheme data to become stale (wrong Period, Symbol, thresholds)? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: UpdateTokenHolderProfitScheme()] [Wrong Manager] Line 298 saves scheme to State.TokenHolderProfitSchemes[Context.Sender], but function parameter is 'manager'. Can this cause schemes to be saved under wrong keys? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: UpdateTokenHolderProfitScheme()] [FirstOrDefault Risk] Line 293's FirstOrDefault returns null if no schemes exist. Line 294 asserts not null, but is timing gap exploitable between CreateScheme and first update? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: UpdateTokenHolderProfitScheme()] [Period Desync] Line 297 sets scheme.Period from originScheme.CurrentPeriod. If ProfitContract's period is manipulated or incremented separately, can TokenHolder and Profit contracts have different periods? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Function: UpdateTokenHolderProfitScheme()] [Cross-Contract Call] Lines 290-293 call GetManagingSchemeIds. Can malicious ProfitContract return wrong SchemeIds, causing UpdateTokenHolderProfitScheme to link to attacker's scheme? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Cross-Function] [State Race] Can CreateScheme and AddBeneficiary be called concurrently before SchemeId is initialized, causing AddBeneficiary to fail or use wrong scheme? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Cross-Function] [Authorization Chain] GetValidScheme is called by multiple functions but doesn't verify caller authorization. Can unauthorized callers exploit functions that use GetValidScheme? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Cross-Function] [Lock-Unlock Race] Between RegisterForProfits locking tokens and Withdraw unlocking, can RemoveBeneficiary be called to remove user as beneficiary while tokens remain locked? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Cross-Function] [Period Increment] Both DistributeProfits (line 144) and RegisterForProfits (line 204) increment scheme.Period. Can race conditions cause period to skip numbers or increment incorrectly? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Cross-Function] [Beneficiary Management] AddBeneficiary and RemoveBeneficiary don't coordinate with RegisterForProfits. Can scheme manager remove users who registered via RegisterForProfits, leaving their tokens locked? (Critical)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Cross-Function] [Profit Contribution Race] If ContributeProfits and RegisterForProfits auto-distribution happen concurrently, can profits be distributed twice or lost entirely? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Cross-Function] [Scheme Modification] Can scheme manager modify scheme parameters (Symbol, MinimumLockMinutes, AutoDistributeThreshold) after users register, breaking their expectations? (High)",
  "[File: contract/AElf.Contracts.TokenHolder/TokenHolderContract.cs] [Cross-Function] [Claim-Withdraw Race] Can user call ClaimProfits and Withdraw concurrently, claiming profits after beneficiary status is removed? (Medium)"
]