[
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Authorization Bypass] Can an attacker change another user's voting option by front-running the vote transaction and claiming the VoteId before the legitimate voter checks sender permission at line 28, allowing unauthorized vote manipulation? (Critical)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Time Manipulation] If actualLockedSeconds equals claimedLockingSeconds exactly at line 31, does the assertion fail when it should allow withdrawal, causing legitimate users to lose one second and be unable to change votes at expiry? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Integer Underflow] When IsResetVotingTime is false at line 42, can actualLockedSeconds exceed State.LockTimeMap[input.VoteId], causing an underflow in the subtraction and setting LockTimeMap to a massive value that locks funds permanently? (Critical)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [State Inconsistency] Between withdrawing old votes at line 46 and creating new votes at line 52, if the VoteContract state update fails partially, can the voter end up with votes withdrawn from old candidate but not added to new candidate, permanently losing voting power? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Reentrancy] Can the VoteContract.Withdraw call at line 46 or VoteContract.Vote call at line 52 reenter ChangeVotingOption before state updates at lines 64-70 complete, allowing double-spending of votes across multiple candidates? (Critical)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Data Integrity] At line 63, GetNewestPubkey is called but if it returns a pubkey different from votingRecord.Option and oldCandidateVotes is null, does the Remove operation at line 65 fail silently, leaving orphaned vote records? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Arithmetic Error] At lines 66-67, if votingRecord.Amount exceeds oldCandidateVotes.ObtainedActiveVotedVotesAmount due to concurrent operations, can the subtraction cause underflow and set the candidate's votes to a massive value? (Critical)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Race Condition] Between checking candidateInformation at line 25-26 and updating newCandidateVotes at lines 73-94, if the candidate quits the election, can votes still be assigned to a non-candidate, breaking the invariant that only active candidates receive votes? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Null Pointer] At line 74, if newCandidateVotes is null (new candidate), the else branch creates new CandidateVote at line 86, but if input.CandidatePubkey is invalid hex, can ByteStringHelper.FromHexString throw and revert after old votes are already withdrawn? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Logic Error] At line 97, if dataCenterList.DataCenters.ContainsKey(input.CandidatePubkey) is true, votes are added at line 99-100, but if the candidate was just removed from DataCenter between lines 96-97, can stale data cause incorrect vote counting? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Boundary Condition] At line 102, GetValidationDataCenterCount() is compared with DataCenters.Count, but if GetValidationDataCenterCount() returns 0, can all candidates be added to DataCenter list regardless of vote amount, breaking the validation data center limit? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [DOS Attack] Can an attacker repeatedly call ChangeVotingOption with IsResetVotingTime=true at line 33, causing ExtendVoterWelfareProfits to be called repeatedly and exhausting gas through ProfitContract.FixProfitDetail calls? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Profit Manipulation] At line 37, ExtendVoterWelfareProfits extends the endPeriod without checking if the voter has already claimed profits, can an attacker extend profits after claiming to receive duplicate rewards? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [Vote Replay] At line 54, VoteId is reused with IsChangeTarget=true, but if the same VoteId exists in multiple voting items, can this cause vote collision and overwrite unrelated votes? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ChangeVotingOption()] [State Desync] Between updating oldCandidateVotes at line 70 and newCandidateVotes at line 81, if a transaction reverts after line 70, can the old candidate permanently lose vote count without the new candidate gaining it? (Critical)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ExtendVoterWelfareProfits()] [Arithmetic Error] At line 133, lockTime.Div(State.TimeEachTerm.Value) calculates lockPeriod, but if TimeEachTerm is 0 or very large, can this cause division by zero or lockPeriod to be incorrectly 0, skipping profit extension? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ExtendVoterWelfareProfits()] [Early Return Bypass] At lines 134-137, if lockPeriod is 0, the function returns early without extending profits, can voters with very short lock times (less than TimeEachTerm) change votes without profit extension penalties? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ExtendVoterWelfareProfits()] [Integer Overflow] At line 139, lockPeriod.Add(treasury.CurrentPeriod) calculates endPeriod, but if both values are near Int64.MaxValue, can overflow cause endPeriod to wrap to a small value, allowing premature profit claims? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ExtendVoterWelfareProfits()] [Null Reference] At line 141, if GetProfitDetailByElectionVotingRecord returns null (no existing profit detail), the else branch at line 158 throws AssertionException, but can this be triggered by legitimate users who voted before profit system was initialized? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ExtendVoterWelfareProfits()] [External Call Failure] At line 144, ProfitContract.FixProfitDetail is called, but if it fails or reverts, does the LockTimeMap remain updated while profit extension fails, causing state inconsistency? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ExtendVoterWelfareProfits()] [Share Manipulation] At line 150, electionVotingRecord.Weight is used as Shares, but if GetVotesWeight calculation is manipulated, can a voter extend profits with inflated shares and drain the welfare pool? (Critical)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ExtendVoterWelfareProfits()] [StartPeriod Reset] The comment at line 143 states",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: ExtendVoterWelfareProfits()] [Treasury State Race] At line 128, treasury.CurrentPeriod is fetched, but if Treasury advances to next period between line 128 and line 152 when FixProfitDetail is called, can endPeriod be off by one period? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: GetProfitDetailByElectionVotingRecord()] [Logic Error] At line 177, profitDetail is searched by Id == voteId (new rule), but if Id is null, it falls back to Shares == Weight at line 181 (old rule), can this match wrong profit details if multiple voters have identical weight? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: GetProfitDetailByElectionVotingRecord()] [Data Collision] At line 181, LastOrDefault is used to find profit detail by Shares, but if multiple profit details have the same Shares value, can the wrong detail be returned, causing incorrect profit extensions? (High)"
]