[
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Token Existence Check Missing] SetMethodFee does not validate that fee token symbols exist in TokenContract - can non-existent or typo'd symbols be configured as fees? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Fixed Fee Economic Attack] The 100 ELF Create fee is fixed regardless of ELF price - if ELF appreciates 100x, does the $10,000+ creation cost make NFT protocol unusable, causing economic DOS? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Fee Collection Bypass] Zero fees returned for non-Create methods means Mint, Transfer, Approve operations cost nothing - can attackers spam thousands of free transactions to bloat chain state? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Fee Change DOS] If SetMethodFee is eventually implemented, lack of rate limiting or proposal thresholds could allow rapid fee changes causing transaction failures and user confusion - is this a governance attack vector? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Revenue Leakage] NFT contract operations generate no method fees for Treasury/Profit distribution unlike MultiToken - does this represent lost revenue for the ecosystem? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Stub Implementation Risk] The empty SetMethodFee implementation may be intended as stub - if contract is deployed before completion, can governance be permanently broken requiring contract migration? (Critical)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: ChangeMethodFeeController()] [Stub Implementation Risk] The empty ChangeMethodFeeController may be placeholder - if live on mainnet, can the method fee controller never be properly set, freezing fee governance? (Critical)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFeeController()] [Integration Failure] Other contracts expecting valid AuthorityInfo from GetMethodFeeController will receive empty object - does this break Parliament proposal creation for NFT fee changes? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Fee Calculation Inconsistency] MultiToken's GetMethodFee returns size-fee-free for system methods - should NFT contract similarly exempt certain methods from size fees? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Method Name Mismatch] The check 'input.Value == nameof(Create)' assumes exact string match - if protobuf method names differ from C# method names or get renamed during compilation, could fee lookup fail? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Case Sensitivity] String comparison is case-sensitive - if callers pass 'create' or 'CREATE' instead of 'Create', will they incorrectly receive zero fees? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Null Input Handling] GetMethodFee does not check if input or input.Value is null - can null reference exceptions be triggered by malformed calls? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Missing Assert Statements] No Assert() calls validate preconditions - should there be checks that MethodFees.MethodName is not empty, Fees array is not null, or BasicFee is non-negative? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: ChangeMethodFeeController()] [Missing Assert Statements] No Assert() validates AuthorityInfo fields - should implementation check that OwnerAddress and ContractAddress are not null or Address.Zero? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Re-entrancy Safety] SetMethodFee performs no operations, but if implemented with cross-contract calls (token validation), could re-entrancy be exploited to bypass authorization checks? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: ChangeMethodFeeController()] [Re-entrancy Safety] ChangeMethodFeeController with CheckOrganizationExist cross-contract call could enable re-entrancy - should checks-effects-interactions pattern be enforced? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Symbol Validation Missing] Context.Variables.NativeSymbol is used without validating it's a registered token - could unregistered symbol cause fee collection to fail? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [Multi-Symbol Fee Missing] Implementation doesn't handle multiple fee symbols per method like MultiToken does - is single-symbol fee limitation intentional or missing functionality? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Fee Amount Overflow] The BasicFee is hardcoded to 100_00000000 (100 ELF with 8 decimals) - could this value overflow in certain contexts or currencies? (Low)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: All Methods] [Partial Class State] This is partial class NFTContract - do other partial files implement state that these methods should use, causing integration bugs? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: All Methods] [Missing Reference State] NFTContractState does not include MethodFeeController or TransactionFees - were these deliberately omitted to create stub implementation? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: All Methods] [Contract Base Class] Class inherits from NFTContractContainer.NFTContractBase (seen in other files) - does base class expect ACS1 implementation that's not provided? (Medium)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFee()] [Fee Consistency Invariant] GetMethodFee should return fees that match what SetMethodFee configured, but implementation returns hardcoded value - is this invariant violation exploitable? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: GetMethodFeeController()] [Controller Consistency Invariant] GetMethodFeeController should return the authority set by ChangeMethodFeeController, but returns empty - does this break governance workflows? (High)",
  "[File: contract/AElf.Contracts.NFT/NFTContract_ACS1.cs] [Function: SetMethodFee()] [State Mutation Invariant] SetMethodFee should modify state to reflect new fees, but modifies nothing - can this cause auditor-visible state to diverge from actual behavior? (High)"
]