[
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: Vote()] [Weight Calculation Manipulation] At line 443, GetVotesWeight calculates voting weight using lockSeconds, but if interest rates or proportions are manipulated between voteId generation and AddBeneficiaryToVoter, can voters receive incorrect welfare shares? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: Vote()] [Beneficiary Addition Failure] At line 443, AddBeneficiaryToVoter adds voter to welfare scheme, but if ProfitContract rejects (scheme full, duplicate beneficiary), does the vote still succeed without welfare eligibility? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: Vote()] [DataCenter Ranking Manipulation] At line 446, if rankingList.DataCenters.ContainsKey(candidate) is checked, but between check and update at line 448, another voter updates the ranking, can votes be added twice causing inflated candidate ranking? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: Vote()] [DataCenter Count Boundary] At line 454, if GetValidationDataCenterCount() returns a value that changes dynamically, can candidates be added/removed from DataCenter unexpectedly causing benefit churn? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: Vote()] [AddBeneficiary DOS] At line 458, AddBeneficiary is called for new DataCenter members, but if ProfitContract limits beneficiary count and limit is reached, can valid candidates be excluded from subsidies? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: Vote()] [TryToBecomeAValidationDataCenter Race] At line 462, if multiple voters simultaneously vote for candidates outside DataCenter, can race condition cause incorrect minimum candidate detection and wrong candidate replacement? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: TryToBecomeAValidationDataCenter()] [Minimum Detection Logic] At lines 475-481, minimumVotes is compared to find smallest DataCenter member, but if multiple candidates have equal minimum votes, only the first is replaced, can this cause unfair replacement selection? (Low)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: TryToBecomeAValidationDataCenter()] [Replace Flag Logic] The replaceWillHappen flag is set at line 478 but only checked at line 483, if candidateVotesAmount equals pubkeyToVotesAmount.Value exactly, the replacement doesn't happen even though new candidate should have priority? (Low)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: TryToBecomeAValidationDataCenter()] [DataCenter State Inconsistency] At lines 485-487, minimumVotesCandidate is removed and new candidate added, but if NotifyProfitReplaceCandidateInDataCenter at line 488 fails, can DataCenter list be updated without profit beneficiary updates? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: TryToBecomeAValidationDataCenter()] [Beneficiary Notification Failure] At line 488, NotifyProfitReplaceCandidateInDataCenter removes old beneficiary and adds new one, but if RemoveBeneficiary succeeds and AddBeneficiary fails, can the subsidy scheme lose a beneficiary slot permanently? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: UpdateElectorInformation()] [Public Key Recovery] At line 500, GetElectorVote uses recoveredPublicKey, but if public key recovery fails (invalid signature), can voterVotes be null and cause incorrect new ElectorVote creation at line 504? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: UpdateElectorInformation()] [Address vs PublicKey Storage] At line 519, ElectorVotes are stored by Context.Sender.ToBase58(), but GetElectorVote at line 524 tries to read from same key first then publicKey.ToHex(), can this cause storage fragmentation with duplicate records? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: UpdateElectorInformation()] [Overflow in Vote Accumulation] At lines 515-516, ActiveVotedVotesAmount and AllVotedVotesAmount are incremented by amount, but if a voter votes many times with large amounts, can these values overflow Int64.MaxValue? (Low)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: UpdateElectorInformation()] [Duplicate VoteId Addition] At line 514, voteId is added to ActiveVotingRecordIds, but there's no check for duplicates, can the same voteId be added multiple times if Vote() is called with identical parameters? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: GetElectorVote()] [Legacy Migration Issue] At lines 531-536, if ElectorVotes exist under old publicKey.ToHex() format, they're migrated to address-based storage and old entry removed, but if migration fails mid-way, can votes be lost? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: GetElectorVote()] [Null Public Key] At line 527, if recoveredPublicKey is null, the function returns null, but in UpdateElectorInformation at line 502, this causes new ElectorVote creation even if user has existing votes under address key? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: GetElectorVote()] [Clone Operation] At line 531, voterVotes is cloned, but if the clone is shallow and contains reference types (like ActiveVotingRecordIds list), can modifications affect the original stored value? (Low)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: GetElectorVote()] [Address Assignment] At line 534, Address is assigned from Context.Sender if null, but if the original votes were created before address tracking, can this cause voter identity confusion? (Low)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: UpdateCandidateInformation()] [Null CandidateVotes Creation] At lines 550-557, if candidateVotes is null, a new CandidateVote is created with ByteStringHelper.FromHexString(candidatePublicKey), but if hex string is invalid, can this throw exception after elector state is already updated? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: UpdateCandidateInformation()] [Vote Amount Overflow] At lines 562-565, ObtainedActiveVotedVotesAmount and AllObtainedVotedVotesAmount are incremented, can these overflow if candidate receives excessive votes? (Low)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: UpdateCandidateInformation()] [Duplicate VoteId in Candidate] At line 561, voteId is added to ObtainedActiveVotingRecordIds without duplicate check, if Vote() is called multiple times with same voteId through different paths, can candidate vote count be inflated? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: UpdateCandidateInformation()] [Return Value Usage] The function returns ObtainedActiveVotedVotesAmount at line 570, but if this value is used for critical decisions in Vote() and it's stale due to race conditions, can incorrect DataCenter updates occur? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: GetVotesWeight()] [Division by Zero] At line 575, lockDays is calculated as lockTime.Div(DaySec), if DaySec constant is modified or lockTime is 0, can this cause incorrect weight calculation? (Low)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: GetVotesWeight()] [Interest Rate Loop Logic] At lines 579-586, the function iterates VoteWeightInterestInfos and breaks on first instMap.Day > lockDays, but if list is unordered or empty, can this cause wrong interest selection or index out of bounds? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContract_Elector.cs] [Function: GetVotesWeight()] [Interest Calculation Overflow] At line 583, initBase is calculated as 1 + (decimal)instMap.Interest / instMap.Capital, then Pow is called at line 584, if Interest/Capital ratio is large, can Pow result overflow and cause massive vote weight? (Critical)"
]