[
  "[File: contract/AElf.Contracts.Election/ElectionContractState.cs] [States: CandidateVotes, DataCentersRankingList] [Ranking Desync] Can vote amounts in CandidateVotes differ from the corresponding amounts in DataCentersRankingList, causing incorrect subsidy beneficiary selection? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContractState.cs] [States: Candidates, CandidateInformationMap] [Candidate Existence Mismatch] Can a pubkey exist in Candidates list but not in CandidateInformationMap (or vice versa), breaking candidate validation and voting logic? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContractState.cs] [States: BannedPubkeyMap, Candidates] [Banned Candidate Active] Can a pubkey be marked as banned in BannedPubkeyMap while still appearing in Candidates list, allowing banned candidates to receive votes? (Critical)",
  "[File: contract/AElf.Contracts.Election/ElectionContractState.cs] [States: InitialMiners, Candidates] [Initial Miner Duplicate] Can initial miners from InitialMiners also appear in Candidates list, causing confusion about their status and potentially double subsidies? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContractState.cs] [States: LockTimeMap, ElectorVotes] [Lock-Vote Orphans] Can vote IDs in ElectorVotes.ActiveVotingRecordIds lack corresponding entries in LockTimeMap, allowing votes without lock time restrictions? (High)",
  "[File: contract/AElf.Contracts.Election/ElectionContractState.cs] [States: CandidateAdmins, ManagedCandidatePubkeysMap] [Admin-Managed Bidirectional Consistency] If CandidateAdmins maps pubkey X to admin A, but ManagedCandidatePubkeysMap doesn't include X in A's list, can this cause permission check bypasses or failures? (Medium)",
  "[File: contract/AElf.Contracts.Election/ElectionContractState.cs] [States: CandidateReplacementMap, CandidateVotes] [Replaced Candidate Votes] When a candidate pubkey is replaced in CandidateReplacementMap, are votes properly migrated from old to new pubkey in CandidateVotes, or can votes be lost? (High)"
]